{
  "date": "2026-01-14",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 50,
  "gw_related_papers": 14,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.06346",
      "title": "On Causality and Predictivity",
      "authors": [
        "Damiano Anselmi"
      ],
      "abstract": "General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); History and Philosophy of Physics (physics.hist-ph) Certain approaches to quantum gravity, such as the one based on the concept of purely virtual particles (fakeons), sacrifice the cause-effect relation at very small scales to reconcile renormalizability with unitarity. Other developments have also urged caution regarding the idea of causality as a fundamental principle. In this paper, we examine the problem from multiple perspectives, including locality and predictivity, and extend the existing skepticism in several directions. Emphasizing the impact of unruly \"disruptors\", we point out that the illusory arrow of time associated with causality and predictivity is inherently statistical. This renders the cause-effect relation strained at the microscopic level. We also show that causation is a borderline concept that demands belief in entities which can act on nature without being part of it. Ultimately, not only is renouncing microcausality a reasonable price to pay for a consistent and predictive theory of quantum gravity (as is the one based on the fakeon idea), but the very notion of causality is misleading. Resting as it does on metaphysical assumptions, it should therefore be abandoned in fundamental physics.",
      "pdf_url": "https://arxiv.org/pdf/2601.06346.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06416",
      "title": "Symplectic mechanics of relativistic spinning compact bodies. III. quadratic-in-spin integrability in Type-D Einstein spacetimes: persistence and breakdown",
      "authors": [
        "Paul Ramond",
        "Soichiro Isoyama",
        "Adrien Druart"
      ],
      "abstract": "Symplectic mechanics of relativistic spinning compact bodies. III. quadratic-in-spin integrability in Type-D Einstein spacetimes: persistence and breakdown Paul Ramond, Soichiro Isoyama, Adrien Druart General Relativity and Quantum Cosmology (gr-qc) We develop a covariant Hamiltonian formulation of the Mathisson-Papapetrou-Tulczyjew-Dixon dynamics at quadratic order in spin under the Tulczyjew-Dixon spin supplementary condition (TD SSC). In four-dimensional, type-D Einstein (vacuum/$\\Lambda$-vacuum) spacetimes admitting a non-degenerate Killing-Yano (KY) tensor, we reduce via a Dirac bracket to the 10-dimensional physical phase space and model the quadratic sector with a spin-induced quadrupole characterized by a deformability $\\kappa$ ($\\kappa=1$ for black-hole--like; $\\kappa\\neq 1$ for material or exotic compact objects). For $\\kappa=1$, we construct five independent first integrals -- an autonomous Hamiltonian, two KY-generated Killing invariants, a linear Rüdiger constant, and a quadratic Carter-Rüdiger constant -- establishing Liouville-Arnold integrability at quadratic order in spin. For $\\kappa\\neq 1$, the symmetry-generated invariants are not conserved in general and integrability does not persist at this order. The proof proceeds via covariant Poisson-bracket computations using a null bivector decomposition; Kerr is recovered as a special case. These results show that integrability can persist beyond Kerr and beyond the linear-in-spin regime, laying groundwork for symmetry-based, beyond-Kerr modelling of asymmetric-mass, spinning compact binaries.",
      "pdf_url": "https://arxiv.org/pdf/2601.06416.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06438",
      "title": "Cosmological Dynamics on a Novel $f(Q)$ Gravity Model with Recent DESI DR2 Observation",
      "authors": [
        "S. A. Kadam",
        "D. Revanth Kumar",
        "Santosh Kumar Yadav"
      ],
      "abstract": "Cosmological Dynamics on a Novel $f(Q)$ Gravity Model with Recent DESI DR2 Observation S. A. Kadam, D. Revanth Kumar, Santosh Kumar Yadav 13 pages, 3 tables, and 6 figures General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) In this article, we investigate the cosmological viability of a modified symmetric teleparallel gravity model within the $f(Q)$ framework. We derive observational constraints on the model parameters by performing a Markov Chain Monte Carlo analysis using a combined dataset consisting of cosmic chronometers, PantheonPlus SH0ES, and DESI BAO DR2. Our analysis yields the best-fit values for the model parameters $m=-0.386 \\pm 0.090$ and $n=-1.055 \\pm 0.047$, along with the cosmological parameters at present: $H_0 = 73.19 \\pm 0.25$, $q_0 = -0.51 \\pm 0.6$, and $\\omega_{0} = -0.73 \\pm 0.3$, at 68\\% CL. Furthermore, we examine the physical behavior of the model, focusing on the effective equation of state and deceleration parameter. Our findings indicate that the model experiences a transition from the early deceleration phase to the late-time cosmic acceleration, and the transition occurs at a redshift $z_{tr} = 0.573$. We also analyse the $om(z)$ diagnostic, which reflects a positive slope, supporting the behavior of the equation of state parameter in the quintessence region.",
      "pdf_url": "https://arxiv.org/pdf/2601.06438.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06488",
      "title": "Distinguishing Black Holes and Neutron Stars through Optical Images",
      "authors": [
        "Chen-Yu Yang",
        "Xiao-Xiong Zeng"
      ],
      "abstract": "Distinguishing Black Holes and Neutron Stars through Optical Images Chen-Yu Yang, Xiao-Xiong Zeng General Relativity and Quantum Cosmology (gr-qc) This paper employs the backward ray tracing method to study the optical images of neutron stars under the conditions of a spherical light source and a thin accretion disk, considering a polynomial equation of state given by $p = K \\rho^{1 + 1/n_c}$. By numerically solving the TOV equations, we obtain the interior solutions of neutron stars for different densities. The results indicate that as the polynomial index $n_c$ increases, the mass, radius, and compactness of the neutron star all increase, which has a significant impact on its optical properties. Under the assumption that the light is truncated at the surface of the neutron star, we find that for a spherical light source, an increase in $n_c$ leads to an enlargement of the Einstein ring radius. For a thin accretion disk, the light intensity always reaches its maximum at the surface of the neutron star. The increase in $n_c$ also causes the outline of the neutron star to grow. When the observer inclination angle $\\theta_o$ changes, the neutron star's outline deforms from a circular shape to a D shape, with the left side being significantly brighter than the right side. In addition, this paper also investigates the distribution characteristics of the redshift factor. At lower observer inclination angles, gravitational redshift dominates, while at higher inclination angles, the Doppler effect induces noticeable blueshift. Compared to the Schwarzschild black hole, the optical appearance of the neutron star shows significant differences. The study provides a theoretical basis for distinguishing neutron stars from black holes using high-resolution imaging and for constraining the equation of state.",
      "pdf_url": "https://arxiv.org/pdf/2601.06488.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06491",
      "title": "Probing a Lorentz-violating parameter from orbital precession of the S2 star around the galactic centre supermassive black hole",
      "authors": [
        "Qi Qi",
        "Yu Sang",
        "Xiao-Mei Kuang"
      ],
      "abstract": "Probing a Lorentz-violating parameter from orbital precession of the S2 star around the galactic centre supermassive black hole Qi Qi, Yu Sang, Xiao-Mei Kuang General Relativity and Quantum Cosmology (gr-qc) Testing Lorentz symmetry in strong gravitational fields provides a promising probe of extensions to general relativity. The supermassive black hole Sgr~A* and the orbit of the S-stars offer a laboratory for such tests in a regime beyond weak field limit. We analyze the S2 orbital data focusing on the Schwarzschild-like black hole within bumblebee gravity, where deviations from general relativity are encoded in a single Lorentz-violating parameter $\\ell$. Using a full 14-dimensional Markov Chain Monte Carlo analysis under uniform and Gaussian priors, we obtain $\\ell = {-8.01 \\times 10^{-5}}^{+2.77 \\times 10^{-4}}_{-2.09 \\times 10^{-4}} $ and $\\ell = {1.00 \\times 10^{-5}}^{+2.90 \\times 10^{-4}}_{-2.91 \\times 10^{-4}} $ at $1\\sigma$ confidence level, respectively. These constraints are about three orders of magnitude tighter than those from Event Horizon Telescope imaging of Sgr~A*.",
      "pdf_url": "https://arxiv.org/pdf/2601.06491.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06661",
      "title": "Kerr-Newman-de Sitter black holes in $f(R)$ gravity with constant curvature: horizon structure and extremality",
      "authors": [
        "Alikram N. Aliev",
        "Göksel Daylan Esmer"
      ],
      "abstract": "Kerr-Newman-de Sitter black holes in $f(R)$ gravity with constant curvature: horizon structure and extremality Alikram N. Aliev, Göksel Daylan Esmer General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) The theory of $f(R)$ gravity with constant curvature (i.e. constant scalar curvature) admits rotating and charged black hole solutions obtained from the Kerr-Newman-(A)dS metrics of general relativity through appropriate rescalings of the metric parameters. In this paper, we focus on the Kerr-Newman-de Sitter case and present a unified analytic treatment of the horizon structure and its physical properties, allowing for a transparent comparison between general relativity and $ f(R)$ gravity with constant curvature. We solve the quartic equation determining the horizon locations and derive closed analytic expressions for the horizon radii. Focusing on extremal configurations, we obtain analytic formulas for the squared rotation parameter $ a^2 $ and the inverse square of the curvature radius $ l^{-2} $ as functions of the horizon location and the electric charge. For generic values of these parameters, the extremality conditions are non-universal, reducing to the familiar Kerr-Newman bound only in the limit of vanishing background curvature. We identify an ultra-extremal configuration in which $ a^2 $ attains its maximal value at zero charge and decreases monotonically to zero as the charge approaches its limiting value, while $ l^{-2 }$ increases correspondingly. As an illustrative example, we show that black holes with charge $ q=M/2 $ necessarily possess a minimum rotation, which emerges naturally as an intersection point in our analytic description of $ a^2 $ and $ l^{-2 }$, when embedded in a universe characterized by a critical value of $ l^{-2} $ (equivalently, the scalar curvature or the cosmological constant). Finally, we demonstrate that when the mass satisfies $ M^2= (a^2+q^2)(1-a^2/l^2)$, the quartic horizon equation factorizes, leading in the extremal regime to a chiral-like horizon structure that allows only the outer-cosmological horizon merger.",
      "pdf_url": "https://arxiv.org/pdf/2601.06661.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06684",
      "title": "Limits of vacuum-template subtraction for LISA massive black hole binary sources in realistic environments",
      "authors": [
        "Lorenz Zwick"
      ],
      "abstract": "Limits of vacuum-template subtraction for LISA massive black hole binary sources in realistic environments Lorenz Zwick Submitted to PrD, commments welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We investigate the impact of gravitational wave (GW) dephasing due to gas accretion on the subtraction of massive black hole (MBH) binary signals over 4 yr of LISA data in the context of the global-fit. Based on state of the art predictions for the population of merging MBHs, we show that imperfect subtraction with vacuum waveform templates leaves a GW residual with an SNR of $3.2^{+5.4}_{-1.9}\\times \\sqrt{f_{\\rm Edd} \\langle \\dot n \\rangle/(20\\, {\\rm yr}^{-1})}$, where $f_{\\rm Edd}$ is the typical Eddington ratio and $\\langle \\dot n \\rangle$ the mean merger rate of LISA MBH binaries. We characterize the dependence of the residual on key population hyper-parameters, provide a simple fitting function and discuss detection and mitigation strategies.",
      "pdf_url": "https://arxiv.org/pdf/2601.06684.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.06711",
      "title": "Event Horizon Telescope Observational Constraints on Dymnikova-Type Non-Singular Black Holes in Higher Dimensions",
      "authors": [
        "A. Errehymy",
        "Y. Khedif",
        "M. Daoud",
        "Y. Myrzakulov",
        "O. Donmez",
        "B. Turimov"
      ],
      "abstract": "Event Horizon Telescope Observational Constraints on Dymnikova-Type Non-Singular Black Holes in Higher Dimensions A. Errehymy, Y. Khedif, M. Daoud, Y. Myrzakulov, O. Donmez, B. Turimov 11 pages, 5 figures; accepted for publication in Physics Letters B General Relativity and Quantum Cosmology (gr-qc) Black holes are among the most compelling predictions of general relativity (GR) and are now strongly supported by observations from gravitational-wave detectors and the Event Horizon Telescope (EHT). While standard black hole solutions suffer from central singularities, regular black holes avoid this issue by introducing a nonsingular core. In this work, we extend the Dymnikova regular black hole to higher dimensions using a smooth matter distribution. The resulting spacetime features a de Sitter-like core and two horizons. We analyze photon motion and show that circular photon orbits remain unstable, giving rise to a well-defined black hole shadow. Our results indicate that the shadow size grows with the black hole scale but decreases slightly as the number of dimensions increases. We also investigate thermodynamic properties, including Hawking temperature and energy emission, and find a strong dependence on dimensionality. Finally, we compare our model with EHT observations to place constraints on the parameters and highlight potential observational signatures of higher-dimensional regular black holes.",
      "pdf_url": "https://arxiv.org/pdf/2601.06711.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.06741",
      "title": "Quantum coherence of continuous variables in the black hole quantum atmosphere",
      "authors": [
        "Xiaofang Liu",
        "Cuihong Wen",
        "Jieci Wang"
      ],
      "abstract": "Quantum coherence of continuous variables in the black hole quantum atmosphere Xiaofang Liu, Cuihong Wen, Jieci Wang General Relativity and Quantum Cosmology (gr-qc) Recently, the concept of quantum atmosphere has been introduced as a potential origin of Hawking quanta. This study investigates the properties of quantum fields by exploring the quantum coherence of a two-mode Gaussian state near a black hole, where Hawking quanta originate from the quantum atmosphere region. It is demonstrated that both physically accessible and inaccessible quantum coherence for continuous variable quantum states distinctly exhibit hallmark features of the quantum atmosphere. Specifically, the quantum coherence for these states varies continuously with changes in the normalized distance; it undergoes rapid decreases (or increases) just outside the event horizon before gradually stabilizing through subsequent increases (or decreases). This behavior contrasts with the behaviors of quantum coherence where originates solely from the black hole's event horizon. The quantum features of the fields distinctly reflect characteristics attributable to the quantum atmosphere, thereby deepening our understanding of the origins of Hawking radiation. We also find that the continuous variable coherence is highly dependent on both the squeezing parameter and field frequency of the prepared state; therefore, appropriately adjusting these values can enhance our ability to detect features within the quantum atmosphere. It is noteworthy to observe that quantum features of fields do not entirely dissipate in the quantum atmosphere region, indicating that tasks related to quantum information processing can still be executed there.",
      "pdf_url": "https://arxiv.org/pdf/2601.06741.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06743",
      "title": "Gravitational radiation reaction for compact binary systems at the fourth-and-a-half post-Newtonian order in harmonic coordinates",
      "authors": [
        "Luc Blanchet",
        "Guillaume Faye",
        "Emeric Seraille",
        "David Trestini"
      ],
      "abstract": "Gravitational radiation reaction for compact binary systems at the fourth-and-a-half post-Newtonian order in harmonic coordinates Luc Blanchet, Guillaume Faye, Emeric Seraille, David Trestini General Relativity and Quantum Cosmology (gr-qc) We derive the gravitational radiation-reaction (RR) force in the harmonic coordinate system at the fourth-and-a-half post-Newtonian (4.5PN) order in the case of compact binary systems. Dimensional regularization is used to treat the ultra-violet divergences which appear at that order. We prove that the RR acceleration implies the known radiation fluxes at infinity associated with energy, angular momentum, linear momentum, and center-of-mass position. As a consistency check, we verify the manifest Lorentz invariance of the RR acceleration in harmonic coordinates. Our result should be useful for comparisons with other approaches such as the gravitational self force (GSF) and the post-Minkowskian (PM) effective field theory.",
      "pdf_url": "https://arxiv.org/pdf/2601.06743.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06769",
      "title": "Reductions of Thermodynamic Phase Space for Rotating Regular Black Holes",
      "authors": [
        "Qi-Quan Li",
        "Yu Zhang",
        "Hoernisa Iminniyaz"
      ],
      "abstract": "Reductions of Thermodynamic Phase Space for Rotating Regular Black Holes Qi-Quan Li, Yu Zhang, Hoernisa Iminniyaz General Relativity and Quantum Cosmology (gr-qc) The black hole singularity problem was proposed by Hawking and Penrose, and regular black holes serve as an important class of models to address this issue. However, the study of regular black hole thermodynamics has long faced a fundamental difficulty: an inconsistency between the Hawking temperature derived from thermodynamics and the geometrically defined Hawking temperature. To address this issue, we systematically investigated the thermodynamics of rotating regular black holes based on the method of thermodynamic phase space reduction. Our research shows that this approach naturally yields a self-consistent and complete thermodynamic description for rotating regular black holes, thereby establishing a universal thermodynamic framework for this type of black hole and laying the foundation for further research on complex thermodynamic phenomena.",
      "pdf_url": "https://arxiv.org/pdf/2601.06769.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06864",
      "title": "Boundary-only weak deflection angles from isothermal optical geometry",
      "authors": [
        "Ali Övgün",
        "Reggie C. Pantig"
      ],
      "abstract": "Boundary-only weak deflection angles from isothermal optical geometry Ali Övgün, Reggie C. Pantig 32 pages, 0 figures. Comments are welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We develop a boundary only method for computing weak gravitational deflection angles at finite source and receiver distances within the Gauss-Bonnet theorem formulation of optical geometry. Exploiting the fact that the relevant equatorial optical manifold is two dimensional, we introduce isothermal (conformal) coordinates in which the optical metric is locally conformal to a flat reference metric and the Gaussian curvature reduces to a Laplacian of the conformal factor. Such an identity converts the curvature area term in the Gauss-Bonnet theorem into a pure boundary contribution via Green/Stokes-type relations, yielding a deflection formula that depends only on boundary data and controlled closure terms. The residual normalization freedom of the isothermal radius is isolated as an additive freedom in the conformal factor and is shown to leave physical observables invariant, eliminating the need for orbit dependent calibration prescriptions. We explicitly implement the boundary only formalism in weak deflection, where the leading bending reduces to elementary one-dimensional integrals evaluated on a flat reference ray in the conformal plane, with finite distance dependence entering solely through endpoint data. We validate the construction by reproducing finite distance weak deflection for Schwarzschild, deriving the leading finite distance charge correction for Reissner-Nordström, and applying the same boundary only framework to the Kottler (Schwarzschild-de Sitter) geometry as a representative non-asymptotically flat test case, recovering the standard finite distance expansion including the explicit $\\mathcal{O}(\\Lambda)$ and mixed $\\mathcal{O}(\\Lambda M)$ contributions to the total deflection angle.",
      "pdf_url": "https://arxiv.org/pdf/2601.06864.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06905",
      "title": "Numerical Study of Polytropes with n=1 and Differential Rotation",
      "authors": [
        "T.L. Razinkova",
        "A.V. Yudin",
        "S.I. Blinnikov"
      ],
      "abstract": "Numerical Study of Polytropes with n=1 and Differential Rotation T.L. Razinkova, A.V. Yudin, S.I. Blinnikov Astronomy Reports, 2024, Vol. 68, No. 12, pp. 1423-1436 General Relativity and Quantum Cosmology (gr-qc); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR) The solution space of differentially rotating polytropes with n=1 has been studied numerically. The existence of three different types of configurations: from spheroids to thick tori, hockey puck-like bodies and spheroids surrounded by a torus, separate from or merging with the central body has been proved. It has been shown that the last two types appear only at moderate degrees of rotation differentiality, sigma~2. Rigid-body or weakly differential rotation, as well as strongly differential, have not led to any \"exotic\" types of configurations. Many calculated configurations have had extremely large values of parameter tau, which has raised the question of their stability with respect to fragmentation.",
      "pdf_url": "https://arxiv.org/pdf/2601.06905.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06908",
      "title": "Note on the matter coupling in Exotic General Massive 3D Gravity",
      "authors": [
        "Hakan Cebeci"
      ],
      "abstract": "Note on the matter coupling in Exotic General Massive 3D Gravity Hakan Cebeci General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, within exterior algebra formalism, we revisit and study the matter coupling in Exotic General Massive 3D Gravity (EGMG), previously introduced in \\cite{ozkan_1}. Considering that the matter Lagrangian is both metric co-frame and connection dependent in general, we explicitly construct associated source 2-form by algebraically solving auxiliary 1-form fields in terms of gravitational field variables, energy-momentum and hyper-momentum 2-forms. It is seen that that the source 2-form involves terms that are quadratic in energy-momentum and hyper-momentum 2-forms as well as terms that depend on covariant derivatives of them. In addition, we derive the consistency relation in order that matter-coupled EGMG field equation be third-way consistent. In general, the consistency requires a particular relation that should be satisfied by energy-momentum and hyper-momentum 2-forms. We note that our construction and formalism allows to investigate non-minimal matter couplings with gravitational fields. It also enables to construct the higher order curvature extensions of EGMG.",
      "pdf_url": "https://arxiv.org/pdf/2601.06908.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06946",
      "title": "Strong Einstein-Hilbert Gravity Inflation and ACT Phenomenology",
      "authors": [
        "V.K. Oikonomou",
        "Eleni I. Manouri",
        "Georgios Konstantellos"
      ],
      "abstract": "Strong Einstein-Hilbert Gravity Inflation and ACT Phenomenology V.K. Oikonomou, Eleni I. Manouri, Georgios Konstantellos General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) In this work we study rescaled effective single scalar field theories, and we confront these with the ACT constraint on the spectral index of the scalar primordial perturbations and the updated BICEP/Planck constraint on the tensor-to-scalar ratio. Rescaled scalar theories of gravity may be the result of an effective $f(R,\\phi)$ gravity at strong curvature regimes, which may result on a rescaling of the Einstein-Hilbert term of the form $\\sim \\alpha R$. It turns out that canonical scalar field theories with stronger gravity compared to standard Einstein-Hilbert gravity can be compatible with the ACT and updated Planck/BICEP constraints, with stronger gravity meaning that the rescaling parameter $\\alpha$ takes values smaller than unity.",
      "pdf_url": "https://arxiv.org/pdf/2601.06946.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06949",
      "title": "Viable f(R) Scenarios Unifying Inflation with Realistic Dynamical Dark Energy",
      "authors": [
        "S.D. Odintsov",
        "V.K. Oikonomou",
        "G.S. Sharov"
      ],
      "abstract": "Viable f(R) Scenarios Unifying Inflation with Realistic Dynamical Dark Energy S.D. Odintsov, V.K. Oikonomou, G.S. Sharov General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Two $F(R)$ gravity models are tested on the basis of their viability during all stages of cosmological evolution. It is shown that these models can describe both the early-time inflationary epoch and the dark energy epoch. The models are confronted with the latest observational data, including the Pantheon+ catalogue with Type Ia supernovae, the Dark Energy Spectroscopic Instrument measurements of baryon acoustic oscillations, the Hubble parameter estimations and data from cosmic microwave background radiation. Investigation of the viability conditions for these models, in particular, the condition $\\frac{dF}{dR}>0$ required a deep analysis. Both models appeared to be viable during the early-time era, but for the late-time evolution the viability conditions are not fulfilled in definite domains in the parameter spaces of these models. However the best fitted parameters, determined in confrontation with the mentioned observational data, lie far from the forbidden domains for both models. These $F(R)$ gravity models describe the observations with the large advantage over the $\\Lambda$-Cold-Dark-Matter model, not only in $\\chi^2$ statistics, but also with Akaike and Bayesian information criteria. This success of the two $F(R)$ gravity scenarios is connected with their capability to mimic dynamical dark energy, similarly to models with variable equation of state, that is necessary for describing the latest Pantheon+ and DESI observational data.",
      "pdf_url": "https://arxiv.org/pdf/2601.06949.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06956",
      "title": "IndIGO-D: Probing Compact Binary Coalescences in the Decihertz GW Band",
      "authors": [
        "Abhishek Sharma",
        "Divya Tahelyani",
        "Anand S. Sengupta",
        "Sanjit Mitra"
      ],
      "abstract": "IndIGO-D: Probing Compact Binary Coalescences in the Decihertz GW Band Abhishek Sharma, Divya Tahelyani, Anand S. Sengupta, Sanjit Mitra General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We study IndIGO-D, a decihertz gravitational-wave mission concept, focusing on a specific configuration in which three spacecraft fly in formation to form an L-shaped interferometer in a heliocentric orbit. The two orthogonal arms share a common vertex, providing a space-based analogue of terrestrial Michelson detectors, while operating in an optimised configuration that yields ppm-level arm-length stability. Assuming 1000 km arm length, we analyse the orbital motion and antenna response, and assess sensitivity across the [0.1 - 10] Hz band bridging LISA and next-generation ground-based interferometers. Using fiducial sensitivity curves provided by the IndIGO-D collaboration, we compute horizon distances for different source classes. Intermediate-mass black-hole binaries with masses $10^{2}$ - $10^{3} \\, M_\\odot$ are detectable to redshifts $z \\sim 10^{3}$, complementing the reach of LISA and terrestrial detectors. Binary neutron star systems are observable to a horizon distance of $z \\lesssim 0.3$, allowing continuous multi-band coverage with Voyager-class interferometers from the decihertz regime to merger. A Bayesian parameter-estimation study of a GW170817-like binary shows that the sky localization area improves from $\\sim 21 \\,\\mathrm{deg}^2$ at one month to $0.3 \\,\\mathrm{deg}^2$ at six hours pre-merger! These sky areas are readily tiled by wide-field time-domain telescopes such as the Rubin Observatory, whose $9.6 \\,\\mathrm{deg}^2$ field of view and r-band depth enable high-cadence, repeated coverage of GW170817-like kilonovae at this distance and beyond. IndIGO-D exploits the rapid evolution of binaries in the decihertz band to bridge the gap between millihertz and terrestrial observations, enabling early warnings on timescales from months to hours and enhancing the prospects for multi-band and multi-messenger discoveries.",
      "pdf_url": "https://arxiv.org/pdf/2601.06956.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.06957",
      "title": "The past stability of Kasner singularities for the $(3+1)$-dimensional Einstein vacuum spacetime under polarized $U(1)$-symmetry",
      "authors": [
        "Kai Dong"
      ],
      "abstract": "The past stability of Kasner singularities for the $(3+1)$-dimensional Einstein vacuum spacetime under polarized $U(1)$-symmetry Kai Dong General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph); Analysis of PDEs (math.AP); Differential Geometry (math.DG) In this paper, we give a new proof to a past stability result established in Fournodavlos-Rodnianski-Speck (arXiv:2012.05888), for Kasner solutions of the $(3+1)$-dimensional Einstein vacuum equations under polarized $U(1)$-symmetry. Our method, inspired by Beyer-Oliynyk-Olvera-Santamar{\\'ı}a-Zheng (arXiv:1907.04071, arXiv:2502.09210), relies on a newly developed $(2+1)$ orthonormal-frame decomposition and a careful symmetrization argument, after which the Fuchsian techniques can be applied. We show that the perturbed solutions are asymptotically pointwise Kasner, geodesically incomplete and crushing at the Big Bang singularity. They are achieved by reducing the $(3+1)$ Einstein vacuum equations to a Fuchsian system coupled with several constraint equations, with the symmetry assumption playing an important role in the reduction. Using Fuchsian theory together with finite speed of constraints propagation, we obtain global existence and precise asymptotics of the solutions up to the singularities.",
      "pdf_url": "https://arxiv.org/pdf/2601.06957.pdf",
      "categories": [
        "gr-qc",
        "math-ph",
        "math.AP",
        "math.DG"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.06962",
      "title": "Spacetime Quasi-normal Mode Oscillations of Anisotropic Neutron Stars",
      "authors": [
        "Jihao Yu",
        "Victor Guedes",
        "Shu Yan Lau",
        "Siddarth Ajith",
        "Kent Yagi"
      ],
      "abstract": "Spacetime Quasi-normal Mode Oscillations of Anisotropic Neutron Stars Jihao Yu, Victor Guedes, Shu Yan Lau, Siddarth Ajith, Kent Yagi General Relativity and Quantum Cosmology (gr-qc) Neutron star asteroseismology offers a unique opportunity to probe nuclear physics through stellar oscillations. Although the pressure inside of a neutron star is typically assumed to be isotropic, pressure anisotropy can arise from various physical mechanisms, including elasticity, viscosity, and magnetic fields. Previous studies of nonradial stellar quasi-normal mode oscillations with anisotropic pressure have focused primarily on fluid modes. In this paper, we compute, for the first time, spacetime oscillation modes (so-called w-modes) of anisotropic neutron stars. Using a perturbative framework for stellar oscillations with pressure anisotropy, developed previously by some of the authors, together with a phenomenological anisotropy model, we find that both the real and imaginary parts of the w-mode frequencies decrease as the tangential pressure becomes dominant over the radial pressure. Although we do not find any unstable w-modes within the physically viable parameter space, unstable w-modes appear in an unphysical branch of solutions when the tangential pressure strongly dominates the radial one. We also find that the relation between the real part of the w-mode frequency and the stellar compactness is quasi-universal with respect to variations in the equation of state and the degree of pressure anisotropy. In contrast, the relation between the imaginary part of the w-mode frequency and the stellar compactness depends on the degree of anisotropy, but remains equation-of-state universal when the anisotropy is fixed. Finally, we discuss potential mode crossings and the validity of certain approximations that have been shown to work well for w-mode calculations in the isotropic case.",
      "pdf_url": "https://arxiv.org/pdf/2601.06962.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07007",
      "title": "Oscillatory Freeze from Inertial Holographic Dark Energy",
      "authors": [
        "Swapnil Kumar Singh"
      ],
      "abstract": "Oscillatory Freeze from Inertial Holographic Dark Energy Swapnil Kumar Singh 16 pages, 8 figures, Comments are welcome General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We study a generalized holographic dark energy model in which the infrared cutoff depends on the Hubble parameter and its first two time derivatives. The inclusion of the $\\ddot H$ term introduces a finite relaxation timescale for the horizon degrees of freedom, which can be interpreted as an effective entropic inertia of the holographic vacuum energy. The resulting background dynamics admit late--time solutions in which the cosmic expansion gradually halts. In the underdamped regime, the Hubble parameter undergoes exponentially damped oscillations and asymptotically approaches $H\\to0$. The scale factor grows monotonically but by a finite amount, while curvature invariants decay exponentially, leading to an asymptotically Minkowski spacetime without future singularities. We confront the full nonlinear background evolution with cosmic chronometer measurements of the Hubble parameter and find good agreement with current late--time expansion data, with a reduced chi--squared $\\chi^2/\\nu\\simeq0.52$. At observable redshifts, oscillatory features are strongly suppressed and remain consistent with existing constraints.",
      "pdf_url": "https://arxiv.org/pdf/2601.07007.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07091",
      "title": "Balance flux laws beyond general relativity",
      "authors": [
        "David Maibach",
        "Jann Zosso"
      ],
      "abstract": "Balance flux laws beyond general relativity David Maibach, Jann Zosso General Relativity and Quantum Cosmology (gr-qc) Balance flux laws of asymptotic symmetries in general relativity provide fully non-perturbative constraint equations on gravitational strain. They have proven useful for constructing numerical gravitational waveforms and for characterizing gravitational memory. As the precision of current and future detectors continues to improve, such constraints become increasingly important for high-precision tests of gravity, including searches for deviations from general relativity. This motivates a systematic understanding of analogous balance laws in theories beyond general relativity. In this work, we investigate the existence and structure of flux laws at null infinity in diffeomorphism-invariant extensions of general relativity. Our analysis is based on the covariant phase space formalism and the definition of conserved quantities, as presented by Wald and Zoupas. For a particularly relevant class of Horndeski theories, we derive a general expression for the flux and formulate the corresponding balance equation via the associated non-conserved charges. We cross-check our general results by comparing them with previous studies of Brans-Dicke gravity. Furthermore, we demonstrate that the employed methods extend straightforwardly to a broader class of diffeomorphism-invariant theories. The null part of the resulting flux laws associated with null memory is compared with and validated against the alternative derivation based on the Isaacson approach to gravitational radiation. Beyond the specific results obtained, this work is intended to serve as a practical guide for computing balance laws in generic diffeomorphism-invariant theories of gravity and paves the way for an in-depth comparison between the Isaacson approach and the covariant phase space formalism.",
      "pdf_url": "https://arxiv.org/pdf/2601.07091.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.07102",
      "title": "Lorentz-violating modifications to particle dynamics, thermodynamics and vacuum energy in bumblebee gravity",
      "authors": [
        "A. A. Araújo Filho",
        "K. E. L. de Farias",
        "E. Passos",
        "F. A. Brito",
        "Ali Övgün",
        "Hassan Hassanabadi",
        "V. B. Bezerra",
        "Amilcar R. Queiroz"
      ],
      "abstract": "Lorentz-violating modifications to particle dynamics, thermodynamics and vacuum energy in bumblebee gravity A. A. Araújo Filho, K. E. L. de Farias, E. Passos, F. A. Brito, Ali Övgün, Hassan Hassanabadi, V. B. Bezerra, Amilcar R. Queiroz General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate how spontaneous Lorentz symmetry breaking in bumblebee gravity modifies particle dynamics, thermodynamics, and vacuum energy around a static black hole background. Starting from the optical-mechanical correspondence, we derive a modified dispersion relation that encodes the influence of the Lorentz-violating parameter $\\lambda$ on the propagation of massive and massless modes. We analyze the resulting optical properties, including the effective refractive index, group velocity, and energy-dependent time delay, and show how the non-asymptotically flat geometry reshapes signal propagation. From the same dispersion relation, we construct the interparticle potential for massive and massless excitations and evaluate the electron scattering cross section within the Born approximation, identifying characteristic Lorentz-violating corrections. We then develop a statistical-ensemble description based on the deformed energy-momentum relation and obtain analytic expressions for the thermodynamic observables of a massless bosonic gas. The pressure, mean energy, entropy, and heat capacity are examined in three representative regimes--extremely close to the horizon, near the photon sphere, and in the asymptotic region -- where Lorentz violation systematically increase the magnitude of these quantities and leads to finite asymptotic plateaus. Finally, we analyze the vacuum state in the curved background and compute the regularized Casimir energy at zero and finite temperature.",
      "pdf_url": "https://arxiv.org/pdf/2601.07102.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07179",
      "title": "Chiroptical effect induced by gravitational waves",
      "authors": [
        "Haorong Wu",
        "Xilong Fan"
      ],
      "abstract": "Chiroptical effect induced by gravitational waves Haorong Wu, Xilong Fan General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Optics (physics.optics); Quantum Physics (quant-ph) We propose the gravitational analog of the chiroptical effect for the first time, demonstrating that gravitational waves (GWs) can induce a reversal of photon chirality through the exchange of angular momentum, namely the spin-2-gravitation chiroptical effect. By analyzing the interaction between photon spin angular momentum (SAM) and GWs, we derive the selection rules governing this exchange, which are strictly dictated by the spin-1 and spin-2 nature of the electromagnetic and gravitational fields, respectively. We find that the gravitational chiroptical effect reflects the local nature of SAM which prevents the accumulation of gravitational perturbations over spatial phase windings, and offers a theoretically rigorous tool to probe the chiral structure of GWs. This mechanism provides a novel observational pathway to constrain modified gravity theories, measure the asymmetric properties of compact binaries, and explore parity-violating physics in the early universe.",
      "pdf_url": "https://arxiv.org/pdf/2601.07179.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "quant-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.07196",
      "title": "Self-consistent neutron stars in a class of massive vector-tensor gravity",
      "authors": [
        "Zhe Luo",
        "Shoulong Li",
        "Hongwei Yu"
      ],
      "abstract": "Self-consistent neutron stars in a class of massive vector-tensor gravity Zhe Luo, Shoulong Li, Hongwei Yu 20 pages, 3 figures, single column revtex General Relativity and Quantum Cosmology (gr-qc) Einstein-bumblebee gravity, as a class of massive non-minimally coupled vector-tensor theories, provides a useful framework for constraining Lorentz symmetry breaking through astrophysical observations, largely due to the existence of exact static and spherically symmetric black hole solutions. These solutions are typically obtained under the assumption that the vector-field potential vanishes everywhere once the vector field acquires a nonzero radial vacuum expectation value. However, imposing this assumption globally obstructs the construction of self-consistent compact-star solutions. In this work, we elucidate the origin of this inconsistency through a detailed analysis of the field equations and construct neutron-star configurations by abandoning the global vanishing-potential assumption. Crucially, we show that even without enforcing this condition everywhere, it is violated only in the strong-field interior region and is dynamically restored in the weak-field regime by asymptotic boundary conditions at spatial infinity. As a result, consistency with existing black-hole solutions and observational constraints is preserved. Our results establish massive vector-tensor gravity as a unified, natural, and self-consistent framework for compact objects, significantly extending its astrophysical viability beyond black holes and Solar System tests.",
      "pdf_url": "https://arxiv.org/pdf/2601.07196.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07289",
      "title": "A universal lower bound on the photon sphere radius in higher-dimensional black holes",
      "authors": [
        "Yong Song",
        "Jiaqi Fu",
        "Yiting Cen"
      ],
      "abstract": "A universal lower bound on the photon sphere radius in higher-dimensional black holes Yong Song, Jiaqi Fu, Yiting Cen General Relativity and Quantum Cosmology (gr-qc) The photon sphere, a hypersurface of circular null geodesics, plays a fundamental role in characterizing black hole spacetimes, influencing phenomena such as black hole shadows, gravitational lensing, and quasinormal modes. While universal upper bounds on the photon sphere radius have been established for both four-dimensional and higher-dimensional black holes, the question of a corresponding lower bound in higher-dimensional black holes remains less explored. In this work, we derive a universal lower bound for the photon sphere radius in static, spherically symmetric, asymptotically flat black hole spacetimes of arbitrary dimension $n\\ge 4$. Under the assumptions of the weak energy condition, a non-positive trace of the energy-momentum tensor, and a monotonicity condition on the radial pressure function $|r^{n-1}p_r(r)|$, we prove that the photon sphere radius $r_\\gamma$ satisfies $r_\\gamma\\ge (\\frac{n-1}{2})^{1/(n-3)}r_H$, where $r_H$ is the radius of the outer event horizon. For $n=4$, this reduces to the known result $r_\\gamma\\ge \\frac{3}{2}r_H$. Our result generalizes Hod's four-dimensional theorem to higher dimensions, and provides a new geometric constraint on the structure of black holes in extended theories of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2601.07289.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07382",
      "title": "Superspace worldline formalism approach to Quantum Gravity: dimensional reduction and Holography",
      "authors": [
        "Jean-Baptiste Roux"
      ],
      "abstract": "Superspace worldline formalism approach to Quantum Gravity: dimensional reduction and Holography Jean-Baptiste Roux 19 pages plus one appendix, submitted to Classical and Quantum Gravity J-B Roux 2024 Class. Quantum Grav. 41 147001 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Using the ADM formalism, we demonstrate that the Hamiltonian formulation of Quantum Gravity is exactly in the form of a worldline (WL) formalism in the superspace. We then show that the Keldysh partition function reduces to the partition function of Euclidean 3D gravity. After discussing the meaning of the time parameter, we show that in the gauge fields formalism, our Keldysh partition function reduces to a generating functional of a 2D Conformal Field Theory (CFT). This functional exhibits a minimal time-lapse proportional to the square root of the cosmological constant. From the viewpoint of the Chern-Simons/Liouville correspondence, we calculate the exchange of virtual gravitons between two massive probes from the cosmological boundary.",
      "pdf_url": "https://arxiv.org/pdf/2601.07382.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07488",
      "title": "Gravitational Collapse and Singularity Formation in Brans-Dicke Gravity",
      "authors": [
        "Ayush Bidlan",
        "Dipanjan Dey",
        "Parth Bambhaniya"
      ],
      "abstract": "Gravitational Collapse and Singularity Formation in Brans-Dicke Gravity Ayush Bidlan, Dipanjan Dey, Parth Bambhaniya Contains 6 figures and spans 15 pages. To appear in PRD General Relativity and Quantum Cosmology (gr-qc) We investigate gravitational collapse driven solely by a self-interacting Brans--Dicke (BD) scalar field in the absence of ordinary matter. In this framework, the spacetime dynamics are governed solely by the scalar field $\\Phi$, endowed with a self-interaction potential $V(\\Phi)$ and non-minimally coupled to the Ricci scalar through the Brans--Dicke action. We numerically solve for the evolution of $\\Phi(t)$ and the corresponding potential $V(\\Phi)$ in order to track the collapse dynamics leading to singularity formation. Our analysis demonstrates that, for the energy densities $\\rho \\approx 1/a$ and $\\rho \\approx -\\ln a$, the collapse inevitably leads to the formation of a central curvature singularity while consistently satisfying the weak energy condition. We further examine the causal structure of the resulting singularity and find that future-directed null geodesics originating from the singularity can propagate to future null infinity, making the singularity globally visible. The strength of the singularity is also examined by extending Tipler's strong curvature condition to the Brans--Dicke field equations. Overall, our findings indicate that gravitational collapse in scalar--tensor gravity can give rise to scenarios that challenge the Cosmic Censorship Conjecture, while underscoring the potential observational relevance of singularities formed through BD scalar-field-driven collapse.",
      "pdf_url": "https://arxiv.org/pdf/2601.07488.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07500",
      "title": "Merger Dynamics of N+N Co-planar Particles in Newton Gravitation",
      "authors": [
        "Qi Su",
        "Baicheng Zhang",
        "Ding-Fang Zeng"
      ],
      "abstract": "Merger Dynamics of N+N Co-planar Particles in Newton Gravitation Qi Su, Baicheng Zhang, Ding-Fang Zeng General Relativity and Quantum Cosmology (gr-qc) We model the inspiral and merger dynamics of two co-planar rings in Newtonian mechanics with GR motivated corrections and illustrate their similarity with those of black hole binary systems on the orbital plane. Our simulation reveals a banana-shape deformation of the ``black holes'' involved, and a typhoon-like spiral structure in the merger product. Using an eXact One-Body approach, we compute the full gravitational waveform of this process and qualitatively reproduce results consistent with those of numerical relativity. Our simulation offers a transparent link between the feature of gravitational waveforms and the internal structure of black holes, thus a complementary interpretation of physics behind numerical relativity.",
      "pdf_url": "https://arxiv.org/pdf/2601.07500.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.07734",
      "title": "Rotation-dependent $I$-Love-$Q$-$δM$ relations in perturbation theory",
      "authors": [
        "Eneko Aranguren"
      ],
      "abstract": "Rotation-dependent $I$-Love-$Q$-$δM$ relations in perturbation theory Eneko Aranguren General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The so-called $I$-Love-$Q$ relations link some normalized versions of the moment of inertia, the Love number, and the quadrupole moment of a star. These relations, in principle, enable the inference of two of the quantities given the third. However, their use has been limited because the normalized versions of the multipole moments rely on the static mass derived from the Tolman-Oppenheimer-Volkoff equation, which is not directly observable. In this work, using perturbation theory, we find that the $I$-Love-$Q$ relations can also be formulated in terms of an alternative set of normalized quantities that do not depend on the static mass, but on the actual (observable) mass.",
      "pdf_url": "https://arxiv.org/pdf/2601.07734.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07736",
      "title": "Epicyclic motion of charged particles around a weakly magnetized Kiselev black hole",
      "authors": [
        "Marina-Aura Dariescu",
        "Vitalie Lungu"
      ],
      "abstract": "Epicyclic motion of charged particles around a weakly magnetized Kiselev black hole Marina-Aura Dariescu, Vitalie Lungu General Relativity and Quantum Cosmology (gr-qc) We investigate the motion of charged particles evolving around a magnetized Kiselev black hole, in the weak magnetic field approximation. The effective potential allows us to study the bound motion and the stable circular orbits. We analyze the impact of combined quintessence and magnetic fields on the epicyclic frequencies. Finally, we examine the periapsis shift and gravitational Larmor precession pointing out differences from the Ernst or Kiselev spacetimes.",
      "pdf_url": "https://arxiv.org/pdf/2601.07736.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.07739",
      "title": "Systematic Biases in Gravitational-Wave Parameter Estimation from Neglecting Orbital Eccentricity in Space-Based Detectors",
      "authors": [
        "Jin-Zhao Yang",
        "Jia-Hao Zhong",
        "Tao Yang"
      ],
      "abstract": "Systematic Biases in Gravitational-Wave Parameter Estimation from Neglecting Orbital Eccentricity in Space-Based Detectors Jin-Zhao Yang, Jia-Hao Zhong, Tao Yang General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM) Accurate modeling of gravitational-wave signals is essential for reliable inference of compact-binary source parameters, particularly for future space-based detectors operating in the milli- and deci-Hertz bands. In this work, we systematically investigate the parameter-estimation biases induced by neglecting orbital eccentricity when analyzing eccentric compact-binary coalescences with quasi-circular waveform templates. Focusing on the deci-Hertz detector B-DECIGO and the milli-Hertz detector LISA, we model eccentric inspiral signals using a frequency-domain waveform that incorporates eccentricity-induced higher harmonics and the time-dependent response of spaceborne detectors. We quantify systematic biases in the chirp mass, symmetric mass ratio, and luminosity distance using both Bayesian inference and the Fisher-Cutler-Vallisneri (FCV) formalism, and assess their significance relative to statistical uncertainties. By constructing mock gravitational-wave catalogs spanning stellar-mass and massive black-hole binaries, we identify critical initial eccentricities at which systematic errors become comparable to statistical errors. We find that for B-DECIGO, even very small eccentricities, $e_0\\sim 10^{-4}-10^{-3}$ at 0.1 Hz, can lead to significant biases, whereas for LISA such effects typically arise at larger eccentricities, $e_0\\sim 10^{-2}-10^{-1}$ at $10^{-4}$ Hz, due to the smaller number of in-band cycles. Comparisons between FCV predictions and full Bayesian analyses demonstrate good agreement within the regime where waveform mismatches remain small, especially when extrinsic parameters are pre-aligned to minimize mismatches. Our results highlight the necessity of incorporating eccentricity in waveform models for future space-based gravitational-wave observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.07739.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2404.07888",
      "title": "Slowly rotating charges from Weyl double copy for Kerr black hole with Chern-Simons correction",
      "authors": [
        "Yi-Ran Liu",
        "Jing-Rui Zhang",
        "Yun-Long Zhang"
      ],
      "abstract": "Slowly rotating charges from Weyl double copy for Kerr black hole with Chern-Simons correction Yi-Ran Liu, Jing-Rui Zhang, Yun-Long Zhang 9 pages. v2: matching version published in Commun. Theor. Phys Commun. Theor. Phys. 76, 085405 (2024) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The Weyl double copy builds the relation between gauge theory and gravity theory, especially the correspondence between gauge solutions and gravity solutions. In this paper, we obtain the slowly rotating charge solutions from Weyl double copy for the Kerr black hole with small Chern-Simons correction. Based on the Weyl double copy relation, for the Petrov type D solution, we find the additional correction to the electromagnetic field strength tensor of rotating charge. For the Petrov type I solution, we find that the additional electromagnetic field strength tensors have the exogenous properties, while the total sources vanish at the leading order.",
      "pdf_url": "https://arxiv.org/pdf/2404.07888.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.10454",
      "title": "Dynamical systems approach to Cold and Warm Inflation within slow-roll and beyond",
      "authors": [
        "Sandip Biswas",
        "Saddam Hussain",
        "Kaushik Bhattacharya"
      ],
      "abstract": "Dynamical systems approach to Cold and Warm Inflation within slow-roll and beyond Sandip Biswas, Saddam Hussain, Kaushik Bhattacharya The present version of the manuscript has been accepted for publication in General Relativity and Gravitation. 35 pages, 15 figures, 3 Tables General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) In this work, we systematically present a new dynamical systems approach to standard inflationary processes and their variants as constant-roll inflation. Using the techniques presented in our work one can in general investigate the attractor nature of the inflationary models in the phase space. We have compactified the phase space coordinates, wherever necessary, and regulated the nonlinear differential equations, constituting the autonomous system of equations defining the dynamical system, at the cost of a new redefined time variable which is a monotonic increasing function of the standard time coordinate. We have shown that in most of the relevant cases the program is executable although the two time coordinates may show different durations of cosmological events. If one wishes one can revert back to the cosmological time via an inverse transformation. The present work establishes a standard norm for studying dynamical as well as stability issues in any new inflationary system.",
      "pdf_url": "https://arxiv.org/pdf/2504.10454.pdf",
      "categories": [
        "gr-qc",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.12243",
      "title": "Sound waves from primordial black hole formations",
      "authors": [
        "Zhuan Ning",
        "Xiang-Xi Zeng",
        "Zi-Yan Yuwen",
        "Shao-Jiang Wang",
        "Heling Deng",
        "Rong-Gen Cai"
      ],
      "abstract": "Sound waves from primordial black hole formations Zhuan Ning, Xiang-Xi Zeng, Zi-Yan Yuwen, Shao-Jiang Wang, Heling Deng, Rong-Gen Cai v1, two columns, 17 pages, 12 figures, extended long-paper version to the companion Letter arXiv:2504.11275; v2, two columns, 20 pages, 15 figures, 1 table, extended simulations to incorporate more general configurations, conclusions unchanged, version accepted for publication in Physical Review D; v3, to match the published version General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We present a numerical investigation of primordial black hole (PBH) formation from super-horizon curvature perturbations and the subsequent generation and propagation of sound waves, which can serve as a new source of stochastic gravitational wave backgrounds (SGWBs) presented in a companion letter. Using the Misner-Sharp formalism with an excision technique, our simulations extend to significantly later times than previous work and indicate that the near-critical perturbations produce a distinct compression wave featuring both overdense and underdense shells, while significantly supercritical perturbations yield only an underdense shell. We also show that a softer equation of state suppresses the formation of compression waves. Furthermore, the comoving thickness of sound shells remains nearly constant during propagation and scales with the Hubble radius at horizon re-entry, thereby serving as a key link between the gravitational-wave peak frequency and PBH mass in the companion letter. These results offer new insights into the dynamics of PBH formation and suggest potential observational signatures of PBHs in the gravitational wave (GW) spectrum from associated sound waves.",
      "pdf_url": "https://arxiv.org/pdf/2504.12243.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2504.17587",
      "title": "Enhancing gravitational-wave detection: a machine learning pipeline combination approach with robust uncertainty quantification",
      "authors": [
        "Gregory Ashton",
        "Ann-Kristin Malz",
        "Nicolo Colombo"
      ],
      "abstract": "Enhancing gravitational-wave detection: a machine learning pipeline combination approach with robust uncertainty quantification Gregory Ashton, Ann-Kristin Malz, Nicolo Colombo 9 pages, 5 figures, 2 tables, published in PRL Phys. Rev. Lett. 136, 011402 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) Gravitational-wave data from advanced-era interferometric detectors consists of background Gaussian noise, frequent transient artefacts, and rare astrophysical signals. Multiple search algorithms exist to detect the signals from compact binary coalescences, but their varying performance complicates interpretation. We present a machine learning-driven approach that combines results from individual pipelines and utilises conformal prediction to provide robust, calibrated uncertainty quantification. Using simulations, we demonstrate improved detection efficiency and apply our model to GWTC-3, enhancing confidence in multi-pipeline detections, such as the sub-threshold binary neutron star candidate GW200311_103121.",
      "pdf_url": "https://arxiv.org/pdf/2504.17587.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.09981",
      "title": "Charged wormholes in (anti-)de Sitter spacetime",
      "authors": [
        "Hyeong-Chan Kim",
        "Wonwoo Lee"
      ],
      "abstract": "Charged wormholes in (anti-)de Sitter spacetime Hyeong-Chan Kim, Wonwoo Lee 6 pages, 2 figures, Reference papers are added Physics Letters B, 873, 140145 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We present a family of charged, traversable wormhole solutions in the presence of a cosmological constant. In de Sitter spacetime, two types of wormhole throats can exist--referred to as typical and cosmological throat--located at small and large radial values, respectively. In anti-de Sitter spacetime, the throat geometry allows for positive, zero, or negative curvature, enabling the possibility of an infinite throat area. We analyze the flare-out condition, a key requirement for the existence of traversable wormholes, which imposes constraints on the equation of state parameters governing the supporting matter. These solutions are shown to be of Petrov type D. Furthermore, we examine radial geodesics of null and timelike particles. In the de Sitter case, particles traverse the wormhole, passing from one throat to the other. In contrast, in the anti-de Sitter case, particles exhibit recurrent oscillatory motion between two asymptotic regions, cyclically disappearing and reappearing across the throats.",
      "pdf_url": "https://arxiv.org/pdf/2505.09981.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.08111",
      "title": "DSR-relativistic spacetime picture and the phenomenology of Planck-scale-modified time dilation",
      "authors": [
        "Giovanni Amelino-Camelia",
        "Giulia Gubitosi",
        "Pietro Pellecchia",
        "Marco Refuto",
        "Giacomo Rosati"
      ],
      "abstract": "DSR-relativistic spacetime picture and the phenomenology of Planck-scale-modified time dilation Giovanni Amelino-Camelia, Giulia Gubitosi, Pietro Pellecchia, Marco Refuto, Giacomo Rosati V2 coincides with the one published in Physical Review D, vol. 112 106006. It includes a discussion on the generalization to other DSR models and two plots comparing the time dilation behaviour for the DSR, LIV, SR, and Finsler scenarios General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The most active area of research in quantum-gravity phenomenology investigates the possibility of Planck-scale-modified dispersion relations, focusing mainly on two alternative scenarios: the \"LIV\" scenario, characterized by a specific mechanism of breakdown of relativistic symmetries, and the \"DSR\" scenario, which preserves overall relativistic invariance but with deformed laws of relativistic transformation. Two recent studies of modified dispersion relations, one relying on Finsler geometry and one based on heuristic reasoning, raised the possibility of potentially observable effects for time dilation and argued that this might apply also to the LIV and DSR scenarios. We observe that the description of Lorentz transformations in the LIV scenario is such that time dilation cannot be modified. The DSR scenario allows for modifications of time dilation, and establishing their magnitude required us to obtain novel results on the effects of finite DSR boosts in the spacetime sector, with results showing in particular that the modification of time dilation is too small for experimental testing.",
      "pdf_url": "https://arxiv.org/pdf/2506.08111.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.00315",
      "title": "Stability of Thin Shell and Wormhole Configurations: Schwarzschild, Schwarzschild -- (Anti-) de Sitter, and FLRW Spacetimes",
      "authors": [
        "Travis Seth Rippentrop",
        "Avijit Bera",
        "Mustapha Ishak"
      ],
      "abstract": "Stability of Thin Shell and Wormhole Configurations: Schwarzschild, Schwarzschild -- (Anti-) de Sitter, and FLRW Spacetimes Travis Seth Rippentrop, Avijit Bera, Mustapha Ishak General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The stability of thin shell wormholes and black holes to linearized spherically symmetric perturbations about a static equilibrium is analyzed. Thin shell formalism is explored and junctions formed from combinations of Schwarzschild, Schwarzschild - de Sitter, and Schwarzschild - anti-de Sitter, as well as Friedmann-Lemaitre-Robertson-Walker (FLRW) spacetimes are considered. The regions of stability for these different combinations are thoroughly described and plotted as a function of mass ratios of the Schwarzschild masses and radii of the wormhole throats. A taxonomy of the qualitative features of the various configurations and parameter spaces is developed, illustrating the stability regions when present. The considered wormholes are all found to be unstable in the causal region.",
      "pdf_url": "https://arxiv.org/pdf/2507.00315.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.11663",
      "title": "Asymptotic quasinormal modes, echoes, and black hole spectral instability: a brief review",
      "authors": [
        "Shui-Fa Shen",
        "Guan-Ru Li",
        "Ramin G. Daghigh",
        "Jodin C. Morey",
        "Michael D. Green",
        "Wei-Liang Qian",
        "Rui-Hong Yue"
      ],
      "abstract": "Asymptotic quasinormal modes, echoes, and black hole spectral instability: a brief review Shui-Fa Shen, Guan-Ru Li, Ramin G. Daghigh, Jodin C. Morey, Michael D. Green, Wei-Liang Qian, Rui-Hong Yue 38 pages, 8 figures. arXiv admin note: text overlap with arXiv:2504.13265 General Relativity and Quantum Cosmology (gr-qc) We present a short review of the analytical aspects of recent progress in the study of black hole spectral instability and its potential observational consequences. This topic, inspired by earlier foundational works, has attracted considerable attention in the recent literature. It has been demonstrated that both the low-lying modes and high overtones of black hole quasinormal spectra can be substantially influenced by small deformations in the effective potential of the wave equation that describes black hole perturbations. The temporal evolution of gravitational wave signals is primarily governed by the first few low-lying quasinormal modes. In contrast, the asymptotic behavior of high overtones is closely associated with the phenomenon of black hole echoes. We review relevant studies on spectral instability in both regimes, highlighting their potential to produce substantial observational signatures in gravitational wave data. Additionally, recent proposals of Regge poles and reflectionless modes as alternative stable observables for probing black hole spacetimes are summarized.",
      "pdf_url": "https://arxiv.org/pdf/2507.11663.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.19582",
      "title": "There and back again: Outspiraling motion in non-Kerr compact objects",
      "authors": [
        "Manuel O. Mariano",
        "Carlos A. R. Herdeiro"
      ],
      "abstract": "There and back again: Outspiraling motion in non-Kerr compact objects Manuel O. Mariano, Carlos A. R. Herdeiro 17 pages, 8 figures. v2: matches final published version in PRD General Relativity and Quantum Cosmology (gr-qc) In Keplerian dynamics, a test body orbiting a point particle in circular motion has a monotonically increasing frequency, with decreasing radius. If a dissipative channel is introduced, such as gravitational wave (GW) emission, under the quadrupole approximation, the corresponding GW strain has an ever-increasing frequency with time. A similar statement holds for equatorial motion of a test particle on the Kerr manifold, except such inspiral is cut off at the ISCO, wherein stable circular orbits cease to exist and a plunge is expected. We analyze circular timelike orbits in generic spinning spacetimes and study the conditions in which exotic motion can occur, due to the presence of non-Kerr features. In particular, we derive conditions under which an inspiral towards a compact object is naturally followed by an outspiral motion, and give concrete examples as well as the corresponding GW phenomenology. This analysis serves both as a theoretical exploration of non-Kerrness as well as an example of a concrete smoking gun of exotic spacetimes.",
      "pdf_url": "https://arxiv.org/pdf/2507.19582.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.16679",
      "title": "Stable black holes in lower dimensional $f(\\mathbb{Q})$ non-metric gravity",
      "authors": [
        "G.G.L. Nashed",
        "Salvatore Capozziello"
      ],
      "abstract": "Stable black holes in lower dimensional $f(\\mathbb{Q})$ non-metric gravity G.G.L. Nashed, Salvatore Capozziello 15 pages, 3 figures, will appear in NPB General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate exact charged and uncharged black hole solutions in a (2+1)-dimensional spacetime within the framework of quadratic form of $f(\\mathbb{Q})$ symmetric teleparallel gravity, where $\\mathbb{Q}$ is the non-metricity scalar. By adopting spherical symmetry and considering both vanishing and non-vanishing electromagnetic fields, we derive new classes of black hole solutions and analyze their geometric and physical properties. The study demonstrates that the inclusion of quadratic corrections in the gravitational Lagrangian significantly modifies the structure of solutions, producing deviations from the standard BTZ geometry. Invariants such as curvature and non-metricity scalars are calculated to classify the singularity structure and spacetime behavior. Thermodynamic quantities, including Hawking temperature, entropy, and heat capacity, are computed, showing consistency with the first law of black hole thermodynamics. Furthermore, we examine the geodesic motion of test particles and derive the effective potential to explore the stability of photon orbits. A notable outcome is the identification of weaker black hole singularities in comparison to General Relativity, attributed to the non-metricity corrections. The possibility of multi-horizon configurations is also explored. This study provides a comprehensive analysis of the gravitational, thermodynamic, and dynamical features of lower-dimensional black holes in $f(\\mathbb{Q})$ gravity and highlights their distinct characteristics with respect to General Relativity.",
      "pdf_url": "https://arxiv.org/pdf/2508.16679.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.00748",
      "title": "Thermodynamics of Kerr black hole: Tsallis-Cirto composition law and entropy quantization",
      "authors": [
        "G.E. Volovik"
      ],
      "abstract": "Thermodynamics of Kerr black hole: Tsallis-Cirto composition law and entropy quantization G.E. Volovik General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) The processes of splitting and merging of black holes obey the composition law generated by the Tsallis-Cirto $\\delta=2$ statistics. The same composition law expresses the full entropy of the Reissner-Nordström black hole via the entropies of its outer and inner horizons. He we apply this composition law to the entropy of the Kerr black hole. As distinct from Reissner-Nordström black hole, where the full entropy depends only on mass $M$ and does not depend on its charge $Q$, the entropy of Kerr black hole is the sum of contributions from its mass $M$ and angular momentum $J$, i.e. $S(M,J)=S(M,0) + 4\\pi \\sqrt{J(J+1)}$. Here $S(M,0)$ is the entropy of the Schwarzschild black hole. This demonstrates that when the Kerr black hole with $J\\gg 1$ absorbs or emits a massless particle with spin $s_z=\\pm 1/2$, its entropy changes by $|\\Delta S| = 2\\pi$. We also considered the quantization of entropy suggested by the toy model, in which the black hole thermodynamics is represented by the ensemble of the Planck-scale black holes -- Planckons.",
      "pdf_url": "https://arxiv.org/pdf/2509.00748.pdf",
      "categories": [
        "gr-qc",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.05087",
      "title": "Overcharging Extremal Rotating Black Holes",
      "authors": [
        "Shauvik Biswas",
        "Sudipta Sarkar",
        "Amruta Sadhu"
      ],
      "abstract": "Overcharging Extremal Rotating Black Holes Shauvik Biswas, Sudipta Sarkar, Amruta Sadhu Phys. Rev. D 113, 024021 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we use the weak cosmic censorship conjecture(WCC) to constrain black hole solutions in modified gravity theories. While Wald showed that extremal Kerr-Newman black holes in general relativity cannot be overcharged by test charged particles, this protection may fail in theories beyond general relativity. We have considered generic rotating black hole solutions beyond the Kerr-Newman family and examined particle absorption processes that could lead to overcharging and the emergence of naked singularities. Identifying regions of parameter space where WCC is violated allows us to place direct, physically motivated bounds on deviations from general relativity.",
      "pdf_url": "https://arxiv.org/pdf/2509.05087.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.02163",
      "title": "Uncertainty in predicting the stochastic gravitational wave background from compact binary coalescences",
      "authors": [
        "Michael Ebersold",
        "Tania Regimbau"
      ],
      "abstract": "Uncertainty in predicting the stochastic gravitational wave background from compact binary coalescences Michael Ebersold, Tania Regimbau General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE) The stochastic gravitational-wave background from compact binary coalescences is expected to be the first detectable stochastic signal via cross-correlation searches with terrestrial detectors. It encodes the cumulative merger history of stellar-mass binaries across cosmic time, offering a unique probe of the high-redshift Universe. However, predicting the background spectrum is challenging due to numerous modeling choices, each with distinct uncertainties. In this work, we present a comprehensive forecast of the astrophysical gravitational-wave background from binary black holes, binary neutron stars, and neutron star-black hole systems. We systematically assess the impact of uncertainties in population properties, waveform features, and the modeling of the merger rate evolution. By combining all uncertainties, we derive credible bands for the background spectrum, spanning approximately an order of magnitude in the fractional energy density. These results provide thorough predictions to facilitate the interpretation of current upper limits and future detections.",
      "pdf_url": "https://arxiv.org/pdf/2510.02163.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.11518",
      "title": "Gravitational wave echos from physical black holes",
      "authors": [
        "Yu-Song Cao",
        "YanXia Liu",
        "Ding-Fang Zeng"
      ],
      "abstract": "Gravitational wave echos from physical black holes Yu-Song Cao, YanXia Liu, Ding-Fang Zeng 17 pages, 4 figures. Comments are welcome! General Relativity and Quantum Cosmology (gr-qc) Gravitational wave echos from the coalescence of black hole binaries are often viewed as signals beyond general relativity or standard model. In this work, we show that these echos are inevitable in the black holes coalescence described by standard general relativity. This is because it is the physical black holes formed through gravitational collapse serve as the true description of astronomical black holes. For physical black holes, only their asymptotic structure before the horizon forms are detectible to the outside probes. Here, by investigating the scattering of a gravitational wave burst on a physical black hole and pay special attention to the echos in the waveform, we uncover distinct features of the echos both in the time and frequency domains.",
      "pdf_url": "https://arxiv.org/pdf/2510.11518.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.12058",
      "title": "Relativistic framework for high-precision GNSS processing in GCRS/BCRS with extension to cislunar space",
      "authors": [
        "Slava G. Turyshev",
        "Yoaz E. Bar-Sever",
        "William I. Bertiger"
      ],
      "abstract": "Relativistic framework for high-precision GNSS processing in GCRS/BCRS with extension to cislunar space Slava G. Turyshev, Yoaz E. Bar-Sever, William I. Bertiger General Relativity and Quantum Cosmology (gr-qc) We present an implementation-oriented relativistic modeling framework for high-precision GNSS processing consistent with the IAU-adopted Barycentric and Geocentric Celestial Reference Systems (BCRS/GCRS) and their associated time scales (TCB/TDB and TCG/TT). We derive explicit ${\\cal O}(c^{-2})$ transformations for position, velocity, and acceleration between TT-compatible GCRS quantities and TDB-compatible BCRS quantities, and provide screened operational forms with conservative remainder bounds that quantify truncation errors in sub-centimeter orbit modeling and retain the term order required by $10^{-16}$-class fractional-frequency transfer. We implement a BCRS-native processing option in JPL's GipsyX and validate it via a 24~h round-trip GCRS$\\rightarrow$BCRS propagation-and-transform closure test at the few-mm level, demonstrating internal consistency of the dynamical model and the state transformations. To support emerging Earth-Moon applications, we define a Lunicentric Celestial Reference System (LCRS), its coordinate time (TCL), and a scaled lunar-surface time (TL), and specify a minimal near-rectilinear halo orbit (NRHO)-like regression test that exercises the BCRS$\\leftrightarrow$LCRS transformation chain together with the 1PN barycentric light-time model. End-to-end cislunar navigation performance additionally depends on signal availability and estimation strategy; the present work provides the relativistic reference-frame and time-transfer infrastructure needed to model observables at the centimeter and tens-of-picoseconds level.",
      "pdf_url": "https://arxiv.org/pdf/2511.12058.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.08050",
      "title": "The Infrared Universe",
      "authors": [
        "Jonathan Holland"
      ],
      "abstract": "v3: this version clarifies the inevitability of Carnot-Caratheodory geometry and mesoscopic scale selection in horizon-coupled semiclassical gravity, and closes the entropy-balance and information-theoretic arguments underlying the steady-state construction. Various observational implications and dynamical conclusions are developed General Relativity and Quantum Cosmology (gr-qc) We develop a mesoscopic framework in which the cosmological exterior is treated as an open quantum subsystem coupled to horizon degrees of freedom. Although local conservation laws satisfy $\\nabla_\\mu\\langle J^\\mu\\rangle=0$, transport of baryon number across horizons removes conserved charges from the observer--accessible sector, producing effective depletion in exterior densities. Global unitarity therefore requires compensating source terms in the reduced exterior continuity equations. We show that relativistic causality forces this compensation to occur through long--wavelength geometric excitations: only infrared modes can restore entropy and charge while remaining outside the causal wedge of the infalling matter. An infrared return channel thus emerges as a generic feature of horizon--coupled semiclassical gravity. The second ingredient is a Carnot--Carathéodory (CC) tangent geometry, whose mesoscopic scale $\\sigma$ governs both infrared mode excitation and the kinematics of photon and matter propagation. In this setting, photon trajectories follow recurrent horizontal geodesics, producing an effective cosmic cavity whose stationary state is a Planck spectrum characterized by $\\sigma$. The same scale modifies large--radius circular motion in a manner consistent with flattened galactic rotation curves. Horizon thermodynamics and mesoscopic balance laws then link $\\sigma$ to the cosmic expansion rate, yielding $H\\sim\\sigma$ and a unified infrared structure underlying photon equilibrium, baryon balance, and large--scale kinematics.",
      "pdf_url": "https://arxiv.org/pdf/2512.08050.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.17535",
      "title": "Advantages and disadvantages of maximally entangled states in dilaton black hole background",
      "authors": [
        "Zhen Yang",
        "He Cheng",
        "Si-Han Li"
      ],
      "abstract": "Advantages and disadvantages of maximally entangled states in dilaton black hole background Zhen Yang, He Cheng, Si-Han Li General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) We investigate quantum entanglement and coherence for four classes of Bell-like fermionic states in the vicinity of the event horizon of a Garfinkle-Horowitz-Strominger (GHS) dilaton black hole. Contrary to the common expectation that maximally entangled states always provide superior quantum resources, our results show that their entanglement can be lower than that of suitably chosen non-maximally entangled states in this curved spacetime background. This reveals that non-maximally entangled states may offer operational advantages for entanglement-based tasks under gravitational effects. In contrast, quantum coherence exhibits monotonic behavior: larger initial coherence leads to systematically enhanced robustness against the dilaton induced degradation. These results indicate that the optimal choice of initial quantum states depends sensitively on the specific quantum resource, either quantum entanglement or quantum coherence, required for quantum information processing near a dilaton black hole.",
      "pdf_url": "https://arxiv.org/pdf/2512.17535.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.19549",
      "title": "A Circular Disformal Kerr Black Hole",
      "authors": [
        "Jibril Ben Achour",
        "Adolfo Cisterna",
        "Hugo Roussille"
      ],
      "abstract": "A Circular Disformal Kerr Black Hole Jibril Ben Achour, Adolfo Cisterna, Hugo Roussille Title slightly changed. References added General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The Kerr solution is the cornerstone of General Relativity (GR) for modelling astrophysical rotating black holes and for testing GR through gravitational-wave observations and black hole imaging. Understanding how the Kerr geometry is modified in alternative theories of gravity is therefore a crucial step toward constraining possible deviations from GR. Despite their importance, exact analytical solutions describing rotating black holes in modified gravity are rare, limiting our ability to explore novel phenomenology and to design robust observational tests of new physics. In this work, we present a new exact rotating black hole solution within a specific scalar-tensor theory belonging to the Horndeski class. The solution is obtained via a disformal transformation acting on a Kerr stealth black hole. Crucially, unlike previous constructions, the disformal transformation of our chosen seed configuration preserves circularity, ensuring that many of the geometrical and physical properties that make the Kerr spacetime so compelling are retained. We refer to the resulting geometry as the Circular Disformal Kerr solution. Remarkably, key features such as the structure of Killing horizons, the ergosphere, and the absence of causality violations closely mirror those of the Kerr metric. The spacetime is algebraically general, corresponding to Petrov type I. This new exact solution therefore provides a rare example of a rotating black hole beyond GR that closely mimics the Kerr geometry, offering a valuable theoretical laboratory to investigate the phenomenology of Kerr-like black holes in modified gravity.",
      "pdf_url": "https://arxiv.org/pdf/2512.19549.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.05156",
      "title": "Optical Entropy and Generalized Thermodynamics of Solitonic Event Horizons",
      "authors": [
        "Hasan Oguz"
      ],
      "abstract": "Optical Entropy and Generalized Thermodynamics of Solitonic Event Horizons Hasan Oguz Optics (physics.optics); General Relativity and Quantum Cosmology (gr-qc); Pattern Formation and Solitons (nlin.PS) The realization of Hawking radiation in optical analogs has historically focused on kinematic observables, such as the effective temperature determined by the horizon's surface gravity. A complete thermodynamic description, however, necessitates a rigorous definition of entropy and irreversibility, which has remained elusive in Hamiltonian optical systems. In this work, we bridge this gap by introducing an operational entropy for solitonic event horizons, derived from the spectral partitioning of the optical field into coherent solitonic and incoherent radiative subsystems. We demonstrate that the emission of resonant radiation, mediated by the breaking of soliton integrability due to higher-order dispersion, serves as a fundamental mechanism for entropy production. Numerical simulations of the generalized nonlinear Schrodinger equation confirm that this process satisfies a generalized second law, where the change in total entropy is non-negative. These results establish optical event horizons as consistent nonequilibrium thermodynamic systems, offering a new pathway to explore the information-theoretic aspects of analog gravity in laboratory settings.",
      "pdf_url": "https://arxiv.org/pdf/2601.05156.pdf",
      "categories": [
        "gr-qc",
        "nlin.PS"
      ],
      "is_gw_related": false
    }
  ]
}