{
  "date": "2026-01-30",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 28,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.20003",
      "title": "Gödel-symmetric backgrounds and explicit spacetime symmetry breaking",
      "authors": [
        "César Riquelme",
        "Carlos M. Reyes",
        "A. F. Santos"
      ],
      "abstract": "Gödel-symmetric backgrounds and explicit spacetime symmetry breaking César Riquelme, Carlos M. Reyes, A. F. Santos General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Explicit breaking of diffeomorphism symmetry with nondynamical background fields in gravitational theories can lead to inconsistencies between the equations of motion and the underlying pseudo-Riemannian geometry. These theories produce a constraint equation that follows from the modified Einstein's equations and the contracted Bianchi identity which has no simple solution and raises questions about the consistency of backgrounds structures in extensions to general relativity. In contrast, spontaneous symmetry breaking where fields acquire a vacuum expectation value are shown to avoid these problems. Nevertheless, there are some approaches that consistently implement explicit diffeomorphism breaking by: i) introducing geometrical restrictions which may dynamically restore diffeomorphism invariance, ii) using the Stückelberg formalism where auxiliary scalar fields can carry degrees of freedom associated to spontaneously broken symmetries, and more recently by iii) exploiting the isometries of a given gravitational configuration in the presence of a background; which ultimately requires the background fields to be Lie-dragged along the Killing vectors. In this work, we further develop and apply the latter approach focusing on a concrete example involving the Gödel metric and the minimal gravitational Standard-Model Extension. We show that the resulting dynamics is fully consistent with the constraint equation and produce new Noether's identities. Furthermore we investigate causality violations by analyzing the critical radius, which is found to depend explicitly on the background fields. This dependence allows for the emergence of both causal and non-causal regions in spacetime.",
      "pdf_url": "https://arxiv.org/pdf/2601.20003.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20004",
      "title": "Branch structure and nonextensive thermodynamics of Kalb-Ramond-ModMax black holes: observational signatures",
      "authors": [
        "Erdem Sucu",
        "Izzet Sakalli",
        "Emmanuel N. Saridakis"
      ],
      "abstract": "Branch structure and nonextensive thermodynamics of Kalb-Ramond-ModMax black holes: observational signatures Erdem Sucu, Izzet Sakalli, Emmanuel N. Saridakis General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate a static, spherically symmetric black hole arising in Einstein gravity coupled to a Kalb-Ramond field and ModMax nonlinear electrodynamics, both of which are independently well motivated extensions of standard electrovacuum gravity. The solution depends, beyond mass and charge, on a Lorentz-violating parameter, a ModMax deformation parameter, and a discrete branch selector $\\zeta=\\pm1$. We show that the ordinary branch admits extremal and non-extremal configurations, while the phantom branch generically supports a single-horizon geometry. Black-hole thermodynamics is analyzed within the Tsallis non-extensive framework, revealing branch-dependent stability and Joule-Thomson behavior. Weak gravitational lensing, photon propagation in plasma, and tidal forces are then studied, revealing clear optical and strong-field signatures that distinguish the two branches. In particular, the ordinary branch exhibits finite-radius tidal inversion, absent in the phantom sector. Our results demonstrate that the combined Kalb-Ramond and ModMax effects lead to a rich and observationally distinguishable black-hole phenomenology.",
      "pdf_url": "https://arxiv.org/pdf/2601.20004.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20053",
      "title": "General Scalar Field Inflation ACT Attractors: Utilizing the $n_s(r)$ relation",
      "authors": [
        "V.K. Oikonomou"
      ],
      "abstract": "General Scalar Field Inflation ACT Attractors: Utilizing the $n_s(r)$ relation V.K. Oikonomou General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) The ACT data have severely constrained the single scalar field models. Known models of inflation, like the Starobinsky model, the Higgs model and the $a$-attractors are at least $2\\sigma$ off the ACT data. In this work we aim to provide a top-to-bottom approach in single scalar field inflationary cosmology compatible with the ACT data. Specifically, inspired by the fact that the Starobinsky model, the Higgs model and the $a$-attractors, all being plateau potentials, result to the same attractor relation between the spectral index of scalar perturbations and the tensor-to-scalar ratio, which is of the form $n_s(r)=1-\\alpha r^{1/2}$, in this work we seek for attractors of the form $n_s(r)=f(r)$ that may lead to ACT-compatible inflation. Specifically, we fix the function $f(r)$ to have a specific desirable form and then solve the differential equation $n_s(r)=f(r)$ to find the potential which results to the relation $n_s(r)=f(r)$. We discovered analytically three classes of potentials which are variants of the general form $n_s(r)=\\gamma \\pm \\beta r \\pm r^{1/2}$ and all these models are found to be compatible with the ACT data.",
      "pdf_url": "https://arxiv.org/pdf/2601.20053.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20056",
      "title": "A Remedy of the Trans-Planckian Censorship Problem with Smooth Slow-roll to Power-law Inflation Transitions in Scalar Field Theory",
      "authors": [
        "S.D. Odintsov",
        "V.K. Oikonomou"
      ],
      "abstract": "A Remedy of the Trans-Planckian Censorship Problem with Smooth Slow-roll to Power-law Inflation Transitions in Scalar Field Theory S.D. Odintsov, V.K. Oikonomou General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) It is known that if the standard slow-roll inflation is followed by a power-law inflationary regime, then the trans-Planckian modes may be safely be contained in the Hubble horizon and never exit it during inflation. In this work we investigate how to realize a smooth transition between a slow-roll and a power-law inflationary regime in the context of single scalar field inflation. As we show it is possible to realize such a smooth transition by generalizing the kinetic energy of single scalar field in the form $\\dot{\\phi}^2=\\beta(\\phi)V(\\phi)$, where $\\beta(\\phi)$ is some appropriate function of the scalar field. Using two distinct approaches we show that it is possible to realize a smooth transition from a slow-roll to a power-law inflationary regime, and the two approaches produce identical results regarding the slow-roll regime. Also we show that the slow-roll regime is quite short, about $N\\sim 30$ $e$-foldings, with the flatness and horizon problems being solved with the synergistic effect of the two inflationary patches. The slow-roll era is found to be compatible with the Atacama Cosmology Telescope data.",
      "pdf_url": "https://arxiv.org/pdf/2601.20056.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20070",
      "title": "An Analytic Scale-dependent Dark Matter Profile and the Baryonic Tully-Fisher Relation",
      "authors": [
        "V.K. Oikonomou"
      ],
      "abstract": "An Analytic Scale-dependent Dark Matter Profile and the Baryonic Tully-Fisher Relation V.K. Oikonomou The arXiv entry contains an extended appendix with all the SPARC galaxies. The journal version will not include the appendix, only some characteristic galaxies will be presented General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) In this work we use the recently introduced concept of self-interacting dark matter with scale-dependent equation of state, and we provide an analytic model of dark matter that can produce viable rotation curves even for low-surface-brightness galaxies, irregular galaxies, low-luminosity spirals and dwarf galaxies, all known to challenge the cold dark matter description. The radius dependent effective equation of state of the self-interacting dark matter model we shall introduce is assumed to be an isothermal equation of state of the form $P(r)=K(r)\\left(\\frac{\\rho(r)}{\\rho_{\\star}}\\right)$, where the energy density will have the form $\\rho(r)=\\frac{\\rho_0}{\\left( 1+\\frac{r^2}{\\alpha^2}\\right)^{5/2}}$, while the entropy function $K(r)$ is $K(r)=\\frac{K_0}{\\left( 1+\\frac{r^2}{\\alpha^2}\\right)^{1/2}}$. The resulting model is confronted in detail with the SPARC galaxy data and 175 galaxies are used and tested. It proves that the analytic model can successfully produce the rotation curves of 116 galaxies, most of which are small mass spirals, irregular galaxies, low-surface-brightness and low-luminosity spirals and dwarf galaxies. On the other hand, 59 galaxies cannot be successfully described by our analytic model. We tested statistically the correlation between the parameter $K_0$ of the entropy function corresponding to the viable galaxies, and the flat rotation velocity $V_{flat}$ and the maximum rotation velocity $V_{max}$ of the galaxies from the SPARC data. We also examined the baryon mass $M_b$-$K_0$ relation and the luminosity $L$-$K_0$ relation. We have been able to produce the baryonic Tully-Fisher relation for the viable galaxies, directly from the correlation $K_0$-$M_b$ and $K_0$-$V_{flat}$, with the resulting relation being $M_b\\sim V_{flat}^{4.026 \\pm 0.371}$, however we failed to produce the canonical Tully-Fisher relation.",
      "pdf_url": "https://arxiv.org/pdf/2601.20070.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20140",
      "title": "Arrow of time problem in gravitational collapse",
      "authors": [
        "Samarjit Chakraborty",
        "Sunil D. Maharaj",
        "Rituparno Goswami",
        "Sarbari Guha"
      ],
      "abstract": "Arrow of time problem in gravitational collapse Samarjit Chakraborty, Sunil D. Maharaj, Rituparno Goswami, Sarbari Guha General Relativity and Quantum Cosmology (gr-qc) We investigate the arrow of time problem in the context of gravitational collapse of radiating stars in higher dimensions for both neutral and charged matter. The interior spacetime is described by a shear-free spherically symmetric metric filled with a dissipative fluid. The exterior spacetime of the radiating star is taken as the higher dimensional Vaidya metric. We establish that the arrow of time associated with gravitational entropy is opposite to the thermodynamic arrow of time for all dimensions. The physical consequences of our results are considered. Our result conforms with previous studies on shear-free spherical collapse, which suggests, avoidance of the naked singularity as the end state results in a wrong arrow of time, indicating a fundamental problem with the local application of the Weyl curvature hypothesis.",
      "pdf_url": "https://arxiv.org/pdf/2601.20140.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20286",
      "title": "Quantum Cosmology as a Hydrogen atom: Discrete $Λ$ and cyclic Universes from Wheeler-DeWitt quantization",
      "authors": [
        "Dipayan Mukherjee",
        "Harkirat Singh Sahota",
        "S. Shankaranarayanan"
      ],
      "abstract": "Quantum Cosmology as a Hydrogen atom: Discrete $Λ$ and cyclic Universes from Wheeler-DeWitt quantization Dipayan Mukherjee, Harkirat Singh Sahota, S. Shankaranarayanan 18 pages, 3 figures. Accepted for publication in Classical and Quantum Gravity General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Building upon our recently established correspondence between quantum cosmology and the hydrogen atom [1], we investigate the specific sector of a negative cosmological constant ($\\Lambda < 0$) in a flat FLRW universe with dust. While the positive $\\Lambda$ sector [1] yields a continuous spectrum and a single bounce, we show here that the negative $\\Lambda$ sector leads to a discrete spectrum of energy eigenvalues, effectively quantizing the cosmological constant. Within this dual description, the operator-ordering ambiguity parameter appears as the azimuthal quantum number of the hydrogen atom. A skewed Bohr correspondence emerges for the bound states, matching classical evolution at large volumes but deviating near the bounce. By constructing wave packets from these bound states, we demonstrate that the classical Big Bang and Big Crunch singularities are resolved, and the universe oscillates between quantum bounces and classical turnaround points. The expectation values of the observables indicate a cyclic universe -- with vanishing Hubble parameter at turnarounds -- undergoing quantum bounces. This exactly solvable model offers a tractable setting to explore quantum gravitational effects in cosmology. We analyze the properties of this cyclic universe, contrasting its bound-state dynamics with the scattering states of the de Sitter case.",
      "pdf_url": "https://arxiv.org/pdf/2601.20286.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20353",
      "title": "GUP effects on Hawking temperature in a hot NUT Kerr Newman Kasuya Anti de Sitter black hole",
      "authors": [
        "Heisnam Shanjit Singh",
        "Khileswar Chandi"
      ],
      "abstract": "GUP effects on Hawking temperature in a hot NUT Kerr Newman Kasuya Anti de Sitter black hole Heisnam Shanjit Singh, Khileswar Chandi The manuscript consists of 14 pages and 8 figures General Relativity and Quantum Cosmology (gr-qc) In this work, we use the generalised Klein-Gordon Equation in curved spacetime with an electromagnetic field to investigate the tunnelling phenomenon of scalar particles originating from the hot NUT Kerr Newman Kasuya Anti de Sitter (KNKNK AdS) black hole. Using the tunnelling formalism, we obtain a modified Hawking temperature different from previous works due to the quantum gravity effect for the charged Dirac particle at the HNKNK AdS black hole's horizon. We find that the modified Hawking temperature is affected by the cosmological constant, magnetic mass, electric and magnetic charges. We demonstrate that a significant number of discontinuities exist in the heat capacities of the HNKNK AdS, indicating that the black hole system becomes unstable as the black hole size decreases.",
      "pdf_url": "https://arxiv.org/pdf/2601.20353.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20436",
      "title": "Violation of the Leggett-Garg inequality in photon-graviton conversion",
      "authors": [
        "Kimihiro Nomura",
        "Akira Taniguchi",
        "Kazushige Ueda"
      ],
      "abstract": "Violation of the Leggett-Garg inequality in photon-graviton conversion Kimihiro Nomura, Akira Taniguchi, Kazushige Ueda General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) The Leggett-Garg inequality (LGI) is a temporal analogue of Bell's inequality and provides a quantitative test of the nonclassicality of a system through its violation. We analytically investigate the violation of the LGI in the context of photon-graviton conversion in a magnetic field background, motivated by its potential applications to testing the nonclassicality of gravity. When gravitational perturbations are quantized as gravitons, the conversion of an initial single photon state gives rise to a superposition of photon and graviton states. We show that the temporal correlations obtained from successive projective measurements on the photon-graviton system violate the LGI. Observation of such a violation would provide a novel avenue for probing the quantum nature of gravity.",
      "pdf_url": "https://arxiv.org/pdf/2601.20436.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20512",
      "title": "Enhancing online estimation of CBC parameters with the low-latency MBTA analysis",
      "authors": [
        "Florian Aubin",
        "Inès Bentara",
        "Damir Buskulic",
        "Gianluca M Guidi",
        "Vincent Juste",
        "Morgan Lethuillier",
        "Frédérique Marion",
        "Lorenzo Mobilia",
        "Benoît Mours",
        "Amazigh Ouzriat",
        "Thomas Sainrat",
        "Viola Sordini"
      ],
      "abstract": "Enhancing online estimation of CBC parameters with the low-latency MBTA analysis Florian Aubin, Inès Bentara, Damir Buskulic, Gianluca M Guidi, Vincent Juste, Morgan Lethuillier, Frédérique Marion, Lorenzo Mobilia, Benoît Mours, Amazigh Ouzriat, Thomas Sainrat, Viola Sordini General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) In this paper, we describe the procedure implemented in the Multi-Band Template Analysis (MBTA) search pipeline to produce online posterior distributions of compact binary coalescence (CBC) gravitational-wave parameters. This procedure relies on an SNR optimizer technique, which consists of filtering dense local template banks. We present how these banks are constructed using information from the initial detection and detail how the results of the filtering are used to estimate source parameters and provide posterior distributions. We demonstrate the performance of our procedure on simulations and compare our source parameter estimates with the results from the first part of the fourth observing run (O4a) recently released by the LIGO-Virgo-KAGRA (LVK) collaboration.",
      "pdf_url": "https://arxiv.org/pdf/2601.20512.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.20530",
      "title": "Pathology of the Unified Dark Sectors in Modified General Relativity",
      "authors": [
        "Mohsen Khodadi"
      ],
      "abstract": "Pathology of the Unified Dark Sectors in Modified General Relativity Mohsen Khodadi 27 pages, 1 figure, to appear in Classical and Quantum Gravity (CQG) General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) This paper presents a comprehensive stability analysis of the black hole solution within Modified General Relativity (MGR), a theory proposing a unified geometric description of dark matter (DM) and dark energy (DE). A rigorous gauge-invariant formalism is employed to analyze gravitational perturbations of the extended Schwarzschild metric. The central finding is a critical pathology within the polar perturbation sector, where metric fluctuations couple to the theory's fundamental line element field. This coupling is governed by a factor that, while well-behaved at the horizon, diverges powerfully in the far-field limit as a direct consequence of the theory's non-asymptotically flat nature. This indicates a strong infrared instability that overwhelms perturbations at large distances. In stark contrast, the axial perturbation sector is found to be completely stable. This dichotomy proves that the instability is not inherent to the background metric but is specifically generated by the novel coupling mechanism encoding MGR's unified dark sectors. The results reveal a fundamental strong-coupling problem within the MGR framework, challenging its physical viability as an alternative to Einstein's General Relativity (EGR).",
      "pdf_url": "https://arxiv.org/pdf/2601.20530.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20553",
      "title": "Gravitational wave detection via photon-graviton scattering and quantum interference",
      "authors": [
        "K. Hari",
        "S. Shankaranarayanan"
      ],
      "abstract": "Gravitational wave detection via photon-graviton scattering and quantum interference K. Hari (IIT Bombay), S. Shankaranarayanan (IIT Bombay) 23 pages, 6 figures, comments welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Optics (physics.optics); Quantum Physics (quant-ph) We present a fully quantum field-theoretic framework for gravitational wave (GW) detection in which the interaction is described as photon-graviton scattering. In this picture, the GW acts as a coherent background that induces inelastic energy exchanges with the electromagnetic field - analogous to the Stokes and anti-Stokes shifts in Raman spectroscopy. We propose a detection scheme sensitive to this microscopic mechanism based on Hong-Ou-Mandel interference. We show that the scattering-induced phase shifts render frequency-entangled photon pairs distinguishable, spoiling their destructive quantum interference. GW signal is thus encoded in the modulation of photon coincidence rates rather than classical field intensity, offering a complementary quantum probe of the gravitational universe that recovers the standard classical response in the macroscopic limit.",
      "pdf_url": "https://arxiv.org/pdf/2601.20553.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.20609",
      "title": "Matter around Schwarzschild black holes in scalar-tensor theories: Absorption and Scattering",
      "authors": [
        "Qian Li",
        "Junji Jia"
      ],
      "abstract": "Matter around Schwarzschild black holes in scalar-tensor theories: Absorption and Scattering Qian Li, Junji Jia General Relativity and Quantum Cosmology (gr-qc) We investigate the absorption and scattering by a Schwarzschild black hole in scalar--tensor theories of gravity, where the coupling between matter and the scalar field induces different models for the effective mass of the scalar field. In model~I, a Bondi-type mass model described by the asymptotic mass $\\mu_c$, horizon mass $\\mu_H$, and profile slope $\\lambda$, it is found that the absorption cross section increases with steeper $\\lambda$, larger $\\mu_c$ (especially at higher frequencies), or smaller $\\mu_H$. The differential scattering cross section in this model shows the strongest dependence on the horizon mass $\\mu_H$. When $\\mu_H$ exceeds a critical value for a fixed incoming wave frequency $\\omega$, no partial wave transmits into the black hole, flattening the differential scattering cross section as a function of angle before it increases again with further increase of $\\mu_H$. Model~II, which considers a truncated accretion region outside some radius $r_0$, contains a potential well in its effective scattering potential. Its absorption cross section decreases in the low-frequency region as the accretion radius $r_0$ decreases, and more importantly, it shows resonance peaks at the quasibound wave frequencies due to resonances induced by the potential well. The differential scattering cross sections show dips around intermediate scattering angles when the parameters (mainly $\\mu_H$ and $\\omega$) are such that the resonantly scattered and non-resonant waves interfere destructively around these angles. In both models, absorption exhibits a zero-absorption band as $\\omega$ approaches $\\mu_c$ from above, and in both absorption and scattering, the effects of the parameters are found to diminish in the high-frequency limit.",
      "pdf_url": "https://arxiv.org/pdf/2601.20609.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.20839",
      "title": "Beyond Comoving Volume: Horizon Flux and Matter Creation in Entropic Cosmology",
      "authors": [
        "Víctor H. Cárdenas",
        "Miguel Cruz",
        "Samuel Lepe"
      ],
      "abstract": "Beyond Comoving Volume: Horizon Flux and Matter Creation in Entropic Cosmology Víctor H. Cárdenas, Miguel Cruz, Samuel Lepe General Relativity and Quantum Cosmology (gr-qc) We explore the derivation of the Friedmann equations from a thermodynamic perspective, applying the unified first law of thermodynamics to the apparent horizon of a flat Friedmann-Lemaître-Robertson-Walker (FLRW) universe. We extend this framework to incorporate gravitationally induced particle creation, treating the region enclosed by the apparent horizon as an open thermodynamic system. A crucial aspect of our analysis is the recognition that the apparent horizon volume is not comoving; this requires a consistent accounting of particle exchange across the moving boundary. We demonstrate that the evolution of the particle number, and explicitly the matter entropy, can be decomposed into two distinct physical contributions: genuine bulk particle production and a net flux induced by the dynamics of the horizon itself. Finally, we derive the Generalized Second Law (GSL) in this setting, showing transparently how the total entropy budget is balanced by horizon thermodynamics, bulk creation, and boundary fluxes.",
      "pdf_url": "https://arxiv.org/pdf/2601.20839.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2503.23193",
      "title": "Gravitational Landscapes: black holes with linear equations of state in asymptotically safe gravity",
      "authors": [
        "Ramin Hassannejad",
        "Fatimah Shojai",
        "Kazuharu Bamba"
      ],
      "abstract": "Gravitational Landscapes: black holes with linear equations of state in asymptotically safe gravity Ramin Hassannejad, Fatimah Shojai, Kazuharu Bamba General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study black holes with linear equation of state within the framework of asymptotically safe gravity. This study extends previous work on gravitational collapse in asymptotically safe gravity (that has been done for a dust fluid) by considering into account the pressure of stellar matter. We derive modified field equations containing the running gravitational coupling and the cosmological constant as functions of energy density. The interior space-time of collapsing star is modeled by the Friedmann-Lemaître-Robertson-Walker metric, while the exterior is described by a static spherically symmetric space-time. Different equations of state from ordinary matter to exotic phantom energy are considered to investigate their impact on black hole structure and horizon formation. Our results illustrate that asymptotically safe gravity can introduce non-singular black hole solutions under specific conditions. These results provide new insights into black hole physics and the avoidance of singularities within the asymptotically safe gravity framework.",
      "pdf_url": "https://arxiv.org/pdf/2503.23193.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2504.05708",
      "title": "Thermodynamic supercriticality and complex phase diagram for the AdS black hole",
      "authors": [
        "Zhen-Ming Xu",
        "Robert B. Mann"
      ],
      "abstract": "Thermodynamic supercriticality and complex phase diagram for the AdS black hole Zhen-Ming Xu, Robert B. Mann v1:8 pages, 4 figures; v2: Added discussion and matching published version Phys. Rev. Lett. 136, 041402 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this study, we extend the application of the Lee-Yang phase transition theorem to the realm of AdS black hole thermodynamics, thereby deriving a comprehensive complex phase diagram for such systems. Our research augments extant studies on black hole thermodynamic phase diagrams, particularly in the regime above the critical point, by delineating the Widom line of AdS black holes. This boundary segregates the supercritical domain of the phase diagram into two disparate zones. As the system traverses the thermodynamic crossover within the supercritical region, it undergoes a transition from one supercritical phase to another, while maintaining the continuity of its thermodynamic state functions. This behavior is fundamentally different from that below the critical point, where crossing the coexistence line results in discontinuities of thermodynamic state functions. The Widom line enables a thermodynamic crossover between single-phase states without traversing the spinodal that emerges in the critical region.",
      "pdf_url": "https://arxiv.org/pdf/2504.05708.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.10696",
      "title": "Twisting inflation to sub-Planckian axion decay constants",
      "authors": [
        "Peter Adshead",
        "Suddhasattwa Brahma",
        "Indranil Das"
      ],
      "abstract": "Twisting inflation to sub-Planckian axion decay constants Peter Adshead, Suddhasattwa Brahma, Indranil Das General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study pseudoscalar inflation in the Einstein-Cartan-Palatini (first-order) formulation of gravity while allowing for torsion. We introduce two non-minimal interactions in the gravitational sector: pseudoscalar couplings to the Pontryagin density (Chern-Simons term) and the Nieh-Yan topological invariant. In the presence of these terms, the rolling pseudoscalar sources non-trivial torsional fields during inflation. We show that pathological gradient and ghost instabilities limit the strength of the coupling to the Pontryagin density during inflation. Furthermore, we show that the interaction with the Nieh-Yan term induces a new contribution to the pseudoscalar kinetic term, which parametrically increases its decay constant and allows for inflation on steep potentials. The torsion field generated by the background is parity violating, which is manifest in the resulting chiral gravitational wave spectrum. We find that the scalar sector is largely unaffected beyond the remapping of the axion decay constant to a larger value. Consequently, we show that while natural inflation with a cosine potential remains inconsistent with observations, the squared quartic hilltop potential can be made consistent with Planck 2018 data even for sub-Planckian decay constants by coupling to the Nieh-Yan term.",
      "pdf_url": "https://arxiv.org/pdf/2507.10696.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.16911",
      "title": "Effects of quantum geometry on the decoherence induced by black holes",
      "authors": [
        "Max Joseph Fahn",
        "Alessandro Pesci"
      ],
      "abstract": "Effects of quantum geometry on the decoherence induced by black holes Max Joseph Fahn, Alessandro Pesci 5 pages, 1 figure. v2: The text has been updated with minor changes to bring it into line with the published version; updated some references, extended the discussion on the assumption of a minimal length Phys.Rev.D 112 (2025) 12, L121502 General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Recently, it has been shown that a quantum system held in spatial superposition and then eventually recombined does experience decoherence from black hole horizons, at a level increasing linearly with the time the superposition has been kept open. In this, the effects of the horizon have been derived using a classical spacetime picture for the latter. In the present note we point out that quantum aspects of the geometry itself of the quantum black hole could significantly affect the results. In a specific effective implementation of the quantum geometry in terms of a minimal length and ensuing minimal area, it appears in particular that, for selected values of the quantum of area proposed on various grounds in the literature, the decoherence induced by the horizon turns out to be limited to negligibly small values.",
      "pdf_url": "https://arxiv.org/pdf/2507.16911.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.18709",
      "title": "Horizon quantum geometries and decoherence",
      "authors": [
        "Max Joseph Fahn",
        "Alessandro Pesci"
      ],
      "abstract": "Horizon quantum geometries and decoherence Max Joseph Fahn, Alessandro Pesci 21 pages, 6 figures, including 5 pages of appendices. v2: The text has been updated with minor changes to bring it into line with the published version; updated some references, extended the discussion at the beginning of sections 2 and 3 Phys.Rev.D 112 (2025) 12, 124036 General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) There is mounting theoretical evidence that black hole horizons induce decoherence on a quantum system, say a particle, put in a superposition of locations, with the decoherence functional, evaluated after closure of the superposition, increasing linearly with the time the superposition has been kept open. This phenomenon has been shown to owe its existence to soft modes, that is modes with very low frequencies, of the quantum fields -- sourced by the particle -- which pierce through the horizon, or also can be understood as coming from the interaction with the black hole described as a thermodynamic quantum system at Hawking's temperature. Here we investigate the effects of ensuing quantum aspects of the geometry itself of the horizon, in an effective perspective in which the quantum geometry of the horizon is captured by existence of a limit length or by horizon area quantisation. We show that the discreteness of the energy levels associated to the different geometric configurations might have strong impact on the results, in particular reducing the decoherence effects even to a negligible level in case of quanta of area $A_0 = \\mathcal{O}(1) \\, \\, l_p^2$ or larger, with $l_p$ the Planck length.",
      "pdf_url": "https://arxiv.org/pdf/2507.18709.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.20307",
      "title": "Confronting Inflation and Reheating with Observations: Improved Predictions",
      "authors": [
        "Ying-Ying Ye",
        "Bao-Min Gu"
      ],
      "abstract": "Confronting Inflation and Reheating with Observations: Improved Predictions Ying-Ying Ye, Bao-Min Gu 11 pages,6 figures, accepted by Physics Letters B General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Using the latest observational data, we constrain the inflationary dynamics and the subsequent reheating epoch. Predictions for both phases can be significantly improved by employing numerically computed results compared to the slow-roll approximations. These results enable a more accurate reassessment of the observational viability of inflationary models, provide tighter constraints on the reheating history, and help lift the degeneracies in the predictions of inflation and reheating dynamics. Given current observational bounds, this enables a more accurate understanding of the early universe physics.",
      "pdf_url": "https://arxiv.org/pdf/2507.20307.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.01532",
      "title": "Inflationary dynamics of non-minimally coupled $f(R)$ matter-curvature theories",
      "authors": [
        "Miguel Barroso Varela",
        "Orfeu Bertolami",
        "Andreas Mantziris"
      ],
      "abstract": "Inflationary dynamics of non-minimally coupled $f(R)$ matter-curvature theories Miguel Barroso Varela, Orfeu Bertolami, Andreas Mantziris 26 pages, 8 figures, matches published version in JCAP General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) This study examines how inflationary dynamics are affected by $f(R)$ theories with a non-minimal coupling between matter and curvature. Both positive and negative corrections to the minimal coupling of General Relativity are considered, and a robust numerical method is developed that evolves the metric and the inflaton field in this modified theory beyond slow-roll. Through a stability analysis, we find that positive models are inherently unstable during slow-roll, whereas negative ones can accommodate a stable attractor de Sitter solution. Using the amplitude of the scalar power spectrum from the latest data releases, we constrain the scale of the non-minimal coupling to be above $10^{13}$ GeV. In light of the 2018 Planck, BICEP/Keck and the recent Atacama Cosmology Telescope data for the scalar spectral index and tensor-to-scalar ratio, strong constraints on the coupling strength force the effects of these modified theories to be, at most, slightly above the perturbative level. Furthermore, we determine that the choice of the perfect fluid matter Lagrangian does not impact the inflationary observables at the pivot scale. Finally, we present the predicted observables for different inflationary potentials and show that even though classical gravity is still preferred by the data, there are areas of the parameter space that are viable for non-minimally coupled inflationary models.",
      "pdf_url": "https://arxiv.org/pdf/2509.01532.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.16310",
      "title": "Spectral instability of horizonless compact objects within astrophysical environments",
      "authors": [
        "Kyriakos Destounis",
        "Mateus Malato Corrêa",
        "Caio F. B. Macedo",
        "Rodrigo Panosso Macedo"
      ],
      "abstract": "Spectral instability of horizonless compact objects within astrophysical environments Kyriakos Destounis, Mateus Malato Corrêa, Caio F. B. Macedo, Rodrigo Panosso Macedo 21 pages, 8 figures, 1 table, accepted for publication in PRD General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Recent non-modal analyses have uncovered spectral instabilities in the quasinormal-mode spectrum of black holes; a phenomenon that intriguingly extends to spherically-symmetric exotic compact objects. These results point to a sensitivity of the spectrum with potentially far-reaching implications for black-hole spectroscopy. At the same time, growing attention has turned to astrophysical environments around compact objects and their role in shaping gravitational-wave astrophysics. In this work, we establish a direct link between spectral instabilities and environmental effects by modeling matter as a localized bump outside the light ring of a spectrally-unstable exotic compact object with a purely reflective surface. We find that while such environments can destabilize the fundamental quasinormal modes of loosely-compact exotic objects, the fundamental modes of ultra-compact horizonless objects remain remarkably robust. In contrast, overtones are shown to develop spectral instabilities in the presence of the bump. By tracking both interior modes, trapped between the light ring and the surface of the exotic compact object, and exterior modes, confined between the bump and the light ring, we uncover an overtaking instability in which ``unperturbed'' exterior overtones metamorphose into ``perturbed'' fundamental modes as the bump moves outward. Finally, we demonstrate that environmental effects, while capable of further amplifying spectral instabilities, cannot induce next-to-leading-order perturbations strong enough to trigger a modal instability.",
      "pdf_url": "https://arxiv.org/pdf/2509.16310.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.18022",
      "title": "Constraining a de Broglie--Bohm quantum bounce cosmology with Planck data",
      "authors": [
        "Micol Benetti",
        "Rudnei O. Ramos",
        "Renato Silva",
        "Gustavo S. Vicente"
      ],
      "abstract": "Constraining a de Broglie--Bohm quantum bounce cosmology with Planck data Micol Benetti, Rudnei O. Ramos, Renato Silva, Gustavo S. Vicente 12 pages, 5 figures. Replaced with the version matching the published one in the PRD Phys. Rev. D 113, 023543 (2026) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) This work investigates a singularity-free early Universe within the paradigm of quantum cosmology. We develop a bouncing model where the singularity is resolved via the de Broglie--Bohm interpretation of quantum mechanics, which provides a deterministic trajectory for the scale factor through a quantum bounce. The primordial power spectrum for scalar perturbations is derived, incorporating a characteristic modulation (distortion function) imprinted by the nonstandard quantum gravitational dynamics near the bounce. We confront this model with the Planck 2018 cosmic microwave background data, establishing its strong compatibility with observations. Our analysis places a stringent upper bound on the fundamental scale of the bounce $k_B$, constraining the parameter space of such quantum cosmological scenarios. {}Furthermore, the model's specific scale-dependent anticorrelation between the spectral index and amplitude of perturbations offers a potential mechanism for mitigating the $H_0$-$\\sigma_8$ tension, presenting a testable signature for future cosmological surveys.",
      "pdf_url": "https://arxiv.org/pdf/2510.18022.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.06082",
      "title": "Hidden symmetries for tidal Love numbers: Generalities and applications to analog black holes",
      "authors": [
        "Valerio De Luca",
        "Brandon Khek",
        "Justin Khoury",
        "Mark Trodden"
      ],
      "abstract": "Hidden symmetries for tidal Love numbers: Generalities and applications to analog black holes Valerio De Luca, Brandon Khek, Justin Khoury, Mark Trodden 19 pages, 1 figure. v2: matching version published in PRD General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Tidal Love numbers characterize the conservative, static response of compact objects to external tidal fields. Remarkably, these quantities vanish identically for asymptotically flat black holes in four-dimensional general relativity. This behavior has been attributed to hidden symmetries -- both geometric and algebraic -- governing perturbations in these space-times. Interestingly, a similar vanishing of selected multipolar Love numbers arises in the context of supersonic acoustic flows. These systems share several key features with black holes in general relativity, such as the presence of an effective acoustic horizon and a wave equation describing linear excitations. In this work, we explore a symmetry-based connection between the two frameworks and demonstrate that the ladder symmetries observed in acoustic black holes can be traced to structural properties of the underlying wave equation, mirroring those found in general relativistic black hole space-times.",
      "pdf_url": "https://arxiv.org/pdf/2512.06082.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.13725",
      "title": "Phenomenology of Rotating GEUP Black Holes",
      "authors": [
        "Nikko John Leo S. Lobos"
      ],
      "abstract": "Phenomenology of Rotating GEUP Black Holes Nikko John Leo S. Lobos General Relativity and Quantum Cosmology (gr-qc) We investigate the phenomenological implications of quantum gravity on rotating black holes within the framework of the Generalized Extended Uncertainty Principle (GEUP), which incorporates both minimal length (ultraviolet) and large-scale (infrared) corrections. Lacking a full non-perturbative formulation of quantum gravity, we adopt a metric-based approach. We construct a stationary, axisymmetric ansatz via the Newman-Janis algorithm to model the kinematic features of a rotating black hole subject to Generalized Extended Uncertainty Principle (GEUP) corrections. The thermodynamic analysis reveals that in the infrared-dominated regime, the Hawking temperature scales as $T_H \\sim M^{-3}$, leading to a rapid cooling phase that significantly prolongs the lifetime of supermassive black holes. We derive the modified Teukolsky Master Equation for gravitational perturbations and demonstrate that the background geometry preserves the isospectrality between axial and polar modes. In the eikonal limit, the quasinormal mode (QNM) spectrum exhibits orthogonal shifts: the minimal length parameter $\\beta$ induces a spectral blueshift and enhanced damping, while the large-scale parameter $\\alpha$ induces a spectral redshift and suppressed damping. Finally, we constrain the theory using observational data from LIGO/Virgo and the Event Horizon Telescope. We establish that the shadow of M87* is approximately $10^6$ times more sensitive to large-scale corrections than Sgr A*, placing stringent bounds on the EUP parameter, while gravitational wave spectroscopy provides complementary constraints on the GUP sector.",
      "pdf_url": "https://arxiv.org/pdf/2601.13725.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.17953",
      "title": "QPO-Based Bayesian Constraints on Charged Particle Dynamics Around Magnetized Schwarzschild Black Holes",
      "authors": [
        "Zakaria. Ahal",
        "Hasan El Moumni",
        "Karima Masmar"
      ],
      "abstract": "QPO-Based Bayesian Constraints on Charged Particle Dynamics Around Magnetized Schwarzschild Black Holes Zakaria. Ahal, Hasan El Moumni, Karima Masmar 26 pages and 12 figures, assumptions clarified, and acknowledgement added General Relativity and Quantum Cosmology (gr-qc) We study the motion of charged particles with a magnetic dipole moment orbiting a Schwarzschild black hole immersed in an external paraboloidal magnetic field. The interaction between the particle's intrinsic magnetic moment and the black hole magnetosphere is modeled through a dipole coupling, and the equations of motion are derived using the Hamilton-Jacobi formalism. We analyze equatorial circular orbits, the innermost stable circular orbit, and epicyclic oscillations, showing that the magnetic field strength and coupling parameter produce competing effects on orbital stability and fundamental frequencies. These frequencies are applied to model high-frequency quasi-periodic oscillations within the relativistic precession framework. Using observational QPO data from stellar-mass, intermediate-mass, and supermassive black holes, we perform a Bayesian parameter estimation based on Markov Chain Monte Carlo techniques. The analysis constrains the black hole mass, magnetic field strength, field geometry, coupling parameter, and QPO orbital radius, highlighting the role of magnetospheric interactions in shaping both particle dynamics and timing properties of accreting black holes.",
      "pdf_url": "https://arxiv.org/pdf/2601.17953.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.01080",
      "title": "Nondestructive optomechanical detection scheme for Bose-Einstein condensates",
      "authors": [
        "Cisco Gooding",
        "Cameron R. D. Bunney",
        "Samin Tajik",
        "Sebastian Erne",
        "Steffen Biermann",
        "Jörg Schmiedmayer",
        "Jorma Louko",
        "William G. Unruh",
        "Silke Weinfurtner"
      ],
      "abstract": "Nondestructive optomechanical detection scheme for Bose-Einstein condensates Cisco Gooding, Cameron R. D. Bunney, Samin Tajik, Sebastian Erne, Steffen Biermann, Jörg Schmiedmayer, Jorma Louko, William G. Unruh, Silke Weinfurtner 9 pages, 2 figures, 6 pages supplemental material. v2: clarifications added and presentation tightened Phys. Rev. Lett. 136, 043401 (2026) Quantum Gases (cond-mat.quant-gas); General Relativity and Quantum Cosmology (gr-qc) We present a two-tone heterodyne optical readout scheme to extract unequal-time density correlations along an arbitrary stationary interaction path from a pancake-shaped Bose-Einstein condensate, using a modulated laser probe. Analysing the measurement noise both from imprecision and backaction, we identify the standard quantum limit for the signal-extraction scheme, and examine how a class of two-mode squeezed initial states can be used to push beyond this limit. As an application, we show how the readout scheme can be used for an experimentally feasible realisation of acceleration-dependence of quantum-vacuum fluctuations in the system, including the analogue spacetime circular motion Unruh effect. The scheme is adaptable beyond Bose-Einstein condensates, providing nondestructive access to unequal-time correlations in quantum fluids.",
      "pdf_url": "https://arxiv.org/pdf/2508.01080.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.15256",
      "title": "Quantum Entanglement of Anyonic Charges and Emergent Spacetime Geometry",
      "authors": [
        "Hoang-Anh Le",
        "Hyun Cheol Lee",
        "S.-R. Eric Yang"
      ],
      "abstract": "Quantum Entanglement of Anyonic Charges and Emergent Spacetime Geometry Hoang-Anh Le, Hyun Cheol Lee, S.-R. Eric Yang Strongly Correlated Electrons (cond-mat.str-el); General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Intrinsically topologically ordered phases can host anyons. Here, we take the view that entanglement between anyons can give rise to an emergent geometry resembling Anti-de Sitter (AdS) space. We analyze the entanglement structure of fractionalized anyons using mutual information and interpret the results within this emergent geometric framework. As a concrete example, we consider pairs of $e/2$-charged semions that arise from instanton configurations in a disordered zigzag graphene nanoribbon. These fractional charges, located on opposite zigzag edges, show long-range quantum entanglement despite being spatially separated. We analyze the scale dependence of their entanglement and embed the ribbon into an AdS-like bulk geometry. In this setup, the entanglement structure defines minimal surfaces in the bulk, providing a geometric view of the edge correlations. This gives a holographic picture of fractionalized degrees of freedom in quasi-one-dimensional systems and shows how quantum entanglement can generate emergent geometry even without conformal symmetry.",
      "pdf_url": "https://arxiv.org/pdf/2512.15256.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    }
  ]
}