{
  "date": "2026-01-27",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 27,
  "gw_related_papers": 5,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2601.16227",
      "title": "Bayesian Inference of Neutron Star Properties in $f(Q)$ Gravity Using NICER Observations",
      "authors": [
        "Sneha Pradhan",
        "N. K. Patra",
        "Kai Zhou",
        "P. K. Sahoo"
      ],
      "abstract": "Bayesian Inference of Neutron Star Properties in $f(Q)$ Gravity Using NICER Observations Sneha Pradhan, N. K. Patra, Kai Zhou, P. K. Sahoo General Relativity and Quantum Cosmology (gr-qc) In this work, we investigate neutron stars (NSs) in the strong field regime within the framework of symmetric teleparallel $f(Q)$ gravity, considering three representative models: linear, logarithmic, and exponential. While Bayesian studies of NS observations are well established in General Relativity and curvature based modified gravity theories, such analyses in $f(Q)$ gravity remain largely unexplored. We perform a Bayesian inference analysis by confronting theoretical NS mass-radius predictions with NICER observations of PSR J0030+0451, PSR J0740+6620, PSR J0437+4715, and PSR J0614+3329. The dense matter equation of state is fixed to DDME2 in order to isolate the effects of modified gravity on NS structure. Our results show that the exponential $f(Q)$ model is statistically preferred over the linear and logarithmic cases, as confirmed by Bayes factor comparisons, and exhibits well-constrained. For this model, we obtain a radius and tidal deformability at $1.4\\,M_\\odot$ of $R_{1.4} = 11.27^{+0.53}_{-0.36}\\,\\mathrm{km}$ and $\\Lambda_{1.4} = 156.95^{+84.02}_{-41.73}$, respectively, consistent with current observational constraints. These results highlight the potential of NSs as powerful probes of symmetric teleparallel gravity in the strong field regime.",
      "pdf_url": "https://arxiv.org/pdf/2601.16227.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16254",
      "title": "Static hairy black hole in 4D General Relativity",
      "authors": [
        "Marco Astorino"
      ],
      "abstract": "Static hairy black hole in 4D General Relativity Marco Astorino 12 pages, 1 figure, journal version Phys. Rev. D 113, 024047 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In four-dimensional vacuum general relativity the only known static, exact and analytical black hole solution is given by the Schwarzschild spacetime. In this paper this renowned metric is generalised by adding another integrating constant, a hair that switches the metric from the Petrov type D to the type I. This new parameter represents the intensity of an external gravitational field, which can be considered the hyperbolic generalisation of the Witten's bubble of nothing. No curvature or conical singularities are present outside the event horizon. The no hair arguments are circumvented because the metric is not asymptotically flat, and neither the black hole is spherical. The gravitational hair continuously deforms the Schwarzschild geometry: the horizon becomes oblate, while its area is reduced. Conserved charges and thermodynamic properties of the black hole are studied.",
      "pdf_url": "https://arxiv.org/pdf/2601.16254.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16305",
      "title": "Light propagation and quasinormal modes of a topologically charged Schwarzschild-Klinkhamer wormhole",
      "authors": [
        "C. F. S. Pereira",
        "H. Belich",
        "A. R. Soares",
        "Marcos V. de S. Silva",
        "R. L. L. Vitória",
        "A. A. Araújo Filho"
      ],
      "abstract": "Light propagation and quasinormal modes of a topologically charged Schwarzschild-Klinkhamer wormhole C. F. S. Pereira, H. Belich, A. R. Soares, Marcos V. de S. Silva, R. L. L. Vitória, A. A. Araújo Filho 42 pages, 12 figures and 5 tables. Suggestions/Comments are welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we present a theoretical analysis of null geodesics, critical photon orbits, and shadow formation associated with a wormhole generated by a geometric defect. The propagation of light in this spacetime is examined through the deflection angle in both weak- and strong-field regimes. Analytical expansions are derived in each regime and employed to characterize gravitational lensing observables. By varying the global monopole charge, we evaluate its impact on these observables and determine parameter ranges that may be accessible to current or future observational probes. Finally, we calculate the quasinormal modes as well as the time-domain solution for scalar perturbations as well.",
      "pdf_url": "https://arxiv.org/pdf/2601.16305.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16325",
      "title": "Does Gravity Care About Electric Charge? A Minimalist Model and Experimental Test",
      "authors": [
        "Renato Vieira dos Santos"
      ],
      "abstract": "Does Gravity Care About Electric Charge? A Minimalist Model and Experimental Test Renato Vieira dos Santos General Relativity and Quantum Cosmology (gr-qc); Other Condensed Matter (cond-mat.other); Classical Physics (physics.class-ph) Does gravity care about electric charge? Precision tests of the weak equivalence principle achieve remarkable sensitivity but deliberately minimize electric charge on test masses, leaving this fundamental question experimentally open. We present a minimalist framework coupling electromagnetism to linearized gravity through conservation of a complex charge-mass current, predicting charge-dependent violations $\\Delta a/g = \\kappa(q/m)$. Remarkably, this prediction occupies unexplored experimental territory precisely because precision gravity tests avoid charge variation. We identify this as a significant gap and propose a modified torsion balance experiment where $q/m$ is treated as a controlled variable. Such an experiment could test whether gravitational acceleration depends on electric charge, probing physics in genuinely new parameter space. This work exemplifies how theoretical minimalism can reveal overlooked opportunities in fundamental physics.",
      "pdf_url": "https://arxiv.org/pdf/2601.16325.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16567",
      "title": "Thick Lunar Crust Amplifies Gravitational-Wave Signal",
      "authors": [
        "Lei Zhang",
        "Han Yan",
        "Xian Chen",
        "Jinhai Zhang"
      ],
      "abstract": "Thick Lunar Crust Amplifies Gravitational-Wave Signal Lei Zhang, Han Yan, Xian Chen, Jinhai Zhang General Relativity and Quantum Cosmology (gr-qc); Earth and Planetary Astrophysics (astro-ph.EP); High Energy Astrophysical Phenomena (astro-ph.HE); Geophysics (physics.geo-ph) Gravitational waves (GWs) in the $10^{-3}-0.1$ Hz band encode unique signatures of the early universe and merging compact objects, but they are beyond the reach of existing observatories. Theoretical models suggest that the Moon could act as a resonant detector, but the unknown influence of its rugged surface and heterogeneous interior has cast doubt on this prospect. Here, we resolve this long-standing uncertainty by constructing the first high-resolution, structurally realistic model of the lunar GW response. We achieve this by combining high-fidelity spectral-element simulations with the analytical power of normal-mode perturbation theory, thereby resolving topographical effects down to $3.7$ km grid spacing while maintaining the capacity to discern global free-oscillation patterns. This dual-methodology approach not only recovers the expected predominant quadrupole ($l=2$) oscillation mode, but also exposes a systematic signal amplification of $(10-20)\\%$ in thick-crust regions. This enhancement is traced by our normal-mode analysis to a mode-coupling process, in which the original quadrupolar oscillation induced by the passing GWs distributes energy into a series of higher-order modes, the hybridized eigenmodes of the laterally heterogeneous Moon. Near certain eigen-frequencies and at specific locations, we observe up to tenfold amplification, highlighting the power of numerical simulations in resolving these structurally fine-tuned features. Our work establishes the Moon as an accurately calibrated resonant GW detector, and the resulting amplification maps provide quantitative guide for the optimal landing site selection.",
      "pdf_url": "https://arxiv.org/pdf/2601.16567.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.EP",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.16572",
      "title": "Gravitational Lensing Effect from The Revised Deser-Woodard Nonlocal Gravity",
      "authors": [
        "Haida Li",
        "Xiangdong Zhang"
      ],
      "abstract": "Gravitational Lensing Effect from The Revised Deser-Woodard Nonlocal Gravity Haida Li, Xiangdong Zhang General Relativity and Quantum Cosmology (gr-qc) We investigate the gravitational lensing effects of a static spherically symmetric black hole (BH) within the framework of the revised Deser-Woodard (D-W) nonlocal gravity. By analyzing the deflection angle in both the weak and strong field limits, we derive several distinguishing features of the model. In the weak field limit, we report a leading-order correction to the deflection angle directly attributed to the non-local nature of the theory. In the strong field limit, we find that the lensing corrections are almost linearly dependent on the coupling parameter $\\zeta$ while being exponentially suppressed by the exponent parameter $n$. Furthermore, the gravitational lensing effect in the revised D-W model at a given time shares similar scale-invariant behavior to General Relativity and conformal gravity, offering a potential pathway to distinguish it from other alternatives using astronomical observations.",
      "pdf_url": "https://arxiv.org/pdf/2601.16572.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16703",
      "title": "Dirac-Bergmann algorithm and canonical quantization of $k$-essence cosmology",
      "authors": [
        "Andrés Lueiza",
        "Andronikos Paliathanasis",
        "Nikolaos Dimakis"
      ],
      "abstract": "Dirac-Bergmann algorithm and canonical quantization of $k$-essence cosmology Andrés Lueiza, Andronikos Paliathanasis, Nikolaos Dimakis 17 pages, 4 figures, Latex2e source file General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) We develop a general canonical quantization scheme for $k$-essence cosmology in scalar-tensor theory. Utilizing the Dirac-Bergmann algorithm, we construct the Hamiltonian associated with the cosmological field equations and identify the first- and second-class constraints. The introduction of appropriate canonically conjugate variables with respect to Dirac brackets, allows for the canonical quantization of the model. In these new variables, the Hamiltonian constraint reduces to a quadratic function with no potential term. Its quantum realization leads to a Wheeler-DeWitt equation reminiscent of the massless Klein-Gordon case. As an illustrative example, we consider the action of a tachyonic field and investigate the conditions under which a phantom crossing can occur as a quantum tunneling effect. For the simplified constant potential case, we investigate the consequences of different boundary conditions on the singularity avoidance and to the mean expansion rate.",
      "pdf_url": "https://arxiv.org/pdf/2601.16703.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16706",
      "title": "Ricci-Weyl curvature balance in viscous dissipative collapse: A covariant analysis of singularity censorship",
      "authors": [
        "Samarjit Chakraborty",
        "Rituparno Goswami",
        "Sunil D. Maharaj",
        "Gareth Amery"
      ],
      "abstract": "Ricci-Weyl curvature balance in viscous dissipative collapse: A covariant analysis of singularity censorship Samarjit Chakraborty, Rituparno Goswami, Sunil D. Maharaj, Gareth Amery General Relativity and Quantum Cosmology (gr-qc) We investigate the cosmic censorship conjecture in a spherically symmetric collapse with shear and bulk viscosity, heat flux, and pressure anisotropy, imposing physically reasonable energy conditions. Using the semi-tetrad covariant formalism, we derive the dynamics of the collapsing fluid, including a master equation for the evolution of the Weyl curvature, to examine the role of viscosity. The analysis of null geodesic geometry uncovers a novel curvature-balance mechanism between Ricci (matter) and Weyl (free gravitational field) curvature on the apparent horizon; this balance determines the causal nature of the horizon and thereby governs the visibility of the singularity. We then derive necessary and sufficient covariant conditions for the central singularity to be locally naked. Our findings support a weaker form of cosmic censorship and extend the covariant censorship analysis to realistic dissipative, viscous collapse.",
      "pdf_url": "https://arxiv.org/pdf/2601.16706.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16887",
      "title": "General orbital perturbation theory in Schwarzschild space-time",
      "authors": [
        "Oleksii Yanchyshen",
        "Eva Hackmann",
        "Claus Lämmerzahl"
      ],
      "abstract": "General orbital perturbation theory in Schwarzschild space-time Oleksii Yanchyshen, Eva Hackmann, Claus Lämmerzahl General Relativity and Quantum Cosmology (gr-qc) We derive general relativistic Gaussian equations for osculating elements for orbits under the influence of a perturbing force without any restrictions in an underlying Schwarzschild space-time. Such a formulation provides a way to describe the evolution of orbital parameters in strong gravity relativistic settings. As examples of external forces we considered Kerr and $q$-metric space-times generated forces, for which we solve equations for osculating elements in linear approximation. For the Kerr space-time in the post-Newtonian limit, our result reproduces the well-known Lense--Thirring precession of the longitude of the ascending node.",
      "pdf_url": "https://arxiv.org/pdf/2601.16887.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16958",
      "title": "Anisotropy Strikes Back: Modified Gravity and Dark Matter Halos",
      "authors": [
        "Paolo M Bassani"
      ],
      "abstract": "Anisotropy Strikes Back: Modified Gravity and Dark Matter Halos Paolo M Bassani General Relativity and Quantum Cosmology (gr-qc); Astrophysics of Galaxies (astro-ph.GA) We explore dark matter like fluids in a spherically symmetric Lemaitre Tolman Bondi (LTB) minisuperspace, tracking how symmetry properties of the Hamiltonian constraint control the emergence of effective dark sources in General Relativity (GR) and Horava Lifshitz (HL) gravity. We first deform the GR Hamiltonian by adding an extra weight $+1$ density to the potential. We show that potential deformations of this type leave the (reduced) Dirac algebra unchanged and the modification is naturally reinterpreted as an effective anisotropic stress energy contribution. While the fluid reproduces an isothermal-like mass scaling, its pressure anisotropy prevents it from giving flat rotation curves. We then turn to HL gravity, where the deformed Dirac algebra induces a controlled nonconservation law for an emergent dust component. Generalizing earlier results, we identify a restricted class of LTB backgrounds for which the HL source term yields a positive scaling dark matter density, consistent with ghost-freedom, and recovery of GR in the infrared. The analysis is conditional on a prescribed background: obtaining a fully backreacted areal radius solution consistent with the HL field equations is left as a natural direction for future work.",
      "pdf_url": "https://arxiv.org/pdf/2601.16958.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.GA"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16969",
      "title": "Embedding Wormholes and Dyonic Black Strings in Warped Braneworlds via Local Sum Rules",
      "authors": [
        "G. Alencar",
        "T. M. Crispim",
        "Francisco S. N. Lobo"
      ],
      "abstract": "Embedding Wormholes and Dyonic Black Strings in Warped Braneworlds via Local Sum Rules G. Alencar, T. M. Crispim, Francisco S. N. Lobo General Relativity and Quantum Cosmology (gr-qc) Building on our previous work [1], where the Local Sum Rules (LSR) were established, we investigate the construction of compact objects in Randall-Sundrum braneworlds supported by matter fields that are dynamically consistent and localizable. We begin by revisiting the Chamblin et al. black string, highlighting its role as a foundational higher-dimensional solution. We then show that the Ellis-Bronnikov wormhole can be consistently embedded in this framework via a localized free scalar field, providing a simple yet nontrivial example of a braneworld compact object. Finally, we derive two novel black string solutions sourced by a localized nonlinear electrodynamics (NED) theory with Lagrangian $\\mathcal{L}(\\mathcal{F}) = -\\beta \\sqrt{\\mathcal{F}}$, corresponding to purely magnetic and dyonic configurations. The purely magnetic solution reproduces the classical Letelier string cloud on the brane, while the dyonic solution generalizes it to include electric charge, closely paralleling the Letelier-Alencar construction. Both NED solutions reduce smoothly to the Chamblin et al. black string in the limit $\\beta \\to 0$, illustrating how localized higher-dimensional matter fields can consistently support braneworld compact objects and connect higher-dimensional physics with well-known four-dimensional solutions.",
      "pdf_url": "https://arxiv.org/pdf/2601.16969.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.16246",
      "title": "Recovering Einstein Mature View of Gravitation: A Dynamical Reconstruction Grounded in the Equivalence Principle",
      "authors": [
        "Jaume de Haro",
        "Emilio Elizalde"
      ],
      "abstract": "Recovering Einstein Mature View of Gravitation: A Dynamical Reconstruction Grounded in the Equivalence Principle Jaume de Haro, Emilio Elizalde Version accepted for publication in AppiedMath History and Philosophy of Physics (physics.hist-ph); General Relativity and Quantum Cosmology (gr-qc) The historical and conceptual foundations of General Relativity are revisited, putting the main focus on the physical meaning of the invariant ds, the Equivalence Principle, and the precise interpretation of spacetime geometry. It is argued that Albert Einstein initially sought a dynamical formulation in which ds encoded the gravitational effects, without invoking curvature as a physical entity. The now more familiar geometrical interpretation (identifying gravitation with spacetime curvature) gradually emerged through his collaboration with Marcel Grossmann and the adoption of the Ricci tensor in 1915. Anyhow, in his 1920 Leiden lecture, Einstein explicitly reinterpreted spacetime geometry as the state of a physical medium (an ether endowed with metrical properties but devoid of mechanical substance) thereby actually rejecting geometry as an independent ontological reality. Building upon this mature view, gravitation is reconstructed from the Weak Equivalence Principle, understood as the exact compensation between inertial and gravitational forces acting on a body under a uniform gravitational field. From this fundamental principle, together with an extension of Fermat Principle to massive objects, the invariant ds is obtained, first in the static case, where the gravitational potential modifies the flow of proper time. Then, by applying the Lorentz transformation to this static invariant, its general form is derived for the case of matter in motion. The resulting invariant reproduces the relativistic form of Newton second law in proper time and coincides with the weak field limit of General Relativity in the harmonic gauge.",
      "pdf_url": "https://arxiv.org/pdf/2601.16246.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2405.13109",
      "title": "LISA double white dwarf binaries as Galactic accelerometers",
      "authors": [
        "Reza Ebadi",
        "Vladimir Strokov",
        "Erwin H. Tanin",
        "Emanuele Berti",
        "Ronald L. Walsworth"
      ],
      "abstract": "LISA double white dwarf binaries as Galactic accelerometers Reza Ebadi, Vladimir Strokov, Erwin H. Tanin, Emanuele Berti, Ronald L. Walsworth Published version. 20 pages, 7 figures Phys.Rev.D 111 (2025) 4, 044023 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA); High Energy Physics - Phenomenology (hep-ph) Galactic double white dwarf (DWD) binaries are among the guaranteed sources for the Laser Interferometer Space Antenna (LISA), an upcoming space-based gravitational wave (GW) detector. Most DWDs in the LISA band are far from merging and emit quasimonochromatic GWs. As these sources are distributed throughout the Milky Way, they experience different accelerations in the Galactic gravitational potential, and therefore each DWD exhibits an apparent GW frequency chirp due to differential acceleration between the source and LISA. We examine how Galactic acceleration influences parameter estimation for these sources; and investigate how LISA observations could provide insight into the distribution of matter in the Galaxy.",
      "pdf_url": "https://arxiv.org/pdf/2405.13109.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.GA",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.10291",
      "title": "Density perturbations in nonminimally coupled gravity: symptoms of Lagrangian density ambiguity",
      "authors": [
        "Miguel Barroso Varela",
        "Orfeu Bertolami"
      ],
      "abstract": "Density perturbations in nonminimally coupled gravity: symptoms of Lagrangian density ambiguity Miguel Barroso Varela, Orfeu Bertolami 25 pages, 2 figures, Matches published version in JCAP General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) The evolution of density perturbations is analysed in a modified theory of gravity with a nonminimal coupling between curvature and matter. We consider the broken degeneracy between the choices of matter Lagrangian for a perfect fluid, $\\mathcal{L}_m=-\\rho$ and $\\mathcal{L}_m=p$, and determine the differences between their effects on the effective gravitational constant. We review the result for $\\mathcal{L}_m=-\\rho$ in the quasistatic approximation and show how it can lead to unphysical singular behaviour for late-time dominating models. This divergent regime can be avoided when considering the fully non-quasistatic perturbative equations, although the higher-order nature of the nonminimally coupled theory and the requirement of a physically viable effective gravitational constant strongly constrains the magnitude of these modifications to the action. We find that both of these issues can be removed when considering $\\mathcal{L}_m=p$ at late times due to the pressureless nature of non-relativistic matter and provide predictions for inverse power-law models.",
      "pdf_url": "https://arxiv.org/pdf/2505.10291.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.15096",
      "title": "Dynamical model for black hole to white hole transitions",
      "authors": [
        "Samantha Hergott",
        "Viqar Husain",
        "Saeed Rastgoo"
      ],
      "abstract": "Dynamical model for black hole to white hole transitions Samantha Hergott, Viqar Husain, Saeed Rastgoo General Relativity and Quantum Cosmology (gr-qc) We present an asymptotically flat spherically symmetric non-singular metric that describes gravitational collapse and matter bounce with transient black hole and white hole regions. The metric provides a dynamical counterpart to proposed static non-singular black holes, and a phenomenological model for possible black hole to white hole transitions in quantum gravity.",
      "pdf_url": "https://arxiv.org/pdf/2505.15096.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.07305",
      "title": "Hamiltonian equations of motion of quadratic gravity",
      "authors": [
        "Jorge Bellorin"
      ],
      "abstract": "Hamiltonian equations of motion of quadratic gravity Jorge Bellorin General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We compute explicitly the equations of motion of the Hamiltonian formulation of quadratic gravity. This is the theory with the most general Lagrangian with terms of quadratic order in the curvature tensor. We employ the symbolic computational tool Cadabra. We present the linearized version of the equations of motion, performing the longitudinal-transverse decomposition. We compare the linear equations with the covariant field equations, finding that, if general-relativity terms are active, the linear Hamiltonian formulation is valid only if the perturbative spatial metric is traceless, a condition that can be freely imposed by recurring to an arbitrary function. We apply the equations of motion on homogeneous and isotropic configurations, finding explicit solutions.",
      "pdf_url": "https://arxiv.org/pdf/2506.07305.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21381",
      "title": "The impact of plunging matter on black-hole waveform",
      "authors": [
        "Ying-Lei Tian",
        "Hao Yang",
        "Chen Lan",
        "Yan-Gang Miao"
      ],
      "abstract": "The impact of plunging matter on black-hole waveform Ying-Lei Tian, Hao Yang, Chen Lan, Yan-Gang Miao SCIENCE CHINA Physics, Mechanics & Astronomy Volume 69, Issue 3: 230413 (2026) General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we introduce a novel framework to investigate ringdown gravitational waveforms in the presence of dynamical matter fields outside the horizon of a black hole. We systematically analyze two distinct scenarios of dynamical matter fields: motion along geodesics and uniform motion with constant velocity. Our results reveal rich phenomenology in the ringdown gravitational wave signals, including the suppression or enhancement of echoes, frequency shifts in the decay oscillations, and intricate modulations of the power-law tails. Notably, we demonstrate that subluminal moving potentials can produce irregular echo patterns and shift the dominant frequencies, offering potential new observational signatures beyond the already-known ringdown analyses. This study provides a new perspective for probing dynamic environments around black holes and offers a theoretical foundation for interpreting possible deviations in future gravitational wave detections.",
      "pdf_url": "https://arxiv.org/pdf/2508.21381.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.05021",
      "title": "Big-Bounce in Quantum f(R)-Cosmology: Polymer Dynamics with Internal Time",
      "authors": [
        "M. L. Limongi",
        "S. Lo Franco",
        "G. Montani",
        "S. Segreto"
      ],
      "abstract": "Big-Bounce in Quantum f(R)-Cosmology: Polymer Dynamics with Internal Time M. L. Limongi, S. Lo Franco, G. Montani, S. Segreto General Relativity and Quantum Cosmology (gr-qc) We construct the Hamiltonian formulation of the isotropic Universe in a generic metric f(R)-theory in the Jordan frame. We canonically quantize the Universe volume via a polymer formulation, and we adopt the scalar field naturally arising from this scenario as a physical clock. Being within the limit of cut-off values of the space volume, we are legitimized to neglect, at first approximation level, the self-interacting potential term associated with the scalar field. We first study the semi-classical polymer dynamics, outlining the emergence of a bouncing cosmology, both in the internal as well as in the synchronous time. In this latter time variable, we are also able to compare the obtained picture with that of a standard polymer Big-Bounce. We see that in the studied case, the collapsing and expanding branches are no longer symmetric with respect to the minimum volume configuration. Then, we fully quantize the system dynamics in the momentum representation, constructing a suitable dynamical Hilbert space and setting up the dynamics of localized wave packets. The mean value dynamics, both for the momentum and volume spaces, is characterized by a bouncing dynamics as described via the internal time, which closely resembles that one obtained in Loop Quantum Cosmology and Polymerization, respectively.",
      "pdf_url": "https://arxiv.org/pdf/2509.05021.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07715",
      "title": "K-nonizing",
      "authors": [
        "Jose Beltrán Jiménez",
        "Teodor Borislavov Vasilev",
        "Darío Jaramillo-Garrido",
        "Antonio L. Maroto",
        "Prado Martín-Moruno"
      ],
      "abstract": "Jose Beltrán Jiménez, Teodor Borislavov Vasilev, Darío Jaramillo-Garrido, Antonio L. Maroto, Prado Martín-Moruno V2: matches version published in PLB. V1: 7 pages, 1 figure Phys. Lett. B 872 (2026), 140118 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We unveil the dynamical equivalence of field theories with non-canonical kinetic terms and canonical theories with a volume element invariant under transverse diffeomorphisms. The proof of the equivalence also reveals a subtle connection between the standard Legendre transformation and the so-called Clairaut equation. Explicit examples of canonizable theories include classes of $k$-essence, non-linear electrodynamics, or $f(R)$ theories. The equivalence can also be extended to the class of mimetic theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.07715.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19359",
      "title": "Imprints of Topological Thermodynamics on Black Hole Dynamics",
      "authors": [
        "Yue Chu",
        "Chen-Hao Wu",
        "Ya-Peng Hu"
      ],
      "abstract": "Imprints of Topological Thermodynamics on Black Hole Dynamics Yue Chu, Chen-Hao Wu, Ya-Peng Hu Phys. Lett. B 844 (2026) 140192 General Relativity and Quantum Cosmology (gr-qc) By employing Duan's topological method, we classify critical points by their topological charge Q = +/-1 or 0. Previous work (Wei et al., Phys. Rev. D 105, 104003, 2022) investigated two typical anti-de Sitter (AdS) black holes: the Reissner-Nordstroem (RN) case (with only one critical point Q = -1) and the Born-Infeld (BI) case (with two critical points Q = +/-1). In this work, we first find that all three types of critical points appear in quantum anomalous black holes for 4D spacetime. We then compute the quasinormal modes of massless scalar perturbations near these critical points and find that both the oscillation frequency and damping rate increase with the black hole radius at the critical temperature. Besides such common behavior, although the Q = +1 and Q = 0 cases do not show a discernible pattern due to the limited number of samples, the Q = -1 case exhibits very similar dynamical characteristics across all three black hole solutions, implying a nontrivial connection between topological thermodynamics and dynamics.",
      "pdf_url": "https://arxiv.org/pdf/2510.19359.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.19699",
      "title": "Effects of dynamical capture on two equal-mass nonspinning black holes",
      "authors": [
        "Jorge L. Rodríguez-Monteverde",
        "Santiago Jaraba",
        "Juan García-Bellido"
      ],
      "abstract": "Effects of dynamical capture on two equal-mass nonspinning black holes Jorge L. Rodríguez-Monteverde, Santiago Jaraba, Juan García-Bellido 18 pages, 13 figures and 4 tables. Changes match published version Physical Review D 113 (2026) 024052 General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) Dynamical captures of black holes are unique events that provide an exceptional opportunity to probe the strong-field regime of gravitational physics. In this article, we perform numerical relativity simulations to study the events of dynamical capture of two equal-mass nonspinning black holes. We consider a suite of scenarios within a range of initial linear momenta ($p/M=0.095-0.75$) and incidence angles ($\\theta=6.36^\\circ-2.83^\\circ$), and study the emitted Weyl scalar ($\\Psi_4$) of each case, as well as the spins and masses of the black holes before and after they merge. We provide a simple analytical model which accurately fits the gravitational-wave emission. We study the dependence of the time interval between the capture and the merger emissions with respect to the incidence angle, which can be well parametrized by a first-order divergent behavior, allowing us to find the angle that separates a scattering event from a dynamical capture. We also find that, in general, the parameters that model the first emission can be well described by linear or exponentially decaying functions in terms of the incidence angle, while others display more complex behaviors that offer valuable insights into the nature of these events.",
      "pdf_url": "https://arxiv.org/pdf/2510.19699.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.03066",
      "title": "Dark matter halo as a source of regular black-hole geometries",
      "authors": [
        "R. A. Konoplya",
        "A. Zhidenko"
      ],
      "abstract": "Dark matter halo as a source of regular black-hole geometries R. A. Konoplya, A. Zhidenko 11 pages, 4 figures, accepted for publication in Physical Review D General Relativity and Quantum Cosmology (gr-qc) We construct exact black hole solutions free of curvature singularities, sourced by dark matter halos described by galactic density profiles. Regularity of the geometry is ensured by adopting the relation $P_{r}=-\\rho$ between radial pressure and density, which is consistent with the phenomenological freedom of halo models. Under the assumptions of regularity and the weak-energy condition, sufficiently dense dark matter halos can give rise to asymptotically flat, singularity-free black holes embedded in a galactic environment. These regular black holes are shown to be stable under axial perturbations. In particular, we obtain solutions corresponding to Einasto and Dehnen-type dark matter profiles. We further compute the shadow radii and Lyapunov exponents associated with photon circular orbits around these black holes.",
      "pdf_url": "https://arxiv.org/pdf/2511.03066.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.10008",
      "title": "Formation of extremal Reissner-Nordström black holes: insights from numerics",
      "authors": [
        "Maxime Gadioux",
        "Harvey S. Reall",
        "Jorge E. Santos"
      ],
      "abstract": "Formation of extremal Reissner-Nordström black holes: insights from numerics Maxime Gadioux, Harvey S. Reall, Jorge E. Santos 23 pages, 13 figures. v2: Numerical results corrected; new discussion of superextremal horizons General Relativity and Quantum Cosmology (gr-qc) An extremal Reissner-Nordström black hole can form in finite time in the gravitational collapse of a massless charged scalar field. The proof of this is based on the method of characteristic gluing, which involves making an Ansatz for the scalar field at the horizon. We perform a numerical investigation of the characteristic gluing procedure for several different Ansätze. In each case, gluing is possible only if the final black hole mass is large enough. We find that the minimum required mass varies significantly for different Ansätze. We also consider the effect of including a mass term for the scalar field. In this case, for each Ansatz we determine the maximum mass-to-charge ratio for the scalar field such that gluing is possible. Analogous results are obtained for a non-zero cosmological constant.",
      "pdf_url": "https://arxiv.org/pdf/2512.10008.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23783",
      "title": "Comment on \"Regular magnetically charged black holes from nonlinear electrodynamics: Thermodynamics, light deflection, and orbital dynamics\" by Aydiner, Sucu and Sakalli",
      "authors": [
        "Zhuang Li"
      ],
      "abstract": "Comment on \"Regular magnetically charged black holes from nonlinear electrodynamics: Thermodynamics, light deflection, and orbital dynamics\" by Aydiner, Sucu and Sakalli Zhuang Li arXiv admin note: This paper has been withdrawn by arXiv due to unverifiable authorship and affiliation General Relativity and Quantum Cosmology (gr-qc) We analyze the recent article by Aydiner, Sucu, and Sakalli [Phys.\\ Dark Univ.\\ \\textbf{50}, 102164 (2025)] [arXiv:2507.05145], which investigates the thermodynamics, tunneling kinetics, and weak-lensing signatures of a regular, magnetically charged nonlinear-electrodynamics black hole. While the study addresses interesting phenomenological questions, we identify several inconsistencies that compromise the validity of the reported results. Specifically, we note mutually contradictory values for the extremal charge separating the black hole and horizonless regimes, an inaccurate characterization of the Schwarzschild limit as an extremal configuration, a vacuum weak-deflection expansion that fails to recover the standard second-order Schwarzschild coefficient, and a sign error in the generalized uncertainty principle (GUP) corrected tunneling probability. We also highlight terminology regarding the nature of the horizonless solution and the physical interpretation of plasma parameters that requires correction. We clarify these points to ensure the robustness of the model's asymptotic limits.",
      "pdf_url": "https://arxiv.org/pdf/2512.23783.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.23838",
      "title": "Thermodynamic stability in an Einstein universe",
      "authors": [
        "E. S. Moreira Jr.",
        "J. P. A. Paula"
      ],
      "abstract": "Thermodynamic stability in an Einstein universe E. S. Moreira Jr., J. P. A. Paula General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We calculate the Feynman propagator at finite temperature in an Einstein universe for a neutral massive scalar field arbitrarily coupled to the Ricci curvature. Then, the propagator is used to determine the mean square fluctuation, the internal energy, and pressure of a scalar blackbody radiation as functions of the curvature coupling parameter $\\xi$. By studying thermodynamics of massless scalar fields, we show that the only value of $\\xi$ consistent with stable thermodynamic equilibrium at all temperatures and for all radii of the universe is $1/6$, i.e., corresponding to the conformal coupling. Moreover, if electromagnetic and neutrino radiations are present at the regime of high temperatures and/or large radii, we show that at least one scalar field must also be present to ensure thermodynamic stability.",
      "pdf_url": "https://arxiv.org/pdf/2512.23838.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2601.00550",
      "title": "Taxonomy of periodic orbits and gravitational waves in a deformed Schwarzschild black hole spacetime",
      "authors": [
        "Zhutong Hua",
        "Zhen-Tao He",
        "Jiageng Jiao",
        "Jing-Qi Lai",
        "Yu Tian"
      ],
      "abstract": "Taxonomy of periodic orbits and gravitational waves in a deformed Schwarzschild black hole spacetime Zhutong Hua, Zhen-Tao He, Jiageng Jiao, Jing-Qi Lai, Yu Tian 19pages, 8 figures, v3: references added, content modified General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) In this paper, we investigate periodic orbits of test particles around a deformed Schwarzschild black hole and the resulting gravitational waves. Firstly, we examine the properties of circular orbits and find that circular orbits could disappear when the deformation is large enough. Then, using an orbital taxonomy, we characterize various periodic orbits with a set of triples, which describes the zoom-whirl behaviours. We also calculate the gravitational waveform signals generated by different periodic orbits, revealing the influence of the deformation on the gravitational wave, which can be potentially picked up by future space-based detectors.",
      "pdf_url": "https://arxiv.org/pdf/2601.00550.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2601.15226",
      "title": "Exact general solutions for cosmological scalar field evolution in a vacuum-energy dominated expansion",
      "authors": [
        "Patrick Hu",
        "Robert J. Scherrer"
      ],
      "abstract": "Exact general solutions for cosmological scalar field evolution in a vacuum-energy dominated expansion Patrick Hu, Robert J. Scherrer 8 pages, no figures, references added General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) We derive exact general solutions (as opposed to attractor particular solutions) for the evolution of a scalar field $\\phi$ in a universe dominated by a background fluid with equation of state parameter $w_B = -1$, extending earlier work on exact solutions with $w_B > -1$. Straightfoward exact solutions exist when the evolution is described by a linear differential equation, corresponding to constant, linear, and quadratic potentials. In the nonlinear case, exact solutions are derived for $V = V_0\\ln \\phi$, $V = V_0 \\phi^{1/2}$ and $V = V_0/\\phi$, and the logarithmic potential also yields an exact first integral. These complicated parametric solutions are considerably less useful than those derived previously for a universe dominated by a barotropic fluid such as matter or radiation with $w_B > -1$. However, we generalize the slow-roll approximation and show that it applies to all sufficiently flat potentials in the case of a vacuum-dominated expansion, while it never applies when the universe is dominated by a background fluid with $w_B > -1$.",
      "pdf_url": "https://arxiv.org/pdf/2601.15226.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    }
  ]
}