{
  "date": "2025-12-17",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 54,
  "gw_related_papers": 15,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2512.11885",
      "title": "Dynamical Systems Analysis of an Einstein-Cartan Ekpyrotic Nonsingular Bounce Cosmology",
      "authors": [
        "Jackson Stingley"
      ],
      "abstract": "Dynamical Systems Analysis of an Einstein-Cartan Ekpyrotic Nonsingular Bounce Cosmology Jackson Stingley 25 pages, 10 figures. Submitted to General Relativity and Gravitation General Relativity and Quantum Cosmology (gr-qc) I construct an Einstein-Cartan ekpyrotic model (ECEM): a homogeneous, nearly Friedmann-Lemaître-Robertson-Walker (FLRW) background in Einstein-Cartan (EC) gravity whose spin-torsion sector, modeled phenomenologically as a Weyssenhoff fluid with stiff scaling $\\propto a^{-6}$, is coupled to a scalar field with a steep exponential potential that interpolates between a negative ekpyrotic branch and a positive plateau. Extending the Copeland-Liddle-Wands (CLW) scalar-fluid dynamical system to a six-dimensional phase space including shear, curvature, and spin-torsion, I recast the equations in a compact deceleration-parameter form, compute the full Jacobian, and evaluate maximal Lyapunov exponents. Numerical solutions show that the ekpyrotic branch ($w_\\phi\\gg1$) exponentially damps homogeneous shear, while the softened branch ($w_\\phi<1$) allows $\\rho_s$ to overtake the scalar during contraction and trigger a torsion-supported bounce at high but finite densities where the EC spin-torsion term becomes dynamically dominant. Scans in a two-parameter softening plane $(\\phi_{\\rm b},\\Delta)$ identify a finite region of nonsingular trajectories and quantify the required tuning; in the parameter ranges explored the maximal Lyapunov exponent on the constrained phase space is negative, giving no indication of chaotic behavior in this homogeneous truncation even when the usual curvature mode that destabilizes contracting General Relativity (GR) backgrounds is included. The construction is purely phenomenological and confined to homogeneous backgrounds: it does not address entropy accumulation, the cosmological arrow of time, or a complete cyclic cosmology.",
      "pdf_url": "https://arxiv.org/pdf/2512.11885.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11911",
      "title": "Gravitational radiations from periodic orbits around a black hole in the effective field theory extension of general relativity",
      "authors": [
        "Shuo Lu",
        "Hao-Jie Lin",
        "Tao Zhu",
        "Yu-Xiao Liu",
        "Xin Zhang"
      ],
      "abstract": "Gravitational radiations from periodic orbits around a black hole in the effective field theory extension of general relativity Shuo Lu, Hao-Jie Lin, Tao Zhu, Yu-Xiao Liu, Xin Zhang General Relativity and Quantum Cosmology (gr-qc) The study of periodic orbits in extreme-mass-ratio inspirals is essential for understanding the dynamics of small bodies orbiting supermassive black holes. In this paper, we study the periodic orbits and their corresponding gravitational wave emissions within the framework of an effective field theory-based extension of general relativity (EFTGR), which incorporates higher-order curvature terms into the Einstein-Hilbert action. We start with a brief analysis of the modified black hole spacetime in EFTGR and examine how its parameters influence the dynamics of a massive neutral particle using the Lagrangian formalism. Focusing on the impact of the higher-order curvature terms in EFTGR, we examine the properties of periodic orbits, which are characterized by three topological integers $(z, w, v)$ that uniquely classify their trajectories. By analyzing these orbits within EFTGR, we aim to provide new insights into how strong-field deviations from general relativity may manifest in observable phenomena. We then calculate the gravitational waveforms generated by these periodic orbits, identifying potential observational signatures. Our analysis reveals a direct connection between the zoom-whirl orbital behavior of the small compact object and the gravitational waveforms it emits: higher zoom numbers lead to increasingly intricate waveform substructures. The results contribute to a clearer understanding of the dynamical features of EFTGR and open new avenues for probing black hole properties via gravitational wave detection.",
      "pdf_url": "https://arxiv.org/pdf/2512.11911.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11914",
      "title": "Self-gravitating equilibrium with slow steady flow and the correct form of entropy current",
      "authors": [
        "Shuichi Yokoyama"
      ],
      "abstract": "Self-gravitating equilibrium with slow steady flow and the correct form of entropy current Shuichi Yokoyama General Relativity and Quantum Cosmology (gr-qc); Solar and Stellar Astrophysics (astro-ph.SR); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) A relativistic self-gravitating equilibrium system with spherical symmetry as well as with steady energy flow is investigated perturbatively around the hydrostatic limit, where the radial component of the fluid velocity field $u^\\mu$ is sufficiently small. Each component of vectors and tensors consisting of the system is expanded in different powers, which makes the covariant perturbation approach ineffective. The differential equations to determine the subleading correction of the structure variables are presented. The system retains the current $j^\\mu$ accounting for the steady flow, which contributes to the entropy current $s^\\mu$ in such a general covariant form that $s^\\mu=au^\\mu+ bj^\\mu$ with $a, b$ unknown parametric functions. To determine them, a new condition is proposed. This condition imposes the entropy current to be of an unconventional form $s^\\mu=(s-bj^0)u^\\mu/u^0+ bj^\\mu$, where $s$ is the entropy density. The remaining parameter $b$ is fixed by the current conservation equation. The perturbative analysis shows that $b$ starts with the quadratic order and its leading term is determined explicitly.",
      "pdf_url": "https://arxiv.org/pdf/2512.11914.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.SR",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.11917",
      "title": "Low finesse scattering and spectral drift of gravitational wave echoes",
      "authors": [
        "Han-Wen Hu",
        "Cheng-Jun Fang",
        "Zong-Kuan Guo"
      ],
      "abstract": "Low finesse scattering and spectral drift of gravitational wave echoes Han-Wen Hu, Cheng-Jun Fang, Zong-Kuan Guo General Relativity and Quantum Cosmology (gr-qc) Gravitational wave echoes serve as probes for quantum horizon corrections. While steady-state resonances are assumed in the search of gravitational wave echos, realistic barriers are expected to possess intrinsically low reflectivity. In this work, we investigate this low-finesse limit via time-domain simulations and demonstrate that early-time echoes behave as transient scattered wave packets rather than cavity eigenstates. A central finding is the identification of spectral drift, where the central frequency progressively redshifts. This evolution occurs because high-frequency components dissipate significantly faster than the fundamental mode due to the filtering effect of the potential barrier. To distinguish transient interference from genuine resonance, we establish a physical criterion based on cavity lifetime, identifying a critical reflectivity threshold of approximately $0.37$. Since theoretical models typically operate deep within the overdamped regime below this limit, the resulting signals are spectrally non-stationary. We propose that detection strategies should shift towards dynamic time-frequency tracking to capture these drifting signatures.",
      "pdf_url": "https://arxiv.org/pdf/2512.11917.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.11947",
      "title": "Nonconservative Lie series: post-Newtonian binary dynamics at 2.5PN",
      "authors": [
        "Christopher Aykroyd",
        "Adrien Bourgoin",
        "Christophe Le Poncin-Lafitte"
      ],
      "abstract": "Nonconservative Lie series: post-Newtonian binary dynamics at 2.5PN Christopher Aykroyd, Adrien Bourgoin, Christophe Le Poncin-Lafitte General Relativity and Quantum Cosmology (gr-qc) We present a fully analytical solution to the dynamics of the non-spinning 2.5 post-Newtonian binary problem, accounting for both the long-term (secular) and short-term (oscillatory) temporal behavior, with no restriction on eccentricity. The radiative degrees of freedom are handled within the nonconservative Hamiltonian framework introduced in a companion paper. In this work, we apply the Lie series method to construct a resonant Birkhoff normal-form and the corresponding generator of the radiation-reaction dynamics. The secular piece reconstructs exactly the Peters-Mathews relations for semi-major axis and eccentricity. The oscillatory piece completes the dynamics and is well suited for gravitational wave templates. The procedure we present in this paper can be systematically employed to cast arbitrary nonconservative systems into extended Hamiltonian form so that the Lie method can be applied.",
      "pdf_url": "https://arxiv.org/pdf/2512.11947.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.12015",
      "title": "Born-Infeld signatures in AdS black hole thermodynamics and gravitational lensing",
      "authors": [
        "Ekrem Aydıner",
        "Tekin Dereli",
        "İzzet Sakallı",
        "Erdem Sucu",
        "Ece Seyma Yörük"
      ],
      "abstract": "Born-Infeld signatures in AdS black hole thermodynamics and gravitational lensing Ekrem Aydıner, Tekin Dereli, İzzet Sakallı, Erdem Sucu, Ece Seyma Yörük 28 pages, 9 figures, 2 tables. (Corresponding author: Erdem Sucu erdemsc07@gmail.com) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) We investigate the thermodynamic and optical properties of Einstein-Born-Infeld-Anti-de Sitter (EBI-AdS) black holes (BHs). Our study derives the Hawking temperature using standard surface gravity methods and examines quantum corrections through both the Generalized Uncertainty Principle (GUP) and exponential entropy modifications, showing enhanced thermal radiation and potential remnant formation scenarios. The gravitational redshift analysis separates contributions from mass, cosmological constant, electromagnetic charge, and Born-Infeld (BI) corrections, with the latter scaling as $a^4/r^6$ and thus confined to near-horizon regimes. Using the Gauss-Bonnet theorem, we calculate light deflection angles in both vacuum and plasma environments, demonstrating how dispersive media can either enhance or suppress nonlinear electrodynamic signatures depending on observational configurations. The thermodynamic analysis in extended phase space, where the BH mass corresponds to enthalpy, reveals phase structures with heat capacity transitions between positive and negative values, indicating regions of local stability and instability sensitive to parameter choices. We study BH heat engines operating in rectangular thermodynamic cycles, achieving efficiencies of $\\eta \\sim 0.11$--$0.21$ that reach 30--61\\% of the corresponding Carnot limits, consistent with other AdS BH systems. Comparison with Johnson's analysis confirms that BI corrections to heat engine efficiency are of order $10^{-12}$ for typical parameter ranges, though these effects become appreciable in the strong-field regime where $r_h \\lesssim 1.5$ in Planck units. The plasma deflection analysis reveals frequency-dependent refractive modifications encoded in the plasma parameter, offering additional possible observational channels.",
      "pdf_url": "https://arxiv.org/pdf/2512.12015.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12032",
      "title": "On visible effects in the double Schwarzschild solution",
      "authors": [
        "Eddy de Leon",
        "Joerg Frauendiener",
        "Christian Klein"
      ],
      "abstract": "On visible effects in the double Schwarzschild solution Eddy de Leon, Joerg Frauendiener, Christian Klein General Relativity and Quantum Cosmology (gr-qc) Physical aspects of a static solution to the Einstein equations with two black holes are studied via ray tracing. The exact solution for this double Schwarzschild solution is known in explicit form. The black holes are separated by a singularity called \\emph{Weyl strut}. The effect of this strut on null geodesics is shown to be defocusing in contrast to the focusing effect of the black holes. It is shown that black holes with a large separation essentially lead to similar behavior of the null geodesics as a single black hole, whereas nearby holes display a widely changed behavior due to the Weyl strut.",
      "pdf_url": "https://arxiv.org/pdf/2512.12032.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12242",
      "title": "The macroscopic precession model: describing quasi-periodic oscillations including internal structures of test bodies",
      "authors": [
        "Gabriele Bianchini",
        "Orlando Luongo",
        "Marco Muccino"
      ],
      "abstract": "The macroscopic precession model: describing quasi-periodic oscillations including internal structures of test bodies Gabriele Bianchini, Orlando Luongo, Marco Muccino General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Solar and Stellar Astrophysics (astro-ph.SR) The relativistic precession model (RPM) is widely-considered as a benchmark framework to interpret quasi-periodic oscillations (QPOs), albeit several observational inconsistencies suggest that the model remains incomplete. The RPM ensures \\emph{structureless test particles} and attributes precession to geodesic motion alone. Here, we refine the RPM by incorporating the internal structure of rotating test bodies, while preserving the test particle approximation (TPA), and propose a \\emph{macroscopic precession model} (MPM) by means of the Mathisson-Papapetrou-Dixon (MPD) equations, applied to a Schwarzschild background, which introduces 1) a shift in the Keplerian frequency and 2) an \\emph{effective spin correction} to the radial epicyclic frequency that, once the spin tensor is modeled, reproduces a quasi-Schwarzschild-de Sitter (SdS) correction. We apply the MPM to eight neutron star low mass X-ray binaries (NS-LMXBs), performing Markov chain Monte Carlo (MCMC) fits to twin kHz QPOs and find observational and statistical evidence in favor of precise power law spin reconstructions. Further, our model accurately predicts the $3:2$ frequency clustering, the disk boundaries and the NS masses. From the MPM model, we thus conclude that complexity of QPOs can be fully-described including the test particle internal structure.",
      "pdf_url": "https://arxiv.org/pdf/2512.12242.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12271",
      "title": "Geodesic structure of spacetime near singularities",
      "authors": [
        "Mayank",
        "Dawood Kothawala"
      ],
      "abstract": "Geodesic structure of spacetime near singularities Mayank, Dawood Kothawala General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph) Geodesic flows emanating from an arbitrary point $\\mathscr{P}$ in a manifold $\\mathscr{M}$ carry important information about the geometric properties of $\\mathscr{M}$. These flows are characterized by Synge's world function and van Vleck determinant - important bi-scalars that also characterize quantum description of physical systems in $\\mathscr{M}$. If $\\mathscr{P}$ is a regular point, these bi-scalars have well known expansions around their flat space expressions, quantifying \\textit{local flatness} and equivalence principle. We show that, if $\\mathscr{P}$ is a singular point, the scaling behavior of these bi-scalars changes drastically, capturing the non-trivial structure of geodesic flows near singularities. This yields remarkable insights into classical structure of spacetime singularities and provides useful tool to study their quantum structure.",
      "pdf_url": "https://arxiv.org/pdf/2512.12271.pdf",
      "categories": [
        "gr-qc",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12286",
      "title": "Inflation with Gauss-Bonnet Correction and Higgs Potential",
      "authors": [
        "Zahra Ahghari",
        "Mehrdad Farhoudi"
      ],
      "abstract": "Inflation with Gauss-Bonnet Correction and Higgs Potential Zahra Ahghari, Mehrdad Farhoudi General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We investigate the cosmological inflation for the Einstein-Hilbert action plus the Higgs potential function and the Gauss-Bonnet term coupled with the Higgs scalar field through a dilaton-like coupling. Then, using the Friedmann-Lemaître-Robertson-Walker metric and considering the appropriate slow-roll parameters, we derive the necessary equations of motion. In the proposed model, since the e-folding integral cannot be easily solved analytically, we first utilize a well-known Taylor expansion. Then, with a certain range of values derived for the model parameters, utilizing a mixture of several diagrams and numerical analysis methods, we obtain results for the tensor-to-scalar ratio and the scalar spectral index that are in good agreement with observational data within the acceptable range of the e-folding values. Also, in the absence of the Gauss-Bonnet term, we find that the inflationary observables are roughly the same as the predictions of the chaotic inflation model.",
      "pdf_url": "https://arxiv.org/pdf/2512.12286.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12347",
      "title": "Equation of the Perfect Fluid in the FRW Universe",
      "authors": [
        "Shi-Bei Kong",
        "Ying Wang",
        "Yu-Ke Wang"
      ],
      "abstract": "Equation of the Perfect Fluid in the FRW Universe Shi-Bei Kong, Ying Wang, Yu-Ke Wang General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this paper, we study the equation of state and its properties of the perfect fluid in the $D$-dimensional FRW universe under Einstein gravity, Gauss-Bonnet gravity and Lovelock gravity. In Einstein gravity, we get the equation of state and find that it has no critical point in the $P$-$V$ diagram, but its isothermal lines have minima in the $4$-dimensional case and are always negative in higher dimensions. In Gauss-Bonnet gravity, we get the equation of state and find that it has a critical point in the $5,6,7,8$-dimensional cases with phase transitions above the critical temperature. In Lovelock gravity, we get the equation of state and conditions of the critical points. Our work shows that both the theories of gravity and the dimensions of the FRW universe affect the existence of the critical point of the perfect fluid. Interestingly, if the critical point exists, phase transition always occures above the critical temperature.",
      "pdf_url": "https://arxiv.org/pdf/2512.12347.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12399",
      "title": "Hybrid algorithm combining matched filtering and convolutional neural networks for searching gravitational waves from binary black hole mergers",
      "authors": [
        "Takahiro S. Yamamoto",
        "Kipp Cannon",
        "Hayato Motohashi",
        "Hiroaki W. H. Tahara"
      ],
      "abstract": "Hybrid algorithm combining matched filtering and convolutional neural networks for searching gravitational waves from binary black hole mergers Takahiro S. Yamamoto, Kipp Cannon, Hayato Motohashi, Hiroaki W. H. Tahara 11 pages, 6 figures, code is available on GitHub at this https URL General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) Efficient searches for gravitational waves from compact binary coalescence are crucial for gravitational wave observations. We present a proof-of-concept for a method that utilizes a neural network taking an SNR map, a stack of SNR time series calculated by the matched filter, as input and predicting the presence or absence of gravitational waves in observational data. We demonstrate our algorithm by applying it to a dataset of gravitational-wave signals from stellar-mass black hole mergers injected into stationary Gaussian noise. Our algorithm exhibits comparable performance to the standard matched-filter pipeline and to the machine-learning algorithms that participated in the mock data challenge, MLGWSC-1. The demonstration also shows that our algorithm achieves reasonable sensitivity with practical computational resources.",
      "pdf_url": "https://arxiv.org/pdf/2512.12399.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.12533",
      "title": "Kerr-Bertotti-Robinson Spacetime and the Kerr/CFT Correspondence",
      "authors": [
        "Haryanto M. Siahaan"
      ],
      "abstract": "Kerr-Bertotti-Robinson Spacetime and the Kerr/CFT Correspondence Haryanto M. Siahaan General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We construct the Kerr/CFT correspondence for extremal Kerr--Bertotti--Robinson (Kerr--BR) black holes, which are exact stationary solutions of the Einstein--Maxwell equations describing a rotating black hole immersed in a uniform Bertotti--Robinson electromagnetic universe. After reviewing the geometry, horizon structure, and thermodynamics of the Kerr--BR family, we demonstrate that the external field non-trivially modifies both the horizon positions and the extremality condition. For extremal configurations, the near-horizon limit yields a warped $\\mathrm{AdS}_3$ geometry with an associated Maxwell field aligned to the $U(1)$ fibration. Imposing standard Kerr/CFT boundary conditions, the asymptotic symmetry algebra gives rise to a Virasoro algebra with central charge $c_L$ and left-moving temperature $T_L$ that depend explicitly on the external field strength. The Cardy formula then reproduces exactly the Bekenstein--Hawking entropy of the extremal Kerr--BR black hole for any admissible value of the Bertotti--Robinson field, thereby establishing a consistent Kerr/CFT dual description. Comparisons with the magnetized Melvin--Kerr and Kaluza--Klein black holes are briefly discussed, highlighting qualitative differences in their curvature profiles and horizon geometries.",
      "pdf_url": "https://arxiv.org/pdf/2512.12533.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12541",
      "title": "Matching the Alcubierre and Minkowski spacetimes",
      "authors": [
        "Osvaldo L. Santos-Pereira",
        "Everton M. C. Abreu",
        "Marcelo B. Ribeiro"
      ],
      "abstract": "Matching the Alcubierre and Minkowski spacetimes Osvaldo L. Santos-Pereira, Everton M. C. Abreu, Marcelo B. Ribeiro 13 pages. Accepted for publication in the \"European Physical Journal C\" General Relativity and Quantum Cosmology (gr-qc) This work analyzes the Darmois junction conditions matching an interior Alcubierre warp drive spacetime to an exterior Minkowski geometry. The joining hypersurface requires that the shift vector of the warp drive spacetime must satisfy the solution of a particular inviscid Burgers equation, namely, the gauge where the shift vector is not a function of the $y$ and $z$ spacetime coordinates. Such a gauge connects the warp drive metric to shock waves via a Burgers-type equation, which was previously found to be an Einstein equations vacuum solution for the warp drive geometry. It is also shown that not all Ricci and Riemann tensors components are zero at the joining hypersurface, but for that to happen they depend on the shift vector solution of the inviscid Burgers equation at the joining wall. This means that the warp drive geometry is not globally flat.",
      "pdf_url": "https://arxiv.org/pdf/2512.12541.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12547",
      "title": "Quasinormal modes and Grey body factors of Wormholes: From General prescription to Einstein Gauss Bonnet realizations",
      "authors": [
        "Madhukrishna Chakraborty",
        "Subenoy Chakraborty"
      ],
      "abstract": "Quasinormal modes and Grey body factors of Wormholes: From General prescription to Einstein Gauss Bonnet realizations Madhukrishna Chakraborty, Subenoy Chakraborty 27 pages, 5 figures , accepted for publication at IJGMMP Int.J.Geom.Meth.Mod.Phys. (2025) 2650006 General Relativity and Quantum Cosmology (gr-qc) Traversable wormholes are one of the most exciting predictions of General Relativity that offer short-cuts through space-time. However, their feasibility requires the violation of the null energy condition and makes their detection a bit difficult. This paper aims to show the new avenues delving deep into the observational prospects of TWHs via quasinormal modes (QNMs) and gray body factors GBFs. These are the two elementary aspects of wave dynamics. Given their distinct spectral imprints, these features provide a potential means to distinguish wormholes from black holes in gravitational wave observations. The role of QNMs in characterizing the ringdown phase of perturbations and the GBFs in determining transmission probabilities through wormhole barriers have been explored by a general description and then fed to Einstein Gauss Bonnet WH solutions in isotropic as well as anisotropic cases. Finally, a correspondence of the QNM frequencies with radius of the WH shadows has been made and the effect of Gauss Bonnet parameter on the QNM spectra has been discussed.",
      "pdf_url": "https://arxiv.org/pdf/2512.12547.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.12672",
      "title": "Probing the gravity of a Schwarzschild black hole in the presence of a cloud of strings with EMRIs",
      "authors": [
        "Mirzabek Alloqulov",
        "Ahmadjon Abdujabbarov",
        "Bobomurat Ahmedov",
        "Chengxun Yuan"
      ],
      "abstract": "Probing the gravity of a Schwarzschild black hole in the presence of a cloud of strings with EMRIs Mirzabek Alloqulov, Ahmadjon Abdujabbarov, Bobomurat Ahmedov, Chengxun Yuan General Relativity and Quantum Cosmology (gr-qc) Here, we explore the effect of the cloud of strings (CoS) on the gravitational waveforms of extreme mass ratio inspirals (EMRIs). The EMRI system consists of a supermassive black hole (BH) and a compact stellar mass object moving around it. We begin with studying the test particle motion around the Schwarzschild BH surrounded by a CoS by using the Lagrangian formalism. Moreover, we investigated the effect of the CoS parameter on the evolution of the semi-latus rectum and eccentricity. We then turn to the exploration of the impact of the CoS parameter on the gravitational waveforms of the EMRI system. The analysis performed shows that Laser Interferometer Space Antenna (LISA) could detect the CoS imprint in gravitational waveforms when the values of the string cloud parameter $\\alpha \\gtrsim 2 \\times 10^{-6}$.",
      "pdf_url": "https://arxiv.org/pdf/2512.12672.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.12697",
      "title": "A parameterized equation of state for dark energy and Hubble Tension",
      "authors": [
        "Jing-Ya Zhao",
        "Tong-Yu He",
        "Jia-Jun Yin",
        "Zhan-Wen Han",
        "Rong-Jia Yang"
      ],
      "abstract": "A parameterized equation of state for dark energy and Hubble Tension Jing-Ya Zhao, Tong-Yu He, Jia-Jun Yin, Zhan-Wen Han, Rong-Jia Yang General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We propose a parameterized equation of state for dark energy and perform observational tests with the Hubble parameter measurements, the Pantheon supernova sample, baryon acoustic oscillations, and DESI DR2 data. We obtain the best-fit values for the parameters as: $H_0=73.96\\pm 0.16$, $\\Omega_{\\rm m}=0.2434\\pm 0.0079$, and $\\alpha=-0.00049\\pm 0.00092$, demonstrating that the model exhibits a high degree of consistency with astronomical observations and provides a promising parameterized method for addressing the Hubble tension.",
      "pdf_url": "https://arxiv.org/pdf/2512.12697.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.12863",
      "title": "Spherical symmetric fields on torsion-free Palatini Gauss-Bonnet theory",
      "authors": [
        "Máximo Bañados",
        "Daniela Bennett"
      ],
      "abstract": "Spherical symmetric fields on torsion-free Palatini Gauss-Bonnet theory Máximo Bañados, Daniela Bennett General Relativity and Quantum Cosmology (gr-qc) The Gauss-Bonnet density `a la Palatini' is not a total derivative in four dimensions. We study spherically symmetric fields for the torsion-free theory. The resulting equations are highly complicated but we show the existence of unexpected hidden gauge symmetries, beyond diffeomorphisms and Weyl transformations.",
      "pdf_url": "https://arxiv.org/pdf/2512.12863.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13025",
      "title": "Extracting the expression for the field equations of a diffeomorphism invariant theory of gravity from surface term",
      "authors": [
        "Jun-Jin Peng"
      ],
      "abstract": "Extracting the expression for the field equations of a diffeomorphism invariant theory of gravity from surface term Jun-Jin Peng General Relativity and Quantum Cosmology (gr-qc) As a contribution towards the understanding for the field equations of diffeomorphism invariant theories of pure gravity, we demonstrate in great detail that the expression for the field equations of such theories can be derived within the perspective of the surface term coming from the variation of the Lagrangian. Specifically, starting with the surface term, we extract a symmetric rank-two tensor together with an anti-symmetric one out of this term with the variation operator replaced with the Lie derivative along an arbitrary vector field. By utilizing an equality stemming from the Lie derivative of the Lagrangian density along an arbitrary vector field, it is proved that the resulting symmetric rank-two tensor is identified with the functional derivative of the Lagrangian density with respect to the metric. Such a result further brings forth the expression for the field equations constructed from the symmetric rank-two tensor, which naturally rules out the derivative of the Lagrangian density with respect to the metric and coincides with the one for the Euler-Lagrange equations of motion. Furthermore, it is illustrated that the construction of the expression for the field equations from the symmetric rank-two tensor must be feasible as long as the variation operator in the variation equation of the Lagrangian is allowed to be substituted by the Lie derivative along an arbitrary vector field. On the other hand, as a byproduct, the anti-symmetric rank-two tensor turns out to be the Noether charge two-form. Our results offer a straightforward support on the proposal in our previous work that the surface term gives a unified description for field equations and Noether charges in the context of theories of gravity admitting diffeomorphism invariance symmetry.",
      "pdf_url": "https://arxiv.org/pdf/2512.13025.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13029",
      "title": "On the magnetic 2+1- D space-time and its non-relativistic counterpart",
      "authors": [
        "Sayan Kumar Pal"
      ],
      "abstract": "On the magnetic 2+1- D space-time and its non-relativistic counterpart Sayan Kumar Pal Minor update from the published version: a few typos corrected Sayan Kumar Pal 2025 J. Phys.: Conf. Ser. 3152 012028 General Relativity and Quantum Cosmology (gr-qc) We present here an interesting non-relativistic limit, referred to as the Newton-Hooke (NH) limit, of the purely magnetic BTZ solution by starting from the Einstein-Maxwell system in the 2+1 dimensions. The Newton-Hooke limit is different from the Galilean limit in the sense that the former contains an additional parameter {\\Lambda}, the cosmological constant, over and above the speed of light, c. We show that under this limit, the geodesics of the magnetic BTZ solution reduce to the two-dimensional motion of a charged particle in a normal magnetic field together with the presence of an extra harmonic potential, sometimes called the Fock-Darwin problem, which serves as a precursor to model certain condensed matter theories. Our present study has significance in analyzing the symmetries of different dynamical systems, from relativistic and/to nonrelativistic theories. Also, we discuss here one of the applications of the generalized (magnetic) NH_3 symmetry in the context of the Virial theorem, where this symmetry is the symmetry group of the Fock-Darwin problem mentioned above.",
      "pdf_url": "https://arxiv.org/pdf/2512.13029.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13114",
      "title": "Shadow and Optical Imaging in Einstein-Maxwell-Dilaton Black Hole",
      "authors": [
        "Junlin Qin",
        "Hong-Er Gong",
        "Yusen Wang",
        "Zhan-Feng Mai",
        "Bofeng Wu",
        "Sen Guo",
        "Enwei Liang"
      ],
      "abstract": "Shadow and Optical Imaging in Einstein-Maxwell-Dilaton Black Hole Junlin Qin, Hong-Er Gong, Yusen Wang, Zhan-Feng Mai, Bofeng Wu, Sen Guo, Enwei Liang General Relativity and Quantum Cosmology (gr-qc) This paper investigates photon motion in black hole of Einstein-Maxwell-dilaton theory, exploring black hole shadows and observational characteristics under various accretion models. We first give the relation of the event horizon, photon sphere, and critical impact parameter in terms of the magnetic charge $q$. We then use the Event Horizon Telescope data to constrain $q$. For the two spherical accretion models, the infalling scenario yields a darker shadow due to the Doppler effect. However, the shadow radius remains unchanged for different models. In the case of an optically thin, geometrically thin disk accretion model, the observed brightness is predominantly determined by direct emission. The lensing ring provides a secondary contribution to the intensity, whereas the photon ring's emission is negligible. The widths of the lensing and photon rings exhibit a positive correlation with the magnetic charge $q$. Additionally, within the disk model framework, the black hole shadow radius is found to depend on the specific emission model.",
      "pdf_url": "https://arxiv.org/pdf/2512.13114.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13206",
      "title": "Through the Singularity",
      "authors": [
        "Michael Heller",
        "Tomasz Miller",
        "Wiesław Sasin"
      ],
      "abstract": "Michael Heller, Tomasz Miller, Wiesław Sasin General Relativity and Quantum Cosmology (gr-qc); Mathematical Physics (math-ph) In this work, we propose a dangerous journey -- a journey through the strong singularity from one universe to another or from inside of a black hole to its 'inverse' as a white hole. Such singularities are hidden in the Friedman and Schwarzschild solutions; we call them malicious singularities. The journey is made possible owing to two generalizations. The first generalization consists in considering spaces with differential structures on them (the so-called ringed spaces) rather than the usual manifolds. This entails a generalization of the concept of smoothness, which allows us to think about a smooth passage through the singularity. The second generalization is related to the concept of curve. We show that if a kind of singularity is implanted in the set of curve's parameters, along with an appropriate topology, in such a way that the structure of the set of parameters corresponds to the structure of the singular space-time, the curve can smoothly -- in a generalized sense -- pass through the singularity.",
      "pdf_url": "https://arxiv.org/pdf/2512.13206.pdf",
      "categories": [
        "gr-qc",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13327",
      "title": "Shadows of rotating traversable wormholes surrounded by plasma",
      "authors": [
        "Tsanimir Angelov",
        "Rasim Bekir",
        "Galin Gyulchev",
        "Petya Nedkova",
        "Stoytcho Yazadjiev"
      ],
      "abstract": "Shadows of rotating traversable wormholes surrounded by plasma Tsanimir Angelov, Rasim Bekir, Galin Gyulchev, Petya Nedkova, Stoytcho Yazadjiev General Relativity and Quantum Cosmology (gr-qc) We study the influence of the plasma environment on the shadows of stationary axisymmetric wormholes. We consider a sample of several wormhole solutions and plasma distributions for which the Hamilton-Jacobi equation for the light rays is separable. This allows us to derive analytical expressions for the shadow boundary and examine the behavior of the photon regions as the plasma frequency varies. We observe that plasma profiles which depend only on radial coordinate lead to common evolution of the photon region which does not depend on the wormhole metric and is consistent with the Kerr black hole. For plasma profiles with angular dependence the evolution of the photon region is specific for every spacetime thus wormholes are observationally distinguishable. We further investigate the formation of forbidden regions in the plasma medium where light cannot propagate. They lead to the formation of plasma frequency ranges where the shadow is no longer observable and we show that this phenomenon is characteristic for all the configurations in our sample. We obtain the critical frequencies for which the shadow vanishes and demonstrate that for all the wormholes they are lower than the critical frequencies for the Kerr black hole in the same environment. This implies that there exist plasma frequency ranges in which the Kerr black hole casts a shadow but wormholes do not, creating a strong observational signature for discriminating between compact objects. In the frequency ranges where both black hole and wormhole shadows exist the wormhole shadows are consistently smaller than those for the Kerr black hole. As the plasma frequency grows the discrepancy progresses showing that plasma medium facilitates the experimental detection of wormholes. Finally we consider aberrational effects on the wormhole shadows. They further increase the deviation from black holes making wormholes easier to detect.",
      "pdf_url": "https://arxiv.org/pdf/2512.13327.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13471",
      "title": "Thermodynamic analysis of a compact object in Rastall-Rainbow gravity",
      "authors": [
        "Sareh Eslamzadeh",
        "Saheb Soroushfar"
      ],
      "abstract": "Thermodynamic analysis of a compact object in Rastall-Rainbow gravity Sareh Eslamzadeh, Saheb Soroushfar Nucl. phys. B 1020 (2025) 117158 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this paper, we investigate the thermodynamic behavior of a horizonless compact object within the framework of Rastall-Rainbow (RR) gravity. Working with local shell thermodynamics for gravastar and an exterior fiducial temperature, we show that the RR modification bends temperature to produce two extrema and a stable mass remnant at zero temperature. We show that the gravastar's shell entropy is smaller than that of a comparable black hole, and that RR modifications introduce a logarithmic correction which contributes to specific heat positivity and a smoother free energy landscape of small gravastars. A Central finding of this work is that, from heat capacity and Helmholtz free energy analyses, we uncover small, middle, and large branches and demonstrate that unlike Rainbow modified black holes, the small RR gravastar is both locally and globally favored over hot curved space. At the parameter level, both Rastall and Rainbow play distinct roles. Increasing the Rastall parameter, by strengthening matter-curvature coupling, adjusts the redshift between the shell and the exterior, shifts the temperature maximum to higher values at larger masses, and narrows the unstable window. In contrast, increasing the Rainbow parameter enhances energy dependent UV suppression and bends the temperature in lower values at larger masses. Altogether, these results highlight a controlled route to thermodynamic stabilization and the emergence of a stable remnant in horizonless compact objects within RR gravity.",
      "pdf_url": "https://arxiv.org/pdf/2512.13471.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13531",
      "title": "Quantum Correlations and Gravity: From the Emergence of a Cosmological Constant to the Gravitation of Particles in Superposition",
      "authors": [
        "Johas Morales",
        "Yuri Bonder"
      ],
      "abstract": "Quantum Correlations and Gravity: From the Emergence of a Cosmological Constant to the Gravitation of Particles in Superposition Johas Morales, Yuri Bonder General Relativity and Quantum Cosmology (gr-qc) One of the main technical obstacles in constructing a consistent theory of quantum gravity is that the metric itself defines the causal structure required for quantization. This motivates implementing quantum aspects of gravity through an independent connection. Moreover, the experimentally confirmed violation of Bell inequalities, together with the natural structure of the energy--momentum tensor in semiclassical gravity, suggests that nonlocality should be incorporated into the gravitational formalism. Motivated by these considerations, we propose a model in which the connection is treated as an independent bitensorial field, leading to a bitensorial generalization of the Einstein equations. The model reduces to General Relativity when the matter source is classical. We apply it in two regimes: the late-time universe and the Newtonian limit. In the cosmological case, the model naturally gives rise to a positive effective cosmological constant. In the Newtonian regime, we analyze a situation in which the gravitational source is in a quantum superposition and find that the model predicts a novel, nonconservative effective force that depends on the velocity of the test particle.",
      "pdf_url": "https://arxiv.org/pdf/2512.13531.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13554",
      "title": "Silencing Newtonian noise using fusion sensor arrays",
      "authors": [
        "Paul Ophardt",
        "Francesca Badaracco",
        "Katharina-Sophie Isleif"
      ],
      "abstract": "Silencing Newtonian noise using fusion sensor arrays Paul Ophardt, Francesca Badaracco, Katharina-Sophie Isleif General Relativity and Quantum Cosmology (gr-qc) Newtonian noise (NN) from seismic density fluctuations is expected to limit the low-frequency sensitivity of third-generation gravitational-wave detectors, in particular the Einstein Telescope (ET). Current NN mitigation relies on seismometer arrays and Wiener filtering, while distributed acoustic sensing (DAS) offers a complementary, low-cost means of obtaining dense strain measurements. We investigate fusion sensor arrays composed of both displacement-measuring seismometers and strain-measuring DAS-type sensors. We extend the Wiener filter formalism to mixed sensor types and introduce analytic S-wave strain correlation coefficients. Using a hybrid differential evolution and covariance matrix adaptation scheme, we validate our approach against established seismometer-only results and analyze the geometry, robustness, and performance of optimized fusion arrays. Fusion arrays enhance P/S-wave disentanglement and achieve NN cancellation levels comparable to, and sometimes exceeding, those of seismometer-only arrays, particularly for small sensor numbers. When sensors are constrained to the ET infrastructure, we find that six seismometers complemented by fourteen strainmeters inside the ET arms can match the performance of twenty seismometers in boreholes, achieving a residual at the 10% level, and thereby offering a cost-efficient pathway toward ET-scale NN mitigation.",
      "pdf_url": "https://arxiv.org/pdf/2512.13554.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2512.13575",
      "title": "Could a thin-shell configuration lie hidden within the Universe?",
      "authors": [
        "Mauricio Cataldo",
        "Antonella Cid",
        "Pedro Labraña"
      ],
      "abstract": "Could a thin-shell configuration lie hidden within the Universe? Mauricio Cataldo, Antonella Cid, Pedro Labraña 6 pages, to be published in EPJC General Relativity and Quantum Cosmology (gr-qc) This article explores the cosmological scenario in which our Universe contains a hidden thin-shell configuration. We investigate a degenerate modification of the Friedmann-Robertson-Walker metric obtained through a coordinate transformation applied to the radial coordinate, analogous to recent approaches that address the Big Bang singularity via spacetime defects. The resulting metric, while formally satisfying the standard homogeneous Friedmann equations, actually describes an evolving wormhole geometry with two asymptotically flat Friedmann-Robertson-Walker regions connected by a throat located at the coordinate singularity. Using Israel's junction formalism, we demonstrate that this coordinate singularity corresponds to a thin shell characterized by exotic matter with well-defined surface energy density and isotropic pressure. The shell obeys the barotropic equation of state $p = -\\rho/2$, confirming the presence of exotic matter that violates the standard energy condition, which is a requirement for maintaining wormhole geometries. As the universe expands, this thin shell becomes increasingly diluted, scaling as $1/a(t)$ with the cosmic scale factor.",
      "pdf_url": "https://arxiv.org/pdf/2512.13575.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13621",
      "title": "Resonances in the early Universe",
      "authors": [
        "D. L. Canedo",
        "G. Oliveira-Neto",
        "G. A. Monerat",
        "E.V. Corrêa Silva"
      ],
      "abstract": "Resonances in the early Universe D. L. Canedo, G. Oliveira-Neto, G. A. Monerat, E.V. Corrêa Silva The paper has 14 pages and 6 figures General Relativity and Quantum Cosmology (gr-qc) In the present paper, we study a Friedmann-Lemaître-Robertson-Walker (FLRW) quantum cosmology model with positively curved spatial sections. The matter content of the model is given by a radiation fluid, a Chaplygin gas, and an ad hoc potential. After writing the Hamiltonian of the model, we notice that the effective potential ($V_{eff}$) depends on three parameters: $A$ and $B$ associated with the Chaplygin gas, and $\\sigma$ associated with the ad hoc potential. Depending on the values of these parameters $V_{eff}$ becomes a double barrier potential. We quantize the model and obtain the Wheeler-DeWitt equation. We solve that equation using the WKB approximation and compute the corresponding probability ($TP_{WKB}$) that the wavefunction of the universe tunnels through the double barrier potential $V_{eff}$. We study how $TP_{WKB}$ behaves as a function of the parameters $A$, $B$, $\\sigma$ and the radiation energy $E$. We notice a significant occurrence of resonances in $TP_{WKB}$ when varying it as a function of $E$ or $\\sigma$. It is a very interesting phenomenon because it may cause the universe to be born with selected values of $E$ or $\\sigma$.",
      "pdf_url": "https://arxiv.org/pdf/2512.13621.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13646",
      "title": "Two-point correlators in de Sitter-prepared states with bra-ket wormholes",
      "authors": [
        "Sunghoon Jung",
        "Minju Kum",
        "Junghwan Lee"
      ],
      "abstract": "Two-point correlators in de Sitter-prepared states with bra-ket wormholes Sunghoon Jung, Minju Kum, Junghwan Lee General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) Motivated by the finiteness of de Sitter (dS) horizon entropy, we study how ``bra-ket wormholes'' modify correlation functions in gravitationally prepared states. Euclidean wormhole saddles in gravitational path integrals can generate non-factorizing contributions to correlation functions, as in replica-wormhole explanation of the Page curve and bra-ket-wormhole restoration of strong subadditivity. By defining `time' variables and computing observables in a flat region attached to the dS boundary, we evaluate bra-ket wormhole contributions to scalar two-point functions and find a late-time transition in the dominant saddle, accompanied by ramp-and-plateau behavior of correlations and characteristic timescale comparable to the fast scrambling. Our results are built upon (i) inflationary horizon exit and re-entry, (ii) enhancement of correlation at small comoving momentum $k$ by wormhole contribution, and (iii) a competition between mode counting and topological suppression that drives a transition to wormhole dominance. Although results are qualitatively consistent, one needs to address wormhole stabilization to clearly interpret in terms of the entropy context.",
      "pdf_url": "https://arxiv.org/pdf/2512.13646.pdf",
      "categories": [
        "gr-qc",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.13651",
      "title": "Schrödinger Symmetry in Spherically-symmetric Static Mini-superspaces with Matter Fields",
      "authors": [
        "Taishi Sano",
        "Yuki Yokokura"
      ],
      "abstract": "Schrödinger Symmetry in Spherically-symmetric Static Mini-superspaces with Matter Fields Taishi Sano, Yuki Yokokura General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) Schrödinger symmetry emerged in a ``fluid limit\" from a full superspace to several mini-superspace models. We consider two spherically-symmetric static mini-superspace models with matter fields and verify the robustness of this emergent symmetry at the classical level: (i) Maxwell field with cosmological constant and (ii) $n$ massless scalar fields. We develop a method based on canonical transformations and show that: for model (i), 3D Schrödinger symmetry emerges, and the solution is the (anti-) de Sitter Reissner-Nordström spacetime, and for model (ii), $(2+n)$D Schrödinger symmetry appears, and the solution is a generalized Janis-Newman-Winicour spacetime and its ``interior\", a Kantowski-Sachs type closed universe. In the matter decoupling limit, both cases lead to 2D Schrödinger symmetry in different lapse functions and mini-superspace coordinates, which implies the covariance of Schrödinger symmetry. Finally, we propose a physical interpretation of the symmetry under Hamiltonian constraints $H$ and explain it with examples: Symmetry generators commuting with $H$ map a solution to another one, while those non-commuting with $H$ generate a new theory with the Schrödinger symmetry and the transformed configuration is a solution to the new theory. These support the robustness of the emergence of Schrödinger symmetry and open new possibilities for exploring quantum dynamics of matter and gravity based on the symmetry.",
      "pdf_url": "https://arxiv.org/pdf/2512.13651.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2112.05932",
      "title": "Using overlap of sky localization probability maps for filtering potentially lensed pairs of gravitational-wave signals",
      "authors": [
        "Henry W. Y. Wong",
        "Lok W. L. Chan",
        "Isaac C. F. Wong",
        "Rico K. L. Lo",
        "Tjonnie G. F. Li"
      ],
      "abstract": "Using overlap of sky localization probability maps for filtering potentially lensed pairs of gravitational-wave signals Henry W. Y. Wong, Lok W. L. Chan, Isaac C. F. Wong, Rico K. L. Lo, Tjonnie G. F. Li General Relativity and Quantum Cosmology (gr-qc) Strong gravitational lensing creates multiple images of a gravitational wave transient. The current state-of-the-art method for identifying such lensing events is a computationally expensive full Bayesian analysis. In this paper, we investigate the feasibility and efficiency of using the overlap of sky localization probability maps (skymaps) to quickly filter potentially lensed gravitational wave signal pairs. We introduce three overlap statistics and test their performance using 200 simulated lensed pairs of gravitational-wave signals across five sets of signal-to-noise ratios. By setting a threshold with a false positive rate of $\\mathrm{FPR} = 10^{-2}$ for the three overlap statistics, we find that we can filter out over $99\\%$ of nonlensed events while retaining all lensed events. The statistics for each event pair can be computed instantly, and can be used in practice to quickly analyze existing events using the skymaps from the low-latency localization pipelines when results from the full parameter estimation are not available.",
      "pdf_url": "https://arxiv.org/pdf/2112.05932.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2409.06947",
      "title": "Graviscalar quasinormal modes and asymptotic tails of a thick brane",
      "authors": [
        "Qin Tan",
        "Sheng Long",
        "Weike Deng",
        "Jiliang Jing"
      ],
      "abstract": "Graviscalar quasinormal modes and asymptotic tails of a thick brane Qin Tan, Sheng Long, Weike Deng, Jiliang Jing 10 pages, 5 figures, version to appear in Phys.Lett.B General Relativity and Quantum Cosmology (gr-qc) In this work, we investigate the graviscalar quasinormal modes (QNMs) and their asymptotic tail behavior of a thick brane. Considering the scalar perturbations of the thick brane metric, we obtain the main equations of graviscalar Kaluza-Klein modes. Based on these equations, the frequencies of the graviscalar QNMs of the thick brane are obtained by the Wentzel-Kramers-Brillouin, asymptotic iteration, and numerical evolution methods. The results show that the scalar fluctuation of the thick brane has a series of discrete QNMs, similar to the tensor perturbation of the brane. These modes appear as decaying massive scalar particles in four-dimensional spacetime. We also studied in detail the late time tails of these QNMs and found that some modes have slowly decaying oscillatory tails that may be new sources of the gravitational wave backgrounds. Obviously, the QNMs contain the information of the brane and are characteristic modes of the thick brane.",
      "pdf_url": "https://arxiv.org/pdf/2409.06947.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2409.17760",
      "title": "Motion of spinning particles around black hole in a dark matter halo",
      "authors": [
        "Qin Tan",
        "Weike Deng",
        "Sheng Long",
        "Jiliang Jing"
      ],
      "abstract": "Motion of spinning particles around black hole in a dark matter halo Qin Tan, Weike Deng, Sheng Long, Jiliang Jing 11 pages, 8 figures, version to appear in JCAP General Relativity and Quantum Cosmology (gr-qc) The motion of a rapidly rotating object in curved spacetime is affected by the spin-curvature force, an effect captured in the motion of spinning test particles. Recently, Cardoso et al.~[Phys. Rev. D 105, L061501 (2022)] found an exact solution describing a black hole immersed in a Hernquist distribution of dark matter. In this work, we investigate the motion of spinning particles around this black hole. We use the Mathison-Papapetrou-Dixon equation and the Tulczyjew spin-supplementary condition to calculate the effective potential, four-momentum, and four-velocity of the spinning particle. The equatorial motion of spinning test particles and the properties of the marginally bound orbits, innermost stable circular orbits, and periodic orbits are further studied. We find that the existence of dark matter halos can significantly change the orbital eccentricity, energy, and the marginally bound orbits, innermost stable circular orbits, and periodic orbits parameters of spinning test particles. Compared to the Schwarzschild black hole, dark matter halos bring the marginally bound orbit and innermost stable circular orbit of a spinning test particle closer to the event horizon. These results could help us understand the properties of black holes in dark matter halos.",
      "pdf_url": "https://arxiv.org/pdf/2409.17760.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2410.06945",
      "title": "Quasinormal modes and echoes of a double braneworld",
      "authors": [
        "Qin Tan",
        "Sheng Long",
        "Weike Deng",
        "Jiliang Jing"
      ],
      "abstract": "Quasinormal modes and echoes of a double braneworld Qin Tan, Sheng Long, Weike Deng, Jiliang Jing 15 pages, 17 figures,version to appear in JHEP General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this work, we study the gravitational quasinormal modes and the gravitational echoes of a double braneworld. The double braneworld is a kind of split thick brane, which is crucial for addressing the hierarchy problem in the thick brane scenarios. Using the Bernstein spectral method, direct integration method, and asymptotic iteration method, we calculate the quasinormal mode frequencies of the double brane. We find that the quasinormal spectrum is very different from that of the single brane model, especially the high overtone mode. We also perform numerical evolution to study the time-domain properties of the characteristic modes of the double brane. The results show that when the degree of brane splitting is large, gravitational echoes of oscillation attenuation between sub-branes will appear in the thick brane. Furthermore, different long-lived Kaluza-Klein modes interfere with each other, resulting in a beating effect. Compared to a single brane model, the phenomenon of the split double brane is richer, and the lifetime of the massive Kaluza-Klein graviton of the double brane is longer. These phenomena may have potential phenomenological interest. We hope to detect these extra-dimensional signals in future gravitational wave detectors or accelerators.",
      "pdf_url": "https://arxiv.org/pdf/2410.06945.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2411.09528",
      "title": "Searching for quantum-gravity footprint around stellar-mass black holes",
      "authors": [
        "Luigi Foschini",
        "Alberto Vecchiato",
        "Alfio Bonanno"
      ],
      "abstract": "Searching for quantum-gravity footprint around stellar-mass black holes Luigi Foschini, Alberto Vecchiato, Alfio Bonanno 24 pages, 5 figures. Corrected an error in Eq. (9). Conclusions are unchanged European Physical Journal C, vol. 85, (2025), id 752 General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) According to the asymptotically safe gravity, black holes may have characteristics different from those described according to general relativity if the running of the gravitational constant coupling happens at low energies. Particularly, they should be more compact, with a smaller event horizon, which in turn affects the other quantities dependent on it, like the photon ring and the size of the innermost stable circular orbit. We decided to test the latter hypothesis by searching in the literature for observational measurements of the inner radius of the accretion disk around stellar-mass black holes. We selected the smallest values measured when the disk was in high/soft state, made them homogeneous by taking into account the most recent and more reliable values of mass, spin, viewing angle, and distance from the Earth, and compared with the expectations of the Kerr metric. We do not find any significant deviation. Some doubtful cases can be easily understood as due to specific states of the object during the observation or instrumental biases. We set the tightest constraint on the parameter $\\xi$ obtained to date.",
      "pdf_url": "https://arxiv.org/pdf/2411.09528.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.20726",
      "title": "Spherical inspirals of spinning bodies into Kerr black holes",
      "authors": [
        "Viktor Skoupý",
        "Gabriel Andres Piovano",
        "Vojtěch Witzany"
      ],
      "abstract": "Spherical inspirals of spinning bodies into Kerr black holes Viktor Skoupý, Gabriel Andres Piovano, Vojtěch Witzany Phys. Rev. D 112, 124054 - Published 15 December, 2025 General Relativity and Quantum Cosmology (gr-qc) Extreme mass-ratio inspirals (EMRIs), consisting of a stellar-mass compact object spiraling into a massive black hole, are key sources for future space-based gravitational wave observatories such as LISA. Accurate modeling of these systems requires incorporating the spin effects of both the primary and secondary bodies, particularly for waveforms at the precision required for LISA detection and astrophysical parameter extraction. In this work, we develop a framework for modeling flux-driven spherical inspirals (orbits of approximately constant Boyer-Lindquist radius) of a spinning secondary into a Kerr black hole. We leverage recently found solutions for the motion of spinning test particles and compute the associated gravitational wave fluxes to linear order in the secondary spin. Next, we show that spherical orbits remain spherical under radiation reaction at linear order in spin, and derive the evolution of the orbital parameters throughout the inspiral. We implement a numerical scheme for waveform generation in the frequency domain and assess the impact of the secondary spin on the gravitational wave signal. In contrast to quasi-circular inspirals, we find that neglecting the secondary spin in spherical inspirals induces large mismatches in the waveforms that will plausibly be detectable by LISA.",
      "pdf_url": "https://arxiv.org/pdf/2506.20726.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.21148",
      "title": "Exploring the role of accretion disk geometry in shaping black hole shadows",
      "authors": [
        "Zi-Liang Wang"
      ],
      "abstract": "Exploring the role of accretion disk geometry in shaping black hole shadows Zi-Liang Wang 34 pages, 17 figures. Code available at this https URL Phys.Rev.D 112 (2025) 6, 064052 General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) We study black hole imaging in the context of geometrically thick accretion disks in Schwarzschild spacetime. By decomposing the emitting region into a set of one-dimensional luminous segments, each characterized by its inclination angle and inner radius, we construct transfer functions that capture key image features-namely, the direct image, lensing ring, and photon ring. This approach allows a unified treatment of disk geometry and viewing angle. We explore three regimes: optically thin, optically thick, and partially optically thick disks. For optically thin flows, increasing the disk thickness (characterized by the half-opening angle $\\psi_0$) broadens the lensing ring, gradually bridging the photon ring and the direct image. The photon ring remains narrow, but its position robustly defines the innermost edge of the lensing structure. In the optically thick case, image features are primarily determined by the first intersection of traced light rays with the disk, and we provide analytical criteria for the presence of lensing and photon rings based on the critical deflection angles. For partially optically thick disks, we adopt a simplified radiative transport model and find a critical absorption coefficient $\\chi \\sim (6M\\psi_0)^{-1}$ beyond which the image rapidly transitions from an optically thin- to thick-disk appearance. These results help clarify the respective roles of the photon and lensing rings across different disk configurations, and may offer a useful framework for interpreting future high-resolution black hole observations.",
      "pdf_url": "https://arxiv.org/pdf/2506.21148.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.03701",
      "title": "Dymnikova Black Hole Surrounded by Quintessence",
      "authors": [
        "M. H. Macêdo",
        "J. Furtado",
        "R. R. Landim"
      ],
      "abstract": "Dymnikova Black Hole Surrounded by Quintessence M. H. Macêdo, J. Furtado, R. R. Landim General Relativity and Quantum Cosmology (gr-qc) The Dymnikova black hole (BH) is a regular solution that interpolates between a de Sitter core near the origin and a Schwarzschild-like behavior at large distances. In this work, we investigate the properties of a Dymnikova BH immersed in a quintessential field, characterized by the state parameter $\\omega$ and a normalization constant $c$. We explore the thermodynamic behavior, null geodesics, scalar quasinormal modes and shadow profiles for this model. Our analysis shows that the presence of quintessence alters the Hawking temperature and specific heat, leading to parameter-dependent phase transitions. The null geodesics and corresponding black hole shadows are also found to be sensitive to the model parameters, especially $\\omega$ and $c$. This sensitivity influences light deflection and shadow size. Furthermore, we compute the scalar quasinormal modes and observe that quintessence tends to enhance the damping of the modes, indicating greater stability under perturbations.",
      "pdf_url": "https://arxiv.org/pdf/2507.03701.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.10165",
      "title": "Prospects for joint multiband detection of intermediate-mass black holes by LGWA and the Einstein Telescope",
      "authors": [
        "Yue-Yan Dong",
        "Ji-Yu Song",
        "Jing-Fei Zhang",
        "Xin Zhang"
      ],
      "abstract": "Prospects for joint multiband detection of intermediate-mass black holes by LGWA and the Einstein Telescope Yue-Yan Dong, Ji-Yu Song, Jing-Fei Zhang, Xin Zhang 21 pages, 8 figures; accepted for publication in JCAP General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) Gravitational-wave (GW) detection offers a novel approach to exploring intermediate-mass black holes (IMBHs). The GW signals from IMBH mergers mainly fall in the decihertz frequency band. The lunar-based GW detector, the Lunar Gravitational-Wave Antenna (LGWA), exhibits high sensitivity in this band, making it particularly well-suited for detecting IMBHs. However, for lower-mass IMBHs, the late inspiral and merger signals enter the sensitive frequency range of ground-based GW detectors. In this work, we aim to explore how multi-band observations with LGWA and the third-generation ground-based GW detector, the Einstein Telescope (ET), can contribute to detecting the population of IMBHs. We consider three population distribution cases of IMBHs, including two population models based on astrophysical motivations and a uniform distribution, and compute the signal-to-noise ratios for LGWA, ET, and their combination to directly compare their capabilities in detecting IMBH mergers. Our results suggest that LGWA possesses strong detection capability for high-mass IMBH mergers. At redshift $z = 1$, LGWA's detection rate for IMBH binaries with primary masses above $5 \\times 10^4~M_\\odot$ is largely insensitive to orbital inclination and mass ratio. In contrast, ET is more suited for detecting IMBH binaries with primary masses below $10^3~M_\\odot$. The multi-band observation of LGWA and ET possesses strong detection capabilities across the full IMBH mass spectrum. Furthermore, we find that the multi-band detection can significantly and effectively recover the IMBH population distributions. In summary, we conclude that the multi-band observations of LGWA and ET will provide powerful detection capabilities for IMBHs and are expected to significantly enhance our understanding of this important yet still poorly observed class of black holes.",
      "pdf_url": "https://arxiv.org/pdf/2507.10165.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2507.20992",
      "title": "Heat Capacity and the Violation of Scaling Laws in Gravitational System",
      "authors": [
        "Shi-Bei Kong"
      ],
      "abstract": "Heat Capacity and the Violation of Scaling Laws in Gravitational System Shi-Bei Kong General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this paper, we examine the scaling laws in gravitational system from the perspective of free energy landscape and the scaling hypothesis. It has been found that for some special black holes, their critical exponents $(0,1,2,3)$ are beyond the mean field theory, and more surprisingly violate the scaling laws. We find that the main reason for the violation of the scaling laws is that the heat capacity at constant volume $C_V$ is 0, so the critical exponent $\\alpha$ is often treated as 0, which can not be derived from the scaling hypothesis. We also find that there is a symmetry violation for the two coexistence states $\\omega_l$ and $\\omega_s$.",
      "pdf_url": "https://arxiv.org/pdf/2507.20992.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.08618",
      "title": "General Fourier expansion of post-Newtonian binary dynamics based on a quasi-Keplerian framework",
      "authors": [
        "Xiaolin Liu",
        "Zhoujian Cao"
      ],
      "abstract": "General Fourier expansion of post-Newtonian binary dynamics based on a quasi-Keplerian framework Xiaolin Liu, Zhoujian Cao Physical Review D 112, 103040 (2025) General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) We have introduced a new method for computing gravitational-wave emission from nonspinning binaries which systematically unifies the various integrals arising in the Fourier expansions of post-Newtonian dynamics, providing a simple, practical scheme for calculations at arbitrary precision. Using this approach, we derived the full set of 3PN dynamical quantities and gravitational-wave Fourier modes and have released the corresponding numerical code as open source. Furthermore, when radiation-reaction effects is not included, we found that the tail contribution to the energy and angular momentum fluxes can be resummed into an exceptionally compact expression with the help of the new method. These advances pave the way for more convenient and accurate frequency-domain waveform modeling in the future.",
      "pdf_url": "https://arxiv.org/pdf/2508.08618.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2508.20419",
      "title": "The shadows and photon rings of two minimal deformations of Schwarzschild black holes",
      "authors": [
        "Hong-Er Gong",
        "Junlin Qin",
        "Yusen Wang",
        "Bofeng Wu",
        "Zhan-Feng Mai",
        "Sen Guo",
        "Enwei Liang"
      ],
      "abstract": "The shadows and photon rings of two minimal deformations of Schwarzschild black holes Hong-Er Gong, Junlin Qin, Yusen Wang, Bofeng Wu, Zhan-Feng Mai, Sen Guo, Enwei Liang General Relativity and Quantum Cosmology (gr-qc) This paper primarily investigates the optical characteristics of two minimal Schwarzschild black hole deformations, the Kazakov-Solodukhin and Ghosh-Kumar black holes, under different accretion models. The event horizon, photon sphere, and critical impact parameter of the former increase compared with the Schwarzschild black hole, but those of the latter decrease. The data from the Event Horizon Telescope Collaboration are used to constrain the parameter ranges of the two black holes. In the case of spherical accretion, the quantum correction of Kazakov-Solodukhin black hole leads to the increase of black hole shadow size and the decrease of integrated intensity, while the shadow size of magnetically charged Ghosh-Kumar black hole decreases and the integrated intensity increases. The shadow radius of the black hole is independent of the spherical accretion models. For an optically and geometrically thin accretion disk, the integrated intensity is mainly contributed by direct emission, and the contributions of photon rings and lensed rings are very small. In addition, the photon rings and lensed rings of Kazakov-Solodukhin black hole are narrower, while those of Ghosh-Kumar black hole are wider. Whereas the Kazakov-Solodukhin black hole exhibits higher brightness, the Ghosh-Kumar black hole shows lower brightness. Additionally, a disk closer to the black hole correlates with a smaller shadow radius. This paper proposes a method to distinguish different black holes in a specific thin disk model.",
      "pdf_url": "https://arxiv.org/pdf/2508.20419.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.01368",
      "title": "Photon surfaces extensions for dynamical gravitational collapse",
      "authors": [
        "Roberto Giambò",
        "Camilla Lucamarini"
      ],
      "abstract": "Photon surfaces extensions for dynamical gravitational collapse Roberto Giambò, Camilla Lucamarini 18 pages (some references added, minor corrections) General Relativity and Quantum Cosmology (gr-qc) The equations for the photon surface in spherical symmetry are worked out, starting from arXiv:gr-qc/0005050, in the most general dynamical setting. We show that the condition for a timelike hypersurface to be a photon surface can be reformulated as a non-autonomous dynamical system, whose analysis reveals that the same condition also holds when the surface is generated by a null radial geodesic. As an application, we consider a well-known model of a spherical dust cloud undergoing gravitational collapse. Comparing our findings with those in arXiv:1910.13758 we establish that the photon surface uniquely extends in the interior spacetime as a null hypersurface, allowing us to analytically investigate whether it covers the singularity developing in the LTB model.",
      "pdf_url": "https://arxiv.org/pdf/2509.01368.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07096",
      "title": "The thermodynamics of readout devices and semiclassical gravity",
      "authors": [
        "Samuel Fedida",
        "Adrian Kent"
      ],
      "abstract": "The thermodynamics of readout devices and semiclassical gravity Samuel Fedida, Adrian Kent 14 pages, 3 figures, Expanded discussion General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) We analyse the common claim that nonlinear modifications of quantum theory necessarily violate the second law of thermodynamics. We focus on hypothetical extensions of quantum theory that contain readout devices. These black boxes provide a classical description of quantum states without perturbing them. They allow quantum state cloning, though in a way consistent with the relativistic no-signalling principle. We review the existence of such devices in the context of Moller-Rosenfeld semiclassical gravity, which postulates that the gravitational field remains classical and is sourced by the expectation value of a quantum energy-momentum tensor. We show that the definition of information in the models examined in this paper deviates from that given by von Neumann entropy, and that claims of second law violations based on the distinguishability of non-orthogonal states or on violations of uncertainty principles fail to hold in such theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.07096.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.09403",
      "title": "Backreaction equations for 1+1 dimensional BEC sonic black holes",
      "authors": [
        "Roberto Balbinot",
        "Alessandro Fabbri",
        "Giorgio Ciliberto",
        "Nicolas Pavloff"
      ],
      "abstract": "Backreaction equations for 1+1 dimensional BEC sonic black holes Roberto Balbinot, Alessandro Fabbri, Giorgio Ciliberto, Nicolas Pavloff Phys. Rev. D112, L121703 (2025) General Relativity and Quantum Cosmology (gr-qc); Quantum Gases (cond-mat.quant-gas); High Energy Physics - Theory (hep-th) As in the gravitational context, one of the most challenging open question in analogue black holes formed in Bose-Einstein condensates concerns the backreaction of Hawking-like radiation on the condensate and its subsequent evolution. In this work we derive the basic equations describing this backreaction within the density-phase formalism, which avoids infrared divergences and is particularly well suited to one-dimensional configurations.",
      "pdf_url": "https://arxiv.org/pdf/2509.09403.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.14306",
      "title": "From geometry to cosmology: a pedagogical review of inflation in curvature, torsion, and extended gravity theories",
      "authors": [
        "Davood Momeni"
      ],
      "abstract": "From geometry to cosmology: a pedagogical review of inflation in curvature, torsion, and extended gravity theories Davood Momeni This manuscript has been withdrawn by the author. Following publication of a related journal version, verification issues were identified, including problems with cited references and factual consistency. To maintain the integrity of the scientific record, the author has chosen to withdraw this preprint General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) We present a simplified review of inflationary cosmology across various modified gravity theories. These include models based on curvature, torsion, and non-metricity. We explore how scalar fields interact with different geometric quantities and how these interactions affect inflationary dynamics. Key cosmological features such as background evolution, reheating, and observable parameters are discussed. We also examine exotic scenarios inspired by string theory, extra dimensions, and non-local models. This work aims to connect theoretical models with observational data and future missions, offering guidance for exploring inflation beyond general relativity.",
      "pdf_url": "https://arxiv.org/pdf/2509.14306.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.20062",
      "title": "Assessing signal cross talk between extreme-mass-ratio inspirals and Galactic binaries in LISA data",
      "authors": [
        "Sviatoslav Khukhlaev",
        "Stanislav Babak"
      ],
      "abstract": "Assessing signal cross talk between extreme-mass-ratio inspirals and Galactic binaries in LISA data Sviatoslav Khukhlaev, Stanislav Babak General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) The future space-based gravitational wave observatory, the Laser Interferometer Space Antenna, is expected to observe between 1-1000s extreme mass-ratio inspirals (EMRIs) per year. Due to the simultaneous presence of other gravitational wave signals in the data, it can be challenging to detect EMRIs and accurately estimate their parameters. In this work, we investigate the interaction between a gravitational signal from an EMRI and millions of signals from inspiralling Galactic white dwarf binaries. We demonstrate that bright Galactic binaries can contaminate the detection and characterization of EMRIs. We perform Bayesian inference of EMRI parameters after removing resolvable Galactic binaries and confirm an accuracy comparable to that expected in Gaussian noise.",
      "pdf_url": "https://arxiv.org/pdf/2509.20062.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2510.11900",
      "title": "Non-linear causal bulk viscosity in Unified Dark Matter Cosmologies",
      "authors": [
        "Guillermo Palma",
        "Gabriel Gomez"
      ],
      "abstract": "Non-linear causal bulk viscosity in Unified Dark Matter Cosmologies Guillermo Palma, Gabriel Gomez 29 pages, 18 figures. Subsection IVC, discussing physical differences between the non-linear framework employed here and the linear IS theory, has been added. Accepted for publication in EPJC General Relativity and Quantum Cosmology (gr-qc) We propose a bulk viscous unified dark matter scenario based on a nonlinear extension of the full causal Israel-Stewart theory. This framework allows the viscous fluid to remain far from equilibrium, an essential feature for a physically consistent description of viscosity-driven accelerated expansion. We adopt the standard parametrization for the bulk viscosity, $\\xi = \\xi_{0} \\rho_{m}^{s}$, treating $s$ as a free parameter (in contrast to most previous works), and study the model in a spatially flat Friedmann-Robertson-Walker background. By reformulating the cosmological equations as an autonomous dynamical system, we obtain both asymptotic analytical solutions and a numerical characterization of the phase space. At early times, the viscous component can mimic a stiff fluid, while at intermediate epochs it behaves like dark matter. With a suitable choice of dynamical variables, the system admits three distinct classes of late-time attractors. Two of them are separated by a basin-boundary saddle point: (i) a generic quintessence solution for $s = 1/2$, which encompasses a de Sitter-like behavior when $\\xi_{0}$ satisfies a specific relation involving the nonlinear parameters; (ii) a global exact de Sitter attractor for $s < 1/2$; and (iii) a phantom-like solution that emerges for $s \\ge 1/2$. In contrast to the generic $s \\ne 1/2$ case, the $s = 1/2$ scenario exhibits a qualitatively different stability structure, allowing de Sitter and phantom attractors to coexist. All solutions respect entropy production, and cosmic acceleration emerges independently of $\\xi_{0}$, relaxing the strong bounds $\\xi_{0} \\sim \\mathcal{O}(1)$ required in Eckart-based viscous models.",
      "pdf_url": "https://arxiv.org/pdf/2510.11900.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.12580",
      "title": "Dynamical Tidal Response of Non-rotating Black Holes: Connecting the MST Formalism and Worldline EFT",
      "authors": [
        "Hajime Kobayashi",
        "Shinji Mukohyama",
        "Naritaka Oshita",
        "Kazufumi Takahashi",
        "Vicharit Yingcharoenrat"
      ],
      "abstract": "Dynamical Tidal Response of Non-rotating Black Holes: Connecting the MST Formalism and Worldline EFT Hajime Kobayashi, Shinji Mukohyama, Naritaka Oshita, Kazufumi Takahashi, Vicharit Yingcharoenrat 39 pages, v2: typos were corrected and improvements made General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The response of a black hole (BH) to tidal forces encodes key information about the underlying gravitational theory and affects the waveform of gravitational waves emitted during binary inspiral processes. In this paper, we analyze the dynamical tidal response of static and spherically symmetric BHs in a low-frequency regime within general relativity (GR), based on a matching between the Mano-Suzuki-Takasugi (MST) methods for an analytical approach to BH perturbations and the worldline effective field theory (EFT) for an efficient and unified computation of the binary dynamics within the post-Newtonian regime. We show that the renormalized tidal response function is subject to inevitable ambiguities associated with the choice of renormalization scheme and with the initial condition of the renormalization flow equation. Once these ambiguities are fixed, we obtain scheme-dependent dynamical tidal Love numbers. We also discuss possible extensions of our formalism, including generic non-rotating compact objects (e.g., neutron stars) in GR and BHs in theories beyond GR.",
      "pdf_url": "https://arxiv.org/pdf/2511.12580.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.20393",
      "title": "Multiscalar-metric gravity: merging gravity, dark energy and dark matter",
      "authors": [
        "Yu.F. Pirogov",
        "O.V. Zenin"
      ],
      "abstract": "Multiscalar-metric gravity: merging gravity, dark energy and dark matter Yu.F. Pirogov, O.V. Zenin 8 pages; reported at the 22nd Lomonosov Conference on Elementary Particle Physics, Moscow, Russia, August 21-27, 2025. The 2nd version includes a refined condition for ${f^b}^λ$ next to Eq.(23) General Relativity and Quantum Cosmology (gr-qc) The status of a modification of General Relativity (GR) -- Spontaneously Broken Relativity (SBR) -- for merging gravity, dark energy (DE) and dark matter (DM) is presented. The modification is principally grounded on a multiscalar-metric concept of spacetime endowed with two dynamical structures: a basic metric and a set of the reversible multiscalar fields. The latter ones serve geometrically as exceptional dynamical coordinates among arbitrary kinematical/observer's ones and physically as a kind of gravitational Higgs fields producing possible spontaneous breaking of the symmetry (SSB) of relativity. The effective field theory (EFT) of the extended gravity based on the multiscalar-metric spacetime -- the metagravity -- is discussed and some of its particular realizations beyond GR as SBR are explicated. Physically, SBR results in appearance of massive tensor and scalar gravitons. Some of the emerging consequences, problems and prospects for SBR for future deeper unification of gravity with matter in the context of the relativity and internal symmetries breaking are shortly discussed.",
      "pdf_url": "https://arxiv.org/pdf/2511.20393.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.00926",
      "title": "Non-singular cosmologies matching regular black holes",
      "authors": [
        "Shulan Li",
        "Jian-Pin Wu",
        "Xian-Hui Ge"
      ],
      "abstract": "Non-singular cosmologies matching regular black holes Shulan Li, Jian-Pin Wu, Xian-Hui Ge General Relativity and Quantum Cosmology (gr-qc) We construct a new non-singular cosmological model matched to a Minkowski-core regular black hole by means of a modified Oppenheimer--Snyder framework. Its dynamics is studied in both dust-only and scalar-field scenarios, and compared with that of two other non-singular models as well as the classical standard cosmology. The results show that, although all three non-singular cosmologies share identical late-time behavior and allow for a natural embedding of inflation in the scalar-field setting, they exhibit qualitatively distinct non-singular features at very early times. In particular, the new cosmology approaches Minkowski spacetime in the limits of both the infinite past and the infinite future, thereby manifesting an intriguing symmetry between the two asymptotic regimes.",
      "pdf_url": "https://arxiv.org/pdf/2512.00926.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.03832",
      "title": "Some perspective of thermodynamical and optical properties of black holes in Maxwell-dilaton-dRGT-like massive gravity",
      "authors": [
        "B. Eslam Panah",
        "N. Heidari",
        "M. Soleimani"
      ],
      "abstract": "Some perspective of thermodynamical and optical properties of black holes in Maxwell-dilaton-dRGT-like massive gravity B. Eslam Panah, N. Heidari, M. Soleimani General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) Motivated by integrating the dilaton field (as a UV correction) with dRGT-like massive gravity (as an IR correction) into Einstein gravity, we investigate the thermodynamic and optical properties of black holes within this gravitational framework. We begin by reviewing the black hole solutions in Maxwell-dilaton-dRGT-like massive gravity, followed by an analysis of how various parameters influence on the asymptotical behavior of the spacetime and the event horizon of these black holes. In the subsequent section, we examine the conserved and thermodynamic quantities associated with these black holes, paying particular attention to the effects of parameters like $\\beta$, $\\alpha$, and the massive parameters ($\\eta_{1}$ and $\\eta_{2}$) on their local stability by simultaneously evaluating the heat capacity and temperature. We also adopt an alternative method to study phase transitions using geometrothermodynamics. Furthermore, we explore how the parameters of Maxwell-dilaton-dRGT-like massive gravity impacts the optical characteristics and radiative behavior of black holes. In particular, we analyze the effects of the dilaton coupling constant ($\\alpha$), charge ($q$), the massive gravity parameter ($\\eta_1$), and the graviton mass ($m_g$) on the radius of the photon sphere and the resulting black hole shadow. Moreover, the theoretical shadow radius is compared to the observational data from $Sgr A^*$. Additionally, we investigate the energy emission rate of these black holes, revealing that these parameters substantially influence the emission peak.",
      "pdf_url": "https://arxiv.org/pdf/2512.03832.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2512.05147",
      "title": "Images from disk and spherical accretions of Bardeen black hole surrounded by perfect fluid dark matter",
      "authors": [
        "Hui Zeng",
        "Yuan Meng"
      ],
      "abstract": "Images from disk and spherical accretions of Bardeen black hole surrounded by perfect fluid dark matter Hui Zeng, Yuan Meng General Relativity and Quantum Cosmology (gr-qc) In this paper, we investigate the shadow and optical appearance of the Bardeen black hole surrounded by perfect fluid dark matter (PFDM) illuminated by various static accretions. First, we find that as the dark matter parameter $\\left|\\alpha\\right|$ increases, the fundamental characteristic quantities of the black hole, the event horizon $r_h$, the photon sphere radius $r_{ph}$, and the critical impact parameter $b_{ph}$ all increase, while the peak of the effective potential $V_{\\text{eff}}$ decreases and shifts toward the direction of increasing $r$. In contrast, the magnetic charge parameter $g$ suppresses $r_h$, $r_{ph}$, and $b_{ph}$, while increases the peak of $V_{\\text{eff}}$ and shifts it toward the direction of decreasing $r$. This indicates a competing effect between the dark matter parameter $\\left|\\alpha\\right|$ and the magnetic charge parameter $g$ on the fundamental properties of the black hole. Furthermore, we use the EHT observational data to constrain the dark matter parameters $\\alpha$ and find that the constraint range given by the supermassive black hole SgrA* is stricter than that of the black hole M87*. Finally, we investigate black hole images under different accretion models. The results reveal that both dark matter parameters $\\alpha$ and accretion models significantly influence the black hole images. For larger dark matter parameters $\\left|\\alpha\\right|$, the inner shadow or central faint illuminating region of the Bardeen black hole surrounded by PFDM is larger, but the bright ring of the image is fainter. This provides a potential method for us to distinguish between classical Bardeen black holes and Bardeen black holes surrounded by PFDM. These preliminary results may provide some clues for future investigations of dark matter using black hole shadows and images.",
      "pdf_url": "https://arxiv.org/pdf/2512.05147.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.22024",
      "title": "Observation of entanglement in a cold atom analog of cosmological preheating",
      "authors": [
        "Victor Gondret",
        "Clothilde Lamirault",
        "Rui Dias",
        "Léa Camier",
        "Amaury Micheli",
        "Charlie Leprince",
        "Quentin Marolleau",
        "Jean-René Rullier",
        "Scott Robertson",
        "Denis Boiron",
        "Christoph I. Westbrook"
      ],
      "abstract": "Observation of entanglement in a cold atom analog of cosmological preheating Victor Gondret, Clothilde Lamirault, Rui Dias, Léa Camier, Amaury Micheli, Charlie Leprince, Quentin Marolleau, Jean-René Rullier, Scott Robertson, Denis Boiron, Christoph I. Westbrook 4+5 pages, 4 figures, accepted version Phys. Rev. Lett. 135, 240603 (2025) Quantum Gases (cond-mat.quant-gas); General Relativity and Quantum Cosmology (gr-qc); Pattern Formation and Solitons (nlin.PS); Quantum Physics (quant-ph) We observe entanglement between collective excitations of a Bose-Einstein condensate in a configuration analogous to particle production during the preheating phase of the early universe. In our setup, the oscillation of the inflaton field is mimicked by the transverse breathing mode of a cigar-shaped condensate, which parametrically excites longitudinal quasiparticles with opposite momenta. After a short modulation period, we observe entanglement of these pairs which reveals the role played by vacuum fluctuations in seeding the parametric growth, confirming the quantum origin of the excitations. As the system continues to evolve, we observe a decrease in correlations and a disappearance of non-classical features. These point towards future experimental probes of the late-time nonlinear regime where further analogies can be drawn with reheating, i.e. the thermalization of the post-inflationary Universe.",
      "pdf_url": "https://arxiv.org/pdf/2506.22024.pdf",
      "categories": [
        "gr-qc",
        "nlin.PS",
        "quant-ph"
      ],
      "is_gw_related": false
    }
  ]
}