{
  "date": "2025-09-10",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 33,
  "gw_related_papers": 11,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2509.07007",
      "title": "Conformal Invariance and Phase Transitions: Implications for Stable Black Hole Horizons?",
      "authors": [
        "Pradosh Keshav MV",
        "Arun Kenath"
      ],
      "abstract": "Conformal Invariance and Phase Transitions: Implications for Stable Black Hole Horizons? Pradosh Keshav MV, Arun Kenath (Christ University, Bangalore) Gravitation and Cosmology, 31, 326-335 (2025) General Relativity and Quantum Cosmology (gr-qc) The behavior of black hole horizons under extreme conditions-such as near collapse or phase transitions-remains less understood, particularly in the context of soft hair and Aretakis instabilities. We show that the breakdown of conformal symmetry during the balding phase induces a topological reorganization of the horizon, leading to divergent entropy corrections and emergent pressure terms. These corrections exhibit universal scaling laws, analogous to quantum phase transitions in condensed matter systems, with extremal limits functioning as quantum critical points. Interestingly, by employing quasi-equilibrium boundary conditions, one could stabilize horizon dynamics without explicitly introducing ad hoc higher-order corrections, further limiting the universal applicability of conformal invariance in black hole physics.",
      "pdf_url": "https://arxiv.org/pdf/2509.07007.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07035",
      "title": "Coherent quantum work extraction of a relativistic battery as a probe for acceleration-induced Unruh thermality",
      "authors": [
        "Wei-Wei Zhang",
        "Tian-Xi Ren",
        "Yin-Zhong Wu",
        "Xiang Hao"
      ],
      "abstract": "Coherent quantum work extraction of a relativistic battery as a probe for acceleration-induced Unruh thermality Wei-Wei Zhang, Tian-Xi Ren, Yin-Zhong Wu, Xiang Hao General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We propose a physical scheme of a uniformly accelerated Unruh-DeWitt battery and utilize quantum work extraction as a probe to witness the thermal nature of the Unruh effect induced by the accelerated motion. By employing the open quantum system approach, we analyze the coherent and incoherent components of the ergotropy which is the maximum amount of quantum work extraction of the relativistic battery driven by a coherent field. It has been proved that the steady values of coherent quantum work extraction in the asymptotic condition is only determined by the acceleration-dependent Unruh temperature. The asymptotic behavior of coherent ergotropy can demonstrate the thermal nature of the Unruh effect with respect to the Kubo-Martin-Schwinger condition. Under the circumstance of the Unruh effect, we explore the effect of the phase of the coherent charging field on the dynamics of coherent ergotropy when the battery approaches to the same thermal equilibrium state. The variation in the phase of the coherent driving field can improve the energy storage capacity of a relativistic battery. From viewpoint of energy transfer, the relativistic battery is helpful to examine the Unruh thermality.",
      "pdf_url": "https://arxiv.org/pdf/2509.07035.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07052",
      "title": "Exact solution of the DeWitt-Brehme-Hobbs equation in copropagating electromagetic and gravitational waves",
      "authors": [
        "Giulio Audagnotto",
        "Antonino Di Piazza"
      ],
      "abstract": "Exact solution of the DeWitt-Brehme-Hobbs equation in copropagating electromagetic and gravitational waves Giulio Audagnotto, Antonino Di Piazza General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Phenomenology (hep-ph) An accelerated charge interacts with itself through the electromagnetic field that it sources, a phenomenon known as electromagnetic radiation reaction. The DeWitt-Brehme-Hobbs (DWBH) equation describes the motion of a charged mass in the presence of combined electromagnetic and gravitational fields, taking into account electromagnetic radiation-reaction effects. Here, we find the first exact analytical solution of the DWBH equation in the case of a charged mass in the presence of copropagating and otherwise arbitrary electromagnetic and gravitational plane waves. Apart from its intrinsic importance, this solution approximates that of an ultrarelativistic particle in arbitrary gravitational and electromagnetic fields. Finally, the paradigmatic example of a sinusoidal electro-magnetic wave in the presence of a constant-amplitude gravitational wave is worked out explicitly and it shows how the presence of the gravitational wave can qualitatively change electromagnetic radiation-reaction effects.",
      "pdf_url": "https://arxiv.org/pdf/2509.07052.pdf",
      "categories": [
        "gr-qc",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07061",
      "title": "Near-Extremal Black Holes in Modified Gravity via Spectral Methods",
      "authors": [
        "Kelvin Ka-Ho Lam",
        "Adrian Ka-Wai Chung",
        "Nicolás Yunes"
      ],
      "abstract": "Near-Extremal Black Holes in Modified Gravity via Spectral Methods Kelvin Ka-Ho Lam, Adrian Ka-Wai Chung, Nicolás Yunes 5 pages of main text, 2 figures General Relativity and Quantum Cosmology (gr-qc) Rapidly-rotating black-hole spacetimes outside general relativity are key to many tests of Einstein's theory. We here develop an efficient spectral method to represent such spacetimes analytically, in closed-form, and to high accuracy, in a large class of effective-field-theory extensions of general relativity. We exemplify this method by constructing, for the first time, closed-form and analytic representations of spinning black holes in scalar-Gauss-Bonnet, dynamical Chern-Simons, and axidilaton gravity to an accuracy better than $10^{-8}$ for all dimensionless spins below 0.99.",
      "pdf_url": "https://arxiv.org/pdf/2509.07061.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07096",
      "title": "The thermodynamics of readout devices and semiclassical gravity",
      "authors": [
        "Samuel Fedida",
        "Adrian Kent"
      ],
      "abstract": "The thermodynamics of readout devices and semiclassical gravity Samuel Fedida, Adrian Kent General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) We analyse the common claim that nonlinear modifications of quantum theory necessarily violate the second law of thermodynamics. We focus on hypothetical extensions of quantum theory that contain readout devices. These black boxes provide a classical description of quantum states without perturbing them. They allow quantum state cloning, though in a way consistent with the relativistic no-signalling principle. We review the existence of such devices in the context of Moller-Rosenfeld semiclassical gravity, which postulates that the gravitational field remains classical and is sourced by the expectation value of a quantum energy-momentum tensor. We show that the definition of information in the models examined in this paper deviates from that given by von Neumann entropy, and that claims of second law violations based on the distinguishability of non-orthogonal states or on violations of uncertainty principles fail to hold in such theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.07096.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07111",
      "title": "Ringdown mode amplitudes of charged binary black holes",
      "authors": [
        "Zexin Hu",
        "Daniela D. Doneva",
        "Ziming Wang",
        "Vasileios Paschalidis",
        "Gabriele Bozzola",
        "Stoytcho S. Yazadjiev",
        "Lijing Shao"
      ],
      "abstract": "Ringdown mode amplitudes of charged binary black holes Zexin Hu, Daniela D. Doneva, Ziming Wang, Vasileios Paschalidis, Gabriele Bozzola, Stoytcho S. Yazadjiev, Lijing Shao General Relativity and Quantum Cosmology (gr-qc) The ringdown phase of the binary black hole (BBH) merger provides a clean and direct probe of strong-field gravity and tests of the nature of black holes. The quasinormal mode (QNM) frequencies in modified gravity theories, as well as their amplitudes and phases, might deviate from the Kerr ones in general relativity. Charged black holes (BHs) in Einstein-Maxwell theory provide an excellent example of a beyond-Kerr solution with direct astrophysical and fundamental physics applications. In this work, we extract the ringdown mode amplitudes and phases for charged BBH mergers based on fully general relativistic simulations with charge-to-mass ratio up to 0.3. Our results suggest that even though the inspiral phase of charged BBHs can be significantly accelerated or decelerated, the ringdown mode excitation only changes mildly. We further explore the charge detectability with the ringdown-only signal for the Einstein Telescope and Cosmic Explorer. We find that previous studies may have overestimated the charge detectability and including higher modes in charged waveforms is necessary for future ringdown analysis. This constitutes the first such analysis based on waveforms generated by numerical relativity simulations of charged BHs in full Einstein-Maxwell theory.",
      "pdf_url": "https://arxiv.org/pdf/2509.07111.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07136",
      "title": "Self-similar collapse with elasticity",
      "authors": [
        "Jorge V. Rocha",
        "Diogo L. F. G. Silva"
      ],
      "abstract": "Self-similar collapse with elasticity Jorge V. Rocha, Diogo L. F. G. Silva General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Theory (hep-th) Critical collapse is a well-studied subject for a variety of self-gravitating matter. One of the most intensively examined models is that of perfect fluids, which have been used extensively to describe compact objects such as stars, as well as being of cosmological interest. However, neutron stars are believed to possess an elastic crust, thus departing from a perfect fluid body, and critical collapse with elastic materials is an entirely unexplored topic. In this work, we employ a scale-invariant elastic matter model to study self-similar collapse with elasticity. As with perfect fluid models, we show that including elasticity allows for continuous self-similar configurations, which we determine numerically by solving the associated boundary value problem. The set of solutions is discrete and we focus on the fundamental mode, but also present some results for overtones. Similarly to the perfect fluid case, the existence of a sonic point plays a central role. We find that the addition of elasticity, by either increasing the shear index $\\mathrm{s}$ or decreasing the Poisson ratio $\\nu$, leads to an increase in compressibility and can yield negative radial pressures around the sonic point. Simultaneously, the elastic longitudinal wave speed ceases to be constant, while the two possible transverse wave speeds grow further apart. The departure from the perfect fluid case can be so dramatic as to generate a second sonic point, which does not seem to be regular. This, in turn, imposes bounds on the elasticity parameters of the material. This study represents the first step in the analysis of critical collapse with elastic materials.",
      "pdf_url": "https://arxiv.org/pdf/2509.07136.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07235",
      "title": "Critical Masses and Numerical Computation of Massive Scalar Quasinormal Modes in Schwarzschild Black Holes",
      "authors": [
        "Matheus F. S. Alves",
        "Bruno P. Pônquio",
        "L.G. Medeiros"
      ],
      "abstract": "Critical Masses and Numerical Computation of Massive Scalar Quasinormal Modes in Schwarzschild Black Holes Matheus F. S. Alves, Bruno P. Pônquio, L.G. Medeiros General Relativity and Quantum Cosmology (gr-qc) We present a comprehensive analysis of the quasinormal modes (QNMs) of a massive scalar field in Schwarzschild spacetime using two complementary numerical techniques: the Hill-determinant method and Leaver continued-fraction method. Our study systematically compares the performance, convergence, and consistency of the two approaches across a wide range of field masses and angular momenta. We identify three critical mass thresholds, $m_{\\rm lim}$, $m_{\\rm max}$, and $m_{zd}$, which govern qualitative changes in the QNM spectrum. In particular, long-lived modes emerge at $m_{zd}$, where the imaginary part of the frequency vanishes and the mode becomes essentially non-decaying. This phenomenon is robust across multipoles and may have important implications for the phenomenology of massive fields around black holes. Our results provide a detailed numerical characterization of massive scalar QNMs and highlight the complementary strengths of the Hill-determinant and continued-fraction methods, paving the way for future studies of rotating or charged black holes and quasi-bound states.",
      "pdf_url": "https://arxiv.org/pdf/2509.07235.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07291",
      "title": "Parameter control for binary black hole initial data",
      "authors": [
        "Iago B. Mendes",
        "Nils L. Vu",
        "Oliver Long",
        "Harald P. Pfeiffer",
        "Robert Owen"
      ],
      "abstract": "Parameter control for binary black hole initial data Iago B. Mendes, Nils L. Vu, Oliver Long, Harald P. Pfeiffer, Robert Owen General Relativity and Quantum Cosmology (gr-qc) When numerically solving Einstein's equations for binary black holes (BBH), we must find initial data on a three-dimensional spatial slice by solving constraint equations. The construction of initial data is a multi-step process, in which one first chooses freely specifiable data that define a conformal background and impose boundary conditions. Then, one numerically solves elliptic equations and calculates physical properties such as horizon masses, spins, and asymptotic quantities from the solution. To achieve desired properties, one adjusts the free data in an iterative ``control'' loop. Previous methods for these iterative adjustments rely on Newtonian approximations and do not allow the direct control of total energy and angular momentum of the system, which becomes particularly important in the study of hyperbolic encounters of black holes. Using the $\\texttt{SpECTRE}$ code, we present a novel parameter control procedure that benefits from Broyden's method in all controlled quantities. We use this control scheme to minimize drifts in bound orbits and to enable the construction of hyperbolic encounters. We see that the activation of off-diagonal terms in the control Jacobian gives us better efficiency when compared to the simpler implementation in the Spectral Einstein Code ($\\texttt{SpEC}$). We demonstrate robustness of the method across extreme configurations, including spin magnitudes up to $\\chi = 0.9999$, mass ratios up to $q = 50$, and initial separations up to $D_0 = 1000M$. Given the open-source nature of $\\texttt{SpECTRE}$, this is the first time a parameter control scheme for constructing bound and unbound BBH initial data is available to the numerical-relativity community.",
      "pdf_url": "https://arxiv.org/pdf/2509.07291.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07317",
      "title": "Neglected solutions in quadratic gravity",
      "authors": [
        "Breno L. Giacchini",
        "Ivan Kolář"
      ],
      "abstract": "Neglected solutions in quadratic gravity Breno L. Giacchini, Ivan Kolář General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We report on several previously overlooked families of static spherically symmetric solutions in quadratic gravity. Our main result concerns the existence of solutions whose leading exponents depend on the ratio ${\\omega=\\alpha/(3\\beta)}$ of the four-derivative couplings. We demonstrate that the space of models with ${\\omega >1}$ contains a dense set that admits non-Frobenius solutions ${(s_*, 2 - 3 s_*)_0}$ (in standard Schwarzschild coordinates), with certain rational numbers $s_*(\\omega)$. These solutions correspond to a singular core at ${\\bar{r}=0}$. Another related non-Frobenius family, $(s_*, 2 - 3 s_*)_\\infty$, exists for a dense set of models with ${1/4 < \\omega < 1}$, describing a singular boundary at ${\\bar{r}\\to\\infty}$. Both families are uncovered by recasting the metric into special coordinates in which the solutions become Frobenius. Additionally, for models with any real ratios ${\\omega\\neq 1}$ we identify two novel families of non-Frobenius solutions around generic points ${\\bar{r}=\\bar{r}_0}$, $(3/2, 0)_{\\bar{r}_0, 1/4}$ and $(3/2, 0)_{\\bar{r}_0, 1/2}$ describing a wormhole throat. Finally, we re-derive and summarize all known families of solutions in the standard as well as in modified Schwarzschild coordinates.",
      "pdf_url": "https://arxiv.org/pdf/2509.07317.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07333",
      "title": "The bound orbits and gravitational waveforms of timelike particles around renormalization group improved Kerr black holes",
      "authors": [
        "Yong-Zhuang Li",
        "Xiao-Mei Kuang"
      ],
      "abstract": "The bound orbits and gravitational waveforms of timelike particles around renormalization group improved Kerr black holes Yong-Zhuang Li, Xiao-Mei Kuang 15 pages,12 figures, comments and suggestions are welcome General Relativity and Quantum Cosmology (gr-qc) In this article, we investigate the bound orbits of the timelike particles and the gravitational waveforms emitted from these orbits around a renormalization group improved Kerr black hole in the framework of the asymptotic safety approach. The running Newton coupling in the metric is characterized by two free quantum parameters $(\\omega,\\,\\gamma)$ arsing from the non-perturbative renormalization group theory and the appropriate cutoff identification, respectively. As expected, the radii of the horizon, the marginally bound orbits and the innermost stable orbit are all decrease as the quantum parameters increase. Under the extreme mass-ratio inspirals approximation the deviation of gravitational waveforms radiated by the periodic orbits from those in the classical Kerr background increases with the two quantum parameter. However, this effect is much smaller in the retrograde case compared to the prograde case. Especially, by comparing the characteristic strain of those gravitational wave with the sensitivity curve of several potential detectors, we find that their characteristic frequencies can fall within the sensitivity ranges of several planned gravitational wave observatories, suggesting that such signals may be detectable with sufficient instrumental sensitivity.",
      "pdf_url": "https://arxiv.org/pdf/2509.07333.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07348",
      "title": "GW230814: investigation of a loud gravitational-wave signal observed with a single detector",
      "authors": [
        "The LIGO Scientific Collaboration",
        "The Virgo Collaboration",
        "The Kagra Collaboration",
        "Others"
      ],
      "abstract": "GW230814: investigation of a loud gravitational-wave signal observed with a single detector The LIGO Scientific Collaboration, The Virgo Collaboration, The Kagra Collaboration, Others As part of the Astrophysical Journal Letters Focus Issue on the Gravitational Wave Transient Catalog General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE) GW230814 was detected by the LIGO Livingston observatory with a signal-to-noise ratio of 42.4 making it the loudest gravitational-wave signal in the GWTC-4.0 catalog. The source is consistent with a binary black hole coalescence similar to those in the previously observed population, with component masses $m_1 = 33.7^{+2.9}_{-2.2}$ $\\mathrm{M}_\\odot$, $m_2 = 28.2^{+2.2}_{-3.1} M_\\odot$, and small effective inspiral spin $\\chi_{\\mathrm{eff}}= -0.01^{+0.06}_{-0.07}$. The high signal-to-noise ratio enabled us to confidently detect an $\\ell = |m| = 4$ mode in the inspiral signal for the first time, and enables a range of tests of consistency between theoretical predictions and the observed waveform. Most of these tests show good agreement with expectations from general relativity. However, a few indicate deviations, particularly in the ringdown part of the signal. We find that deviations comparable to those observed can be obtained from similar simulated signals based on general relativity and detector noise effects. Therefore, the apparent deviations do not provide evidence for a violation of general relativity. The observation of GW230814 demonstrates that while the unprecedented sensitivity of the detectors enable highly significant detections with a single observatory, drawing robust inferences about fundamental physics remains limited without data from a multiple observatory network.",
      "pdf_url": "https://arxiv.org/pdf/2509.07348.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07352",
      "title": "Directed searches for gravitational waves from ultralight vector boson clouds around merger remnant and galactic black holes during the first part of the fourth LIGO-Virgo-KAGRA observing run",
      "authors": [
        "The LIGO Scientific Collaboration",
        "the Virgo Collaboration",
        "the KAGRA Collaboration"
      ],
      "abstract": "Directed searches for gravitational waves from ultralight vector boson clouds around merger remnant and galactic black holes during the first part of the fourth LIGO-Virgo-KAGRA observing run The LIGO Scientific Collaboration, the Virgo Collaboration, the KAGRA Collaboration General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Phenomenology (hep-ph) We present the first directed searches for long-transient and continuous gravitational waves from ultralight vector boson clouds around known black holes (BHs). We use LIGO data from the first part of the fourth LIGO-Virgo-KAGRA observing run. The searches target two distinct types of BHs and use two new semicoherent methods: hidden Markov model (HMM) tracking for the remnant BHs of the mergers GW230814_230901 and GW231123_135430 (referred to as GW230814 and GW231123 in this study), and a dedicated method using the Band Sampled Data (BSD) framework for the galactic BH in the Cygnus X-1 binary system. Without finding evidence of a signal from vector bosons in the data, we estimate the mass range that can be constrained. For the HMM searches targeting the remnants from GW231123 and GW230814, we disfavor vector boson masses in the ranges $[0.94, 1.08]$ and $[2.75, 3.28] \\times 10^{-13}$ eV, respectively, at 30% confidence, assuming a 1% false alarm probability. Although these searches are only marginally sensitive to signals from merger remnants at relatively large distances, future observations are expected to yield more stringent constraints with high confidence. For the BSD search targeting the BH in Cygnus X-1, we exclude vector boson masses in the range $[0.85, 1.59] \\times 10^{-13}$ eV at 95% confidence, assuming an initial BH spin larger than 0.5.",
      "pdf_url": "https://arxiv.org/pdf/2509.07352.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07427",
      "title": "Ultra-relativistic journeys through compact astrophysical objects",
      "authors": [
        "Shahar Hod"
      ],
      "abstract": "Ultra-relativistic journeys through compact astrophysical objects Shahar Hod General Relativity and Quantum Cosmology (gr-qc) It has recently been proved that, for constant density stars, there is a critical value $\\Lambda^{*}=1$ for the dimensionless density parameter $\\Lambda\\equiv 4\\pi R^2\\rho_{\\text{max}}$ of the star above which the asymptotically measured travel time $T_{\\text{s}}$ along a semi-circular trajectory that connects two antipodal points on the surface of the star is {\\it shorter} than the travel time $T_{\\text{c}}$ along the (shorter) straight-line trajectory that connects the two antipodal points through the center of the compact star [here $\\{R,\\rho_{\\text{max}}\\}$ are respectively the radius and the maximum density of the compact astrophysical object]. This intriguing observation provides a nice illustration of the general relativistic time dilation (redshift) effect in highly curved spacetimes. One expects that generic compact astrophysical objects whose dimensionless density parameters are smaller than some critical value $\\Lambda^*$ would be characterized by the `normal' relation $T_{\\text{c}}\\leq T_{\\text{s}}$ for the travel times between the two antipodal points. Motivated by this expectation, in the present paper we prove, using analytical techniques, that spherically symmetric compact astrophysical objects whose dimensionless density parameters are bounded from above by the model-independent relation $\\Lambda\\leq\\Lambda^*={3\\over2}[1-({{2}\\over{\\pi}})^{2/5}]$ are always (regardless of their inner density profiles) characterized by the normal dimensionless ratio $T_{\\text{c}}/T_{\\text{s}}\\leq1$.",
      "pdf_url": "https://arxiv.org/pdf/2509.07427.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07601",
      "title": "Covariant Carrollian Electric and Magnetic Limits of General Relativity",
      "authors": [
        "Tanmay Patil",
        "S. Shankaranarayanan"
      ],
      "abstract": "Covariant Carrollian Electric and Magnetic Limits of General Relativity Tanmay Patil, S. Shankaranarayanan (IIT Bombay) 39 Pages, 1 Table; Comments welcome General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) The Carrollian limit ($c \\to 0$) of General Relativity provides the geometric language for describing null hypersurfaces, such as black hole event horizons and null infinity. Motivated by the well-established electric and magnetic limits of Galilean electromagnetism, we perform a systematic analysis of the low-velocity limit of linearized gravity to derive its Carrollian counterparts. Using a 1+3 covariant decomposition, we study the transformation properties of linear tensor perturbations (gravitational waves) on a Friedmann-Lemaitre-Robertson-Walker background under Carrollian boosts. We demonstrate that, analogous to the electromagnetic case, the full set of linearized Einstein's equations is not Carrollian-invariant. Instead, the theory bifurcates into two distinct and consistent frameworks: a Carrollian Electric Limit and a Carrollian Magnetic Limit. In the electric limit, dynamics are frozen, leaving a static theory of tidal forces ($E_{ab}$) constrained by the matter distribution. In contrast, the Magnetic Limit yields a consistent dynamical theory where the magnetic part of the Weyl tensor ($H_{ab}$), which governs gravito-magnetic and radiative effects, remains well-defined and is sourced by the spacetime shear. This framework resolves ambiguities in defining Carrollian gravity and provides a robust theory for gravito-magnetic dynamics in ultra-relativistic regimes. Our results have direct implications for the study of black hole horizons, gravitational memory, and the holographic principle.",
      "pdf_url": "https://arxiv.org/pdf/2509.07601.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07656",
      "title": "Bifurcation and Critical Phenomena in Black Hole Thermodynamics",
      "authors": [
        "Bidyut Hazarika",
        "Prabwal Phukon"
      ],
      "abstract": "Bifurcation and Critical Phenomena in Black Hole Thermodynamics Bidyut Hazarika, Prabwal Phukon Accepted for publication in EPJC General Relativity and Quantum Cosmology (gr-qc) In this work, we treat black holes as bifurcation points and explore their thermodynamic phase structure using the framework of bifurcation theory which is a commonly used method from nonlinear dynamics. By constructing an appropriate bifurcating function, we analyze how black holes transition between different thermodynamic phases through changes in the number and stability of fixed points. Our study shows that stable fixed points correspond to thermodynamically stable black hole states, while unstable ones indicate instability and decay. The dynamical evolution of the system further supports this correspondence, with stable configurations approaching equilibrium and unstable ones diverging from it.",
      "pdf_url": "https://arxiv.org/pdf/2509.07656.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07682",
      "title": "Motion of spinning particles around a quantum-corrected black hole without Cauchy horizons",
      "authors": [
        "Jiawei Chen",
        "Jinsong Yang"
      ],
      "abstract": "Motion of spinning particles around a quantum-corrected black hole without Cauchy horizons Jiawei Chen, Jinsong Yang General Relativity and Quantum Cosmology (gr-qc) In this paper, we investigate the motion of spinning particles around a covariant quantum-corrected black hole without a Cauchy horizon within the framework of effective quantum gravity, and examine the influence of quantum gravitational effects on the motion of these spinning particles. First, we employ the Mathisson-Papapetrou-Dixon equations to derive the 4-momentum and 4-velocity of spinning particles, and introduce the effective potential for radial motion using the components of the 4-momentum. We find that an increase in the quantum parameter $\\zeta$ leads to a decrease in the effective potential, while the spin $S$ significantly affects the magnitude of the effective potential. Then, through the effective potential, we investigate the properties of circular orbits and the innermost stable circular orbit, and discuss the timelike condition that spinning particles must satisfy when moving around the black hole. Finally, we study the trajectories of spinning particles on bound orbits around the quantum-corrected black hole and compare them with those around other covariant quantum-corrected black holes. The results show that the trajectories of spinning particles in this quantum-corrected black hole model are weakly influenced by $\\zeta$, making them almost indistinguishable from those in the Schwarzschild black hole, but they can be distinguished from other covariant quantum-corrected models under certain initial conditions. These results contribute to our understanding of black hole properties under quantum corrections.",
      "pdf_url": "https://arxiv.org/pdf/2509.07682.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07686",
      "title": "Gravitational Lensing and Topological Photon Sphere of Holonomy Corrected Schwarzschild Black Hole with a Cloud of Strings",
      "authors": [
        "Faizuddin Ahmed",
        "Shubham Kala"
      ],
      "abstract": "Gravitational Lensing and Topological Photon Sphere of Holonomy Corrected Schwarzschild Black Hole with a Cloud of Strings Faizuddin Ahmed, Shubham Kala 22 pages, 15 figures, 1 table, Comments are welcome General Relativity and Quantum Cosmology (gr-qc) In this paper, we theoretically investigate the deflection of light, lensing equations, topological properties of photon rings, and accretion disk characteristics in the spacetime of a holonomy-corrected Schwarzschild black hole surrounded by a cloud of strings. The analysis is carried out in the weak-field limit, where we analytically derive expressions for the deflection angle and extract the corresponding lensing observables. These results reveal the dependence of light deflection on the string cloud parameter and the holonomy correction parameter, offering potential observational signatures of underlying quantum gravity effects. We model possible gravitational scenarios to explore the distinguishing features of this modified BH geometry and assess its deviation from classical solutions through gravitational lensing behavior. Furthermore, we analyze the topological structure of the photon sphere by constructing a normalized vector field and demonstrate how it is affected by the presence of string clouds and holonomy corrections. Finally, we examine the properties of a thin accretion disk in this BH background, showing that both the string cloud and holonomy parameters significantly influence the disk's radiation profile, temperature distribution, and spectral characteristics. Our results suggest that these modifications leave measurable imprints, providing viable avenues for observational constraints in the strong-gravity regime.",
      "pdf_url": "https://arxiv.org/pdf/2509.07686.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07715",
      "title": "K-nonizing",
      "authors": [
        "Jose Beltrán Jiménez",
        "Teodor Borislavov Vasilev",
        "Darío Jaramillo-Garrido",
        "Antonio L. Maroto",
        "Prado Martín-Moruno"
      ],
      "abstract": "Jose Beltrán Jiménez, Teodor Borislavov Vasilev, Darío Jaramillo-Garrido, Antonio L. Maroto, Prado Martín-Moruno General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph) We unveil the dynamical equivalence of field theories with non-canonical kinetic terms and canonical theories with a volume element invariant under transverse diffeomorphisms. The proof of the equivalence also reveals a subtle connection between the standard Legendre transformation and the so-called Clairaut equation. Explicit examples of canonizable theories include classes of $k$-essence, non-linear electrodynamics, or $f(R)$ theories. The equivalence can also be extended to the class of mimetic theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.07715.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07737",
      "title": "Anatomy of parameter-estimation biases in overlapping gravitational-wave signals: detector network",
      "authors": [
        "Ziming Wang",
        "Dicong Liang",
        "Lijing Shao"
      ],
      "abstract": "Anatomy of parameter-estimation biases in overlapping gravitational-wave signals: detector network Ziming Wang, Dicong Liang, Lijing Shao General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM) With the significantly improved sensitivity and a wider frequency band, the next-generation gravitational-wave (GW) detectors are anticipated to detect $\\sim 10^5$ GW signals per year with durations from hours to days, leading to inevitable signal overlaps in the data stream. While a direct fitting for all signals is infeasible, extracting only one signal will be biased by its overlap with other signals. From this perspective, understanding how the biases arise from the overlapping and their dependence on the signal parameters is crucial for developing effective algorithms. In this work, we extend the anatomy of biases in single-detector cases to a detector network. Specifically, we focus on the bias dependence on the sky location, polarization and inclination angles, as well as the coalescence time and phase. We propose a new quantity, named the bias integral, as a useful tool, and establish relationship between the biases in a single detector and that in the entire network, with explicit dependence on extrinsic parameters. Using a 3-detector network as an example, we further explore the potential of a network to suppress biases due to the detectors' different locations and orientations. We find that location generally has a smaller effect than orientation, and becomes significant only when the time separation between signals is below sub-seconds. Through a population-level simulation over the extrinsic parameters, we find that nearly half of overlapping signals will lead to larger biases in the network compared to a single detector, highlighting the need to cope with overlapping biases in a detector network.",
      "pdf_url": "https://arxiv.org/pdf/2509.07737.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07745",
      "title": "Emergence of Entropic Time in a Tabletop Wheeler-DeWitt Universe",
      "authors": [
        "Giovanni Barontini"
      ],
      "abstract": "Emergence of Entropic Time in a Tabletop Wheeler-DeWitt Universe Giovanni Barontini General Relativity and Quantum Cosmology (gr-qc); Quantum Gases (cond-mat.quant-gas); Quantum Physics (quant-ph) We implement an analogue Wheeler-DeWitt mini-universe constituted by a well-isolated atomic Bose-Einstein condensate in a time-independent conservative potential. In exact analogy with the Wheeler-DeWitt framework for the actual universe, our system has the fundamental problem of defining from within a meaningful time variable over which to order the events. Here, we partition the mini-universe into a bright and a dark sector, enabling entropy exchange between them through a potential barrier. We show that the Hamiltonian of the condensate in the bright sector is analogous to the one in canonical minisuperspace models. We define an entropic time and show with experimental data that it is robustly monotonic even when the bright sector undergoes several cycles that begin with a 'big bang' and end with a 'big crunch'. By tuning the barrier height, we control the rate of entropy production and thus the speed of the emergent entropic time and the dynamics of the bright universe. We finally derive an entropic time-dependent Schroedinger equation that could be considered as a generalization of the standard one, and use it to reproduce our data. This work experimentally validates the proposition that time in quantum cosmological models may not be fundamental, but instead emerges from thermodynamic gradients, while establishing a concrete experimental platform for evaluating several aspects of quantum gravity theories.",
      "pdf_url": "https://arxiv.org/pdf/2509.07745.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07769",
      "title": "Inflationary Decoherence from the Gravitational Floor",
      "authors": [
        "C.P. Burgess",
        "R. Holman",
        "Greg Kaplanek"
      ],
      "abstract": "Inflationary Decoherence from the Gravitational Floor C.P. Burgess, R. Holman, Greg Kaplanek General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Physics - Phenomenology (hep-ph); High Energy Physics - Theory (hep-th) We re-examine the decoherence rate of primordial fluctuations within minimal inflationary models, using only the gravitational interactions required for the underlying fluctuation-generation mechanism itself. Since gravity provides the weakest interactions the result provides a plausible floor on the rate of primordial decoherence. Previous calculations (arXiv:2211.11046) did so using only a subset of these interactions, motivated by assuming both system and environment were super-Hubble. We extend this by including the effects on super-Hubble modes of {\\it all} gravitational interactions at leading order in H/Mp (and so need not restrict the decohering environment to being super-Hubble). We show how the decohering evolution becomes Markovian for super-Hubble modes, without the need to appeal to truncations (like the `rotating wave' approximation) that are often used in optics but can be inapprorpriate for cosmology. We find that the dominant contribution comes from the nonlocal cubic interactions obtained by solving the constraints. We identify UV divergences systematically and verify thereby that the leading part of the purity evolution is UV finite. In the end we find a decoherence rate that grows in the super-Hubble regime significantly {\\it faster} than found earlier. We take the preliminary steps to resum this result to late times and briefly discuss why they are more complicated than for earlier calculations.",
      "pdf_url": "https://arxiv.org/pdf/2509.07769.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "hep-ph",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2509.07831",
      "title": "Is GW190521 a gravitational wave echo of wormhole remnant from another universe?",
      "authors": [
        "Qi Lai",
        "Qing-Yu Lan",
        "Hao-Yang Liu",
        "Yu-Tong Wang",
        "Yun-Song Piao"
      ],
      "abstract": "Is GW190521 a gravitational wave echo of wormhole remnant from another universe? Qi Lai, Qing-Yu Lan, Hao-Yang Liu, Yu-Tong Wang, Yun-Song Piao 16 pages, 4 figures and 3 tables General Relativity and Quantum Cosmology (gr-qc); High Energy Astrophysical Phenomena (astro-ph.HE); High Energy Physics - Theory (hep-th) A particularly compelling aspect of the GW190521 event detected by the LIGO-Virgo collaboration is that it has an extremely short duration, and lacks a clearly identifiable inspiral phase usually observed in the binary black holes (BBHs) coalescence. In this work, we hypothesize that GW190521 might represent a single, isolated gravitational wave (GW) echo pulse from the wormhole, which is the postmerger remnant of BBHs in another universe and connected to our universe through a throat. The ringdown signal after BBHs merged in another universe can pass through the throat of wormhole and be detected in our universe as a short-duration echo pulse. Our analysis results indicate that our model yields a network signal-to-noise ratio comparable to that of the standard BBHs merger model reported by the LIGO-Virgo collaboration. Though the Bayesian factor slightly prefers the standard BBHs merger model, it is not significant enough to rule out the possibility that the echo-for-wormhole model is a viable hypothesis for the GW190521 event.",
      "pdf_url": "https://arxiv.org/pdf/2509.07831.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.HE",
        "hep-th"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07849",
      "title": "Observing Double White Dwarfs with the Lunar GW Antenna",
      "authors": [
        "Giovanni Benetti",
        "Marica Branchesi",
        "Jan Harms",
        "Jean-Pierre Zendri"
      ],
      "abstract": "Observing Double White Dwarfs with the Lunar GW Antenna Giovanni Benetti, Marica Branchesi, Jan Harms, Jean-Pierre Zendri 16 pages, 10 figures. Submitted to Astronomy & Astrophysics General Relativity and Quantum Cosmology (gr-qc); Instrumentation and Methods for Astrophysics (astro-ph.IM) The Lunar Gravitational Wave Antenna (LGWA) is a proposed gravitational-wave detector that will observe in the decihertz (dHz) frequency region. In this band, binary white dwarf systems are expected to merge, emitting gravitational waves. Detecting this emission opens new perspectives for understanding the Type Ia supernova progenitors and for investigating dense matter physics. In this work, we present the capabilities of LGWA to detect and localize short-period double white dwarfs in terms of sky locations and distances. The analysis is performed using a realistic spatial distribution of sources, merger rates, and binary-mass distributions derived from current population synthesis models. The simulated population of double white dwarfs is generated using the SeBa stellar-evolution code, coupled with dedicated sampling algorithms. The performance of the LGWA detector, both in terms of signal detectability and parameter estimation, is assessed using standard gravitational-wave data analysis techniques, including Fisher matrix methods, as implemented in the GWFish and Legwork codes. The analysis indicates that LGWA could detect approximately O(30) monochromatic galactic sources and O(10) extragalactic mergers, demonstrating the unique potential of decihertz gravitational-wave detectors to access and characterize extragalactic DWD populations. This will open new avenues for understanding Type Ia supernova progenitors and the physics of DWDs.",
      "pdf_url": "https://arxiv.org/pdf/2509.07849.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.IM"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2509.07976",
      "title": "Dynamical Dark Energy or Modified Gravity? Signatures in Gravitational Wave Propagation",
      "authors": [
        "Purnendu Karmakar",
        "Sandeep Haridasu"
      ],
      "abstract": "Dynamical Dark Energy or Modified Gravity? Signatures in Gravitational Wave Propagation Purnendu Karmakar, Sandeep Haridasu General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We discuss the implications of the most recent DESI Baryon Acoustic Oscillations (BAO) DR2 and DESyr5 compilation of supernovae (SNe) datasets for modified gravity focusing on non-metricity based $f(Q)$ theory, by employing a `model-independent' approach. We reconstruct of dark energy density which is then extended to estimate the perturbation-level quantities, sourced by the modified gravity, namely the effective gravitational coupling, $\\mu$, and the amplitude damping parameter of gravitational wave propagation, $\\nu$. In light of the remarkable hints for a dynamical dark energy emerging from the analysis of background cosmological data, we discuss the possibility to distinguish between dark energy and modified gravity scenarios from their scalar and tensor perturbation-level signatures. We contrast our findings between the older Pantheon+ and the newer DESyr5 compilations of SNe datasets, which predict a significant distinct signature in the damping parameter of the gravitational wave propagation amplitude. On the other hand, the prediction for the effective gravitational coupling remains insensitive to the choice of the SNe datasets. Our results provide a strong case for the study of gravitational wave propagation in modified gravity theories, in light of the new generation of gravitational wave detectors such as LISA, Einstein Telescope and Cosmic Explorer.",
      "pdf_url": "https://arxiv.org/pdf/2509.07976.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2307.08108",
      "title": "De Sitter-Invariant Black Holes",
      "authors": [
        "D. F. López",
        "S. Abarghouei Nejad",
        "José G. Pereira"
      ],
      "abstract": "De Sitter-Invariant Black Holes D. F. López, S. Abarghouei Nejad, José G. Pereira 15 pages, no figures. arXiv admin note: substantial text overlap with arXiv:2203.04824 General Relativity and Quantum Cosmology (gr-qc) In the de Sitter-invariant approach to gravitation, all solutions to the gravitational field equations are spacetimes that reduce locally to de Sitter. Consequently, besides including an event horizon, the de Sitter-invariant black hole also has a cosmic horizon. Accordingly, it can lodge ordinary and dark energies. Owing to this additional structure concerning Poincaré-invariant general relativity, such a black hole can establish a link between the black hole dynamics and the universe's evolution. Possible implications for cosmology are discussed, and a comparison with recent observations indicating the existence of a cosmological coupling of black holes is presented.",
      "pdf_url": "https://arxiv.org/pdf/2307.08108.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2402.16680",
      "title": "Friedmann-Robertson-Walker spacetimes from the perspective of geometric algebra",
      "authors": [
        "Pablo Banon Perez",
        "Bjoern Malte Schaefer",
        "Maarten DeKieviet"
      ],
      "abstract": "Friedmann-Robertson-Walker spacetimes from the perspective of geometric algebra Pablo Banon Perez, Bjoern Malte Schaefer, Maarten DeKieviet General Relativity and Quantum Cosmology (gr-qc) The intention of our paper is to provide a pedagogical application of geometric algebra to a particularly well-investigated system: We formulate the geometric and dynamical properties of Friedmann-Robertson-Walker spacetimes within the language of geometric algebra and re-derive the Friedmann-equations as the central cosmological equations. Through the geometric algebra-variant of the Raychaudhuri equations, we comment on the evolution of spacetime volumes, before illustrating conformal flatness as a central property of Friedmann-cosmologies. An important aspect of spacetime symmetries are the associated conservation laws, for which we provide a geometric algebra formulation of the Lie-derivatives, of the Killing equation and of conserved quantities in Friedmann-Robertson-Walker spacetimes. Finally, we discuss the gravitational dynamics of scalar fields, with their particular relevance in cosmology, for cosmic inflation, and for dark energy.",
      "pdf_url": "https://arxiv.org/pdf/2402.16680.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2501.17717",
      "title": "Two-Step Procedure to Detect Cosmological Gravitational Wave Backgrounds with Next-Generation Terrestrial Gravitational-Wave Detectors",
      "authors": [
        "Haowen Zhong",
        "Luca Reali",
        "Bei Zhou",
        "Emanuele Berti",
        "Vuk Mandic"
      ],
      "abstract": "Two-Step Procedure to Detect Cosmological Gravitational Wave Backgrounds with Next-Generation Terrestrial Gravitational-Wave Detectors Haowen Zhong, Luca Reali, Bei Zhou, Emanuele Berti, Vuk Mandic Main text: 7 pages, 3 figures, 1 table. Supplemental material: 12 pages, 9 figures, 1 table Phys. Rev. Lett. 135, 111401 (2025) General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Physics - Phenomenology (hep-ph) Cosmological gravitational-wave backgrounds are an exciting science target for next-generation ground-based detectors, as they encode invaluable information about the primordial Universe. However, any such background is expected to be obscured by the astrophysical foreground from compact-binary coalescences. We propose a novel framework to detect a cosmological gravitational-wave background in the presence of binary black holes and binary neutron star signals with next-generation ground-based detectors, including Cosmic Explorer and the Einstein Telescope. Our procedure involves first removing all the individually resolved binary black hole signals by notching them out in the time-frequency domain. Then, we perform joint Bayesian inference on the individually resolved binary neutron star signals, the unresolved binary neutron star foreground, and the cosmological background. For a flat cosmological background, we find that we can claim detection at $5\\,\\sigma$ level when $\\Omega_\\mathrm{ref}\\geqslant 2.7\\times 10^{-12}/\\sqrt{T_\\mathrm{obs}/\\mathrm{yr}}$, where $T_\\mathrm{obs}$ is the observation time (in years), which is within a factor of $\\lesssim2$ from the sensitivity reached in absence of these astrophysical foregrounds.",
      "pdf_url": "https://arxiv.org/pdf/2501.17717.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "astro-ph.HE",
        "astro-ph.IM",
        "hep-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2505.01374",
      "title": "On the self-consistency of compact objects in Lorentz-violating gravity theories",
      "authors": [
        "Leandro A. Lessa",
        "Renan B. Magalhães",
        "Manoel M. Ferreira Junior"
      ],
      "abstract": "On the self-consistency of compact objects in Lorentz-violating gravity theories Leandro A. Lessa, Renan B. Magalhães, Manoel M. Ferreira Junior General Relativity and Quantum Cosmology (gr-qc) Self-consistent solutions in Lorentz-violating gravity theories require the simultaneous satisfaction of: (i) the corresponding Einstein field equations, (ii) the matter field equations, and (iii) the Lorentz-violating field equations. In vacuum states, the dynamics of Lorentz-violating tensor fields may reduce to geometric constraints, potentially precluding entire classes of compact objects. These constraints are crucial for ensuring physical consistency in Lorentz-violating frameworks, as they eliminate metric families incompatible with the anisotropies induced by spontaneous Lorentz symmetry breaking. We investigate the criteria governing the emergence of these geometric constraints and analyze their consequences. Our analysis establishes a consistency framework for evaluating compact objects in these theories, demonstrating that several previously reported solutions in Lorentz-violating gravity models are physically inadmissible.",
      "pdf_url": "https://arxiv.org/pdf/2505.01374.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.02543",
      "title": "Quintessence dark energy model in non-linear $f(Q)$ theory with bulk-viscosity",
      "authors": [
        "Dinesh Chandra Maurya"
      ],
      "abstract": "Quintessence dark energy model in non-linear $f(Q)$ theory with bulk-viscosity Dinesh Chandra Maurya Int. J. Theor. Phys. 64, 243 (2025) General Relativity and Quantum Cosmology (gr-qc) In this study, we investigate a locally rotationally symmetric (LRS) Bianchi type-I cosmological model in non-linear form of $f(Q)$ gravity with observational constraints. We solved the modified Einstein's field equations with a viscous fluid source and got a hyperbolic solution. First, we apply MCMC analysis to the cosmic chronometer (CC), Baryon Acoustic Oscillation (BAO) and Pantheon datasets to place observational constraints on the model parameters. Using constrained values of model parameters, we study the behavior of cosmological parameters, such as the Hubble parameter $H$, the deceleration parameter $q$, and the equation of state (EoS) parameter $\\omega_{v}$ with the skewness parameter $\\delta_{v}$ for the viscous fluid. In addition, we perform the Om diagnostics and statefinder analysis to categorize dark energy models. Also, we studied cosmographic series coefficients to explore the whole evolution of the derived universe model. We estimated the current age of the universe as $t_{0}\\approx13.8$ Gyrs. We obtained a quintessential and ever-accelerating model with bulk viscosity fluid.",
      "pdf_url": "https://arxiv.org/pdf/2506.02543.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.06430",
      "title": "Constraint evolution in first-order viscous relativistic fluids",
      "authors": [
        "Delfina Fantini",
        "Marcelo E. Rubio"
      ],
      "abstract": "Constraint evolution in first-order viscous relativistic fluids Delfina Fantini, Marcelo E. Rubio 18 pages, 4 figures, 1 table. Accepted in PRD, matches journal version General Relativity and Quantum Cosmology (gr-qc) Relativistic hydrodynamics provides a solid framework for evolving matter and energy in a wide variety of phenomena. Nevertheless, the inclusion of dissipative effects in realistic scenarios through causal, stable, and well-posed theories still constitutes an open problem. In this paper, we study the evolution of the algebraic and differential constraints stemmed from the first-order reduction proposed by Bemfica, Disconzi, Noronha and Kovtun (BDNK), for proving the local well-posedness of conformally-invariant viscous fluids in Sobolev spaces. First, we show analytically that the whole set of constraints satisfies a homogeneous, strongly-hyperbolic system of equations, ensuring a correct propagation as a consequence of the fluid equations. Motivated by this result, we explore their numerical stability by performing simulations of the BDNK reduction restricted to plane-symmetric configurations, in flat spacetime. We report on different initial data sets initially satisfying the constraints, and whose evolution leads to stable configurations. This result suggests that the proposed reduction by BDNK is suitable for numerical evolutions, keeping the constraints accurate under small numerical errors.",
      "pdf_url": "https://arxiv.org/pdf/2506.06430.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2507.14703",
      "title": "Bounded compactness from G(E)UP",
      "authors": [
        "Roberto Casadio",
        "Ilim Irfan Çimdiker",
        "Octavian Micu",
        "Jonas Mureika"
      ],
      "abstract": "Bounded compactness from G(E)UP Roberto Casadio, Ilim Irfan Çimdiker, Octavian Micu, Jonas Mureika General Relativity and Quantum Cosmology (gr-qc) We analyse how different Generalised Uncertainty Principles could place bounds on the compactness of self-gravitating systems. By considering existing experimental bounds on the relevant parameters, we conclude that the compactness of large astrophysical objects is bounded above by the inverse of the GUP parameter, which would naturally be of order one. Conversely, the existence of black holes imposes stronger bounds on those parameters.",
      "pdf_url": "https://arxiv.org/pdf/2507.14703.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.21315",
      "title": "Classification of global structures of evaporating regular black holes with infinite periods of time",
      "authors": [
        "Kensuke Sueto",
        "Hirotaka Yoshino"
      ],
      "abstract": "Classification of global structures of evaporating regular black holes with infinite periods of time Kensuke Sueto, Hirotaka Yoshino General Relativity and Quantum Cosmology (gr-qc) We carry out model independent analyses for global structures of spherically symmetric regular black holes that evaporate and approach the extremal state spending infinite periods of time due to Hawking radiation. We assume the radius of the outer apparent horizon (outer AH) to be a decreasing function of ingoing null coordinate, and consider the three cases, Cases 1, 2, and 3, where the radius of the inner AH is a constant, increases, and decreases, respectively. A complete classification of the Penrose diagrams is presented in each case, taking account not only of the presence and absence of the event horizon but also of the relative positions of the inner and outer AHs. Sufficient conditions that lead to each type are proved, and the examples of each type are summarized. We also study the behavior of outgoing null geodesics in models where the null geodesic equation is solvable, and figure out the important factors to determine the type of a spacetime using concepts in the area of dynamical systems. The formation of a Cauchy horizon is also established in the solvable models when the event horizon is present.",
      "pdf_url": "https://arxiv.org/pdf/2508.21315.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    }
  ]
}