{
  "date": "2025-11-18",
  "category": "gr-qc",
  "url": "https://arxiv.org/list/gr-qc/new",
  "total_papers": 21,
  "gw_related_papers": 4,
  "papers": [
    {
      "id": "https://arxiv.org/abs/2511.10735",
      "title": "Constants of motion and fundamental frequencies for elliptic orbits at fourth post-Newtonian order",
      "authors": [
        "David Trestini"
      ],
      "abstract": "Constants of motion and fundamental frequencies for elliptic orbits at fourth post-Newtonian order David Trestini General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In the case of nonspinning compact binary systems on quasi-elliptic orbits, I obtain the conservative map between the constants of motion (energy and angular momentum) and the fundamental (radial and azimuthal) frequencies at the fourth post-Newtonian order, including both instantaneous and tail contributions. This map is expressed in terms of an enhancement function of the eccentricity, which is appropriately resummed to ensure accuracy for any eccentricity; in particular, I recover known results for circular orbits. In order to obtain this map, the local dynamics are expressed using an action-angle formulation. The tail term is treated as a perturbation, which is first localized in time, then Delaunay-averaged. Both operations require a contact transformation of the phase-space variables, which I explicitly control. Using the first law of binary black hole mechanics, I then obtain the orbit-averaged redshift invariant for eccentric orbits at fourth post-Newtonian order; when properly accounting for the tail contributions, it perfectly agrees with analytical self-force at postgeodesic order [arXiv:2203.13832]. Finally, I use these results to re-express the fluxes of energy and angular momentum obtained at third post-Newtonian order in [arXiv:0711.0302] and [arXiv:0908.3854] in terms of fundamental frequencies.",
      "pdf_url": "https://arxiv.org/pdf/2511.10735.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10738",
      "title": "Diffusion in the stochastic Klein-Gordon equation",
      "authors": [
        "Jonathan Oppenheim",
        "Emanuele Panella"
      ],
      "abstract": "Diffusion in the stochastic Klein-Gordon equation Jonathan Oppenheim, Emanuele Panella General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Theories of gravity in which the metric is fundamentally classical predict stochastic fluctuations in the gravitational field. In this article, we study the stochastic Klein-Gordon equation as a starting point to understand the phenomenology of linearised classical-quantum hybrid gravity. In particular, we describe how to compute the non-equilibrium two point function of the scalar field, showing explicitly the role of the initial state in regulating divergences. To do so, we use a \"mod-squared-retarded\" pole-prescription and find that the covariance in the field is non-zero only outside the lightcone, scales inversely with the spatial distance of the spacetime points and grows linearly in time. The energy has a contact divergence similar to that found in the quantum case. We conclude by discussing possible implications of anomalous diffusion for hybrid theories of gravity, especially looking at the energy density in the predicted gravitational waves background, which can be inferred from the scalar covariances.",
      "pdf_url": "https://arxiv.org/pdf/2511.10738.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.10820",
      "title": "Noncommutative black holes in extended anti-de Sitter phase space",
      "authors": [
        "Athanasios G. Tzikas"
      ],
      "abstract": "Noncommutative black holes in extended anti-de Sitter phase space Athanasios G. Tzikas General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study thermodynamic aspects of ordinary and lower dimensional noncommutative black holes within an extended anti-de Sitter phase space by treating the negative cosmological constant and the minimal cut-off length as thermodynamic variables representing the pressure and tension of the system, respectively. In four-dimensional spacetime, the regular black hole exhibits a small/large black hole phase transition analogous to the liquid/gas transition of a Van der Waals gas. The three-dimensional case demonstrates global and local thermodynamic stability, while the two-dimensional case reveals a novel type of transition referred to as the anti-Hawking-Page transition.",
      "pdf_url": "https://arxiv.org/pdf/2511.10820.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.10969",
      "title": "The Semiclasscical limit of $SU(3)$ Gauge Field Coherent States: Peakedness and Overlap Functions",
      "authors": [
        "Ye Zhang",
        "Zichang Huang"
      ],
      "abstract": "The Semiclasscical limit of $SU(3)$ Gauge Field Coherent States: Peakedness and Overlap Functions Ye Zhang, Zichang Huang General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Lattice (hep-lat); High Energy Physics - Theory (hep-th); Mathematical Physics (math-ph) By using the heat kernel method, we construct diffeomorphism-covariant coherent states for the $SU(3)$ gauge group. We numerically demonstrate that these states exhibit the required semiclassical properties in the semiclassical limit: the peakedness property of the probability distribution and the peakedness property of the overlap function. We also provide the leading order term of the overlap amplitude in the combined limit where $t \\rightarrow 0$ and $g\\rightarrow g'$. This work provides the essential tool for deriving effective dynamics for $SU(3)$ gauge fields coupled to gravity via a coherent state path integral.",
      "pdf_url": "https://arxiv.org/pdf/2511.10969.pdf",
      "categories": [
        "gr-qc",
        "hep-lat",
        "hep-th",
        "math-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11109",
      "title": "CPT symmetry in the mirror universe",
      "authors": [
        "Natalia Gorobey",
        "Alexander Lukyanenko",
        "A. V. Goltsev"
      ],
      "abstract": "CPT symmetry in the mirror universe Natalia Gorobey, Alexander Lukyanenko, A. V. Goltsev General Relativity and Quantum Cosmology (gr-qc) A model of a two-sheeted universe in the quantum theory of gravity is proposed, based on the definition of 3D invariant and gauge-invariant proper time of the universe. A uniform time in a closed universe is introduced in the class of equivalent reference systems defined by the spectrum of a Hermitian 3D operator on the space of Dirac bi-spinors, the equality to zero of which is equivalent to a system of gravitational constraints. Based on the analogy with the Lorentz-invariant quantum field theory in Minkowski space and the definition of discrete C-, P- and T-transformations separately, the principle of CPT symmetry in a two-sheeted universe is formulated. A covariant quantum theory of matter gauge fields consistent with the charge conjugation operation in a two-sheeted universe is proposed. The CPT symmetric state of a homogeneous isotropic two-sheeted model of the universe is constructed by an iterative method in which the no-boundary Hartle--Hawking wave function is used as a zeroth approximation.",
      "pdf_url": "https://arxiv.org/pdf/2511.11109.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11173",
      "title": "Quantum Electron Clouds near Black Holes: Black Atoms and Molecules",
      "authors": [
        "Hinako Iseki",
        "Shin Sasaki",
        "Kenta Shiozawa"
      ],
      "abstract": "Quantum Electron Clouds near Black Holes: Black Atoms and Molecules Hinako Iseki, Shin Sasaki, Kenta Shiozawa General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th); Quantum Physics (quant-ph) We study quantum mechanical wavefunctions near highly curved spaces, i.e., black holes. By utilizing the formalism developed by DeWitt, we derive the Schrödinger equations in the vicinity of the Schwarzschild and the Reissner-Nordström black hole geometries. The quantum electron cloud for the \"black hydrogen atom\" - an electron trapped by black holes - is particularly studied. We solve the equations and find that black holes generally attract the wavefunctions, localizing them near the horizon where the electrons are most likely to be trapped. These results imply that not only classical objects but also the quantum material and even the chemical properties of the atoms are affected by strong gravity. We also discuss black hydrogen molecules composed of multi-centered Majumdar-Papapetrou black holes.",
      "pdf_url": "https://arxiv.org/pdf/2511.11173.pdf",
      "categories": [
        "gr-qc",
        "hep-th",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11268",
      "title": "On Nonrelativistic Isotropic and Homogeneous Universe",
      "authors": [
        "R. G. G. Amorim",
        "A. F. Santos",
        "K. V. S. Araújo",
        "S. C. Ulhoa"
      ],
      "abstract": "On Nonrelativistic Isotropic and Homogeneous Universe R. G. G. Amorim, A. F. Santos, K. V. S. Araújo, S. C. Ulhoa General Relativity and Quantum Cosmology (gr-qc) This article deals with a nonrelativistic cosmological model based on Galilean covariance, formulated within a five-dimensional Galilean manifold. Within this framework, we construct an isotropic and homogeneous metric analogous to the Friedmann--Robertson--Walker metric but without a universal speed limit. Two distinct solutions of the Einstein-like field equations are obtained: (i) a vacuum configuration ($\\lambda=0$) yielding an exponential--quadratic scale factor, and (ii) a dust-dominated universe ($\\lambda=1$) described by a non-interacting nonrelativistic fluid. Upon dimensional reduction to $3+1$ spacetime through a specific embedding, the model naturally develops anisotropy in the scale factor and density, consistent with the near-zero spatial curvature inferred from Planck data. In the case of vanishing spatial curvature, the framework reproduces Milne's Newtonian cosmology because this condition leads to a vanishing pressure. This provides an independent nonrelativistic setting for cosmological dynamics within Galilean covariance.",
      "pdf_url": "https://arxiv.org/pdf/2511.11268.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11379",
      "title": "Molecular analogue for scalar dynamics in a tachyonic metric",
      "authors": [
        "Davi de Moura Esposti Moreira",
        "Matheus Elias Pereira",
        "Alexandre Grezzi de Miranda Schmidt"
      ],
      "abstract": "Molecular analogue for scalar dynamics in a tachyonic metric Davi de Moura Esposti Moreira, Matheus Elias Pereira, Alexandre Grezzi de Miranda Schmidt General Relativity and Quantum Cosmology (gr-qc); Quantum Physics (quant-ph) Tachyons are hypothetical particles that propagate faster than light, yet they have never been observed in nature or in the laboratory. In this work, we introduce the hydrogen molecule ion as an analogue for the dynamics of a spinless test particle interacting with the gravitational field generated by a tachyon. The tachyonic spacetime is modeled using an AII metric, and the problem is analyzed through the Klein-Gordon equation for a scalar field in this background. We compute the quasinormal modes and the Hawking radiation spectrum associated with the system. By introducing an external potential, we demonstrate that both the radial and angular components of the test particles wave function can be effectively reproduced by the electron dynamics in the hydrogen molecule ion, thus proposing a molecular analogue model for an extreme gravitational system.",
      "pdf_url": "https://arxiv.org/pdf/2511.11379.pdf",
      "categories": [
        "gr-qc",
        "quant-ph"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11419",
      "title": "Regularized Black Hole Solution from a New String Cloud Source",
      "authors": [
        "C. R. Muniz",
        "Jonathan Alves Rebouças",
        "Francisco Bento Lustosa",
        "Leonardo Tavares de Oliveira",
        "Francisco Tiago Barboza Sampaio"
      ],
      "abstract": "Regularized Black Hole Solution from a New String Cloud Source C. R. Muniz, Jonathan Alves Rebouças, Francisco Bento Lustosa, Leonardo Tavares de Oliveira, Francisco Tiago Barboza Sampaio General Relativity and Quantum Cosmology (gr-qc) We construct a new family of regular black hole solutions supported by the novel Letelier-Alencar string cloud and regularized through a rational Dagum-type distribution. The regulator smooths the matter profile and ensures finite curvature invariants, yielding a geometry that interpolates between a string-cloud exterior and an anti--de Sitter core. We analyze the energy conditions, identifying where the null, weak, dominant and strong conditions hold or fail across the core and exterior. The parameter space for horizon formation is mapped and the thermodynamic propertie -- mass, Hawking temperature, entropy and heat capacity -- are derived; notably, the entropy depends only on the regularization scale while the string parameter modifies temperature and heat capacity. Employing Rényi non-extensive entropy and the topological thermodynamics approach, we show the non-extensive deformation stabilizes the system and removes the standard phase transition. Finally, we compute the shadow radius and derive constraints compatible with current Event Horizon Telescope bounds for Sgr~A* and M87*.",
      "pdf_url": "https://arxiv.org/pdf/2511.11419.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.11509",
      "title": "\\textit{Euclid}: From Galaxies to Gravitational Waves -- Forecasting Stochastic Gravitational Wave Background Anisotropies and Their Cross-Correlation",
      "authors": [
        "K. Z. Yang",
        "G. Cusin",
        "V. Mandic",
        "C. Scarlata",
        "J. Suresh",
        "B. Altieri",
        "N. Auricchio",
        "C. Baccigalupi",
        "M. Baldi",
        "S. Bardelli",
        "A. Biviano",
        "E. Branchini",
        "M. Brescia",
        "S. Camera",
        "G. Cañas-Herrera",
        "V. Capobianco",
        "C. Carbone",
        "J. Carretero",
        "S. Casas",
        "M. Castellano",
        "G. Castignani",
        "S. Cavuoti",
        "K. C. Chambers",
        "A. Cimatti",
        "C. Colodro-Conde",
        "G. Congedo",
        "L. Conversi",
        "Y. Copin",
        "A. Costille",
        "F. Courbin",
        "H. M. Courtois",
        "H. Degaudenzi",
        "G. De Lucia",
        "H. Dole",
        "F. Dubath",
        "X. Dupac",
        "S. Dusini",
        "S. Escoffier",
        "M. Farina",
        "R. Farinelli",
        "F. Faustini",
        "S. Ferriol",
        "F. Finelli",
        "P. Fosalba",
        "N. Fourmanoit",
        "M. Frailis",
        "E. Franceschi",
        "M. Fumana",
        "S. Galeotta",
        "K. George",
        "B. Gillis",
        "C. Giocoli",
        "P. Gómez-Alvarez",
        "J. Gracia-Carpio",
        "A. Grazian",
        "F. Grupp",
        "S. V. H. Haugan",
        "W. Holmes",
        "F. Hormuth",
        "A. Hornstrup",
        "K. Jahnke",
        "M. Jhabvala",
        "B. Joachimi",
        "E. Keihänen",
        "S. Kermiche",
        "A. Kiessling",
        "B. Kubik",
        "M. Kunz",
        "H. Kurki-Suonio",
        "A. M. C. Le Brun",
        "S. Ligori",
        "P. B. Lilje",
        "V. Lindholm",
        "I. Lloro",
        "G. Mainetti",
        "D. Maino",
        "O. Mansutti",
        "S. Marcin",
        "O. Marggraf",
        "M. Martinelli",
        "N. Martinet",
        "F. Marulli",
        "E. Medinaceli",
        "S. Mei",
        "Y. Mellier",
        "M. Meneghetti",
        "E. Merlin",
        "G. Meylan",
        "A. Mora",
        "M. Moresco",
        "L. Moscardini",
        "C. Neissner",
        "S.-M. Niemi",
        "C. Padilla",
        "S. Paltani",
        "F. Pasian",
        "K. Pedersen",
        "V. Pettorino",
        "S. Pires",
        "G. Polenta"
      ],
      "abstract": "\\textit{Euclid}: From Galaxies to Gravitational Waves -- Forecasting Stochastic Gravitational Wave Background Anisotropies and Their Cross-Correlation K. Z. Yang, G. Cusin, V. Mandic, C. Scarlata, J. Suresh, B. Altieri, N. Auricchio, C. Baccigalupi, M. Baldi, S. Bardelli, A. Biviano, E. Branchini, M. Brescia, S. Camera, G. Cañas-Herrera, V. Capobianco, C. Carbone, J. Carretero, S. Casas, M. Castellano, G. Castignani, S. Cavuoti, K. C. Chambers, A. Cimatti, C. Colodro-Conde, G. Congedo, L. Conversi, Y. Copin, A. Costille, F. Courbin, H. M. Courtois, H. Degaudenzi, G. De Lucia, H. Dole, F. Dubath, X. Dupac, S. Dusini, S. Escoffier, M. Farina, R. Farinelli, F. Faustini, S. Ferriol, F. Finelli, P. Fosalba, N. Fourmanoit, M. Frailis, E. Franceschi, M. Fumana, S. Galeotta, K. George, B. Gillis, C. Giocoli, P. Gómez-Alvarez, J. Gracia-Carpio, A. Grazian, F. Grupp, S. V. H. Haugan, W. Holmes, F. Hormuth, A. Hornstrup, K. Jahnke, M. Jhabvala, B. Joachimi, E. Keihänen, S. Kermiche, A. Kiessling, B. Kubik, M. Kunz, H. Kurki-Suonio, A. M. C. Le Brun, S. Ligori, P. B. Lilje, V. Lindholm, I. Lloro, G. Mainetti, D. Maino, O. Mansutti, S. Marcin, O. Marggraf, M. Martinelli, N. Martinet, F. Marulli, E. Medinaceli, S. Mei, Y. Mellier, M. Meneghetti, E. Merlin, G. Meylan, A. Mora, M. Moresco, L. Moscardini, C. Neissner, S.-M. Niemi, C. Padilla, S. Paltani, F. Pasian, K. Pedersen, V. Pettorino, S. Pires, G. Polenta General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO) We estimate the amplitude and spatial anisotropy in the stochastic gravitational wave background (SGWB) energy density due to compact binary coalescence (CBC) events: binary black holes (BBH), binary neutron stars (BNS), and black hole-neutron star (BHNS) mergers. Our starting point is the Flagship Simulation Galaxy Catalogue developed by the Euclid Consortium. For each galaxy in the Catalogue, we use the simulated mass and starformation to constrain the galaxy's star-formation history, and predict its contribution to the gravitational-wave energy density through CBC mergers. Combining such contributions from all galaxies in the Catalogue results in a prediction for the frequency spectrum and spatial anisotropy of the CBC SGWB. We also compare this prediction to semi-analytical models of SGWB generated by compact binaries. We identify a set of effective parameters that capture the key features of these models, and we apply a Bayesian framework to infer these parameters assuming an ideal scenario of cosmic variance-limited search. This represents the first step toward developing a comprehensive framework that will eventually enable the correlation of SGWB anisotropy and \\textit{Euclid} galaxy data, potentially allowing us to extract valuable astrophysical information from this new observable.",
      "pdf_url": "https://arxiv.org/pdf/2511.11509.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2511.11536",
      "title": "Accurate models for recoil velocity distribution in black hole mergers with comparable to extreme mass-ratios and their astrophysical implications",
      "authors": [
        "Tousif Islam",
        "Digvijay Wadekar"
      ],
      "abstract": "Accurate models for recoil velocity distribution in black hole mergers with comparable to extreme mass-ratios and their astrophysical implications Tousif Islam, Digvijay Wadekar Models will be available through gwModels package: this https URL General Relativity and Quantum Cosmology (gr-qc) Modeling the remnant recoil velocity (kick) distribution from binary black hole mergers is crucial for understanding hierarchical mergers in active galactic nuclei or globular clusters. Existing analytic models often show large discrepancies with numerical relativity (NR) data, while data-driven models are limited to mass ratios of q<=8 (aligned spins) and q<=4 (precessing spins) and break down when extrapolated outside their training ranges. Using ~5000 of NR simulations from the SXS and RIT catalogs up to q=128 and ~100 black hole perturbation theory simulations up to q=200, we present two classes of models: (i) gwModel_kick_q200 (gwModel_kick_q200_GPR), an analytic (Gaussian process regression) model for aligned-spin binaries. (ii) gwModel_kick_prec_flow, a normalizing-flow model for kick distribution from precessing binaries with isotropic spins. Our approach combines analytic insights from post-Newtonian theory with data-driven techniques to ensure correct limiting behavior and high accuracy across parameter space. Both gwModel_kick_q200 and gwModel_kick_prec_flow are valid from comparable to extreme mass ratios. Extensive validation shows all three models outperform existing ones within their respective domains. Finally, using both back-of-the-envelope estimates and 1404 detailed star cluster simulations incorporating our kick models, we find that the black hole retention probability in low mass globular clusters can vary noticeably when the gwModel_kick_prec_flow model is employed. The models are publicly available through the gwModels package.",
      "pdf_url": "https://arxiv.org/pdf/2511.11536.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2401.15789",
      "title": "Anti-Gravity from Vacancies in Fractal Space-Time: The Case of a Menger Sponge",
      "authors": [
        "Karl Svozil"
      ],
      "abstract": "Anti-Gravity from Vacancies in Fractal Space-Time: The Case of a Menger Sponge Karl Svozil 8 pages, 3 figures, revised and shortened General Relativity and Quantum Cosmology (gr-qc) We explore the idea that anti-gravity, interpreted as matter-matter repulsion, may emerge as an effective description of spacetime with a reduced local ``substratum density,'' modeled heuristically by vacancies in a fractal lattice. Using the Menger Sponge as a prototypical vacancy-dominated fractal, we motivate a phenomenological identification of a net vacancy parameter with the mass parameter in the Schwarzschild solution. This yields an effective negative-mass Schwarzschild-like metric for embedded observers when vacancies dominate. We analyze curvature, geodesic motion, and energy-condition issues, and we emphasize that our construction is not a microscopic derivation from a specific stress-energy tensor but a re-interpretation of the negative-mass Schwarzschild geometry in terms of fractal vacancies. We discuss conceptual implications, stability challenges, and possible observational signatures.",
      "pdf_url": "https://arxiv.org/pdf/2401.15789.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.04812",
      "title": "Dark-sector modifications to Kerr and Reissner-Nordstrom black hole evaporation",
      "authors": [
        "Christopher Ewasiuk",
        "Stefano Profumo"
      ],
      "abstract": "Dark-sector modifications to Kerr and Reissner-Nordstrom black hole evaporation Christopher Ewasiuk, Stefano Profumo General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We present a comprehensive comparative analysis of the evaporation dynamics of Schwarzschild, Kerr, and Reissner- Nordstrom black holes, focusing on the evolution of their mass, charge, and angular momentum, using detailed calculations of the corresponding Page factors. We investigate the evolution of black holes during the evaporation process, emphasizing how these quantities evolve relative to one another. Our study incorporates the effects of greybody factors, near-extremal conditions, and the introduction of additional particle species beyond the Standard Model. We demonstrate that the addition of particle degrees of freedom may significantly alter the evaporation hierarchy, potentially leading to scenarios in which the effective black hole charge increases during evaporation. Additionally, we examine the impact of Schwinger pair production and of super-radiance on charged, spinning black hole evaporation. These findings offer new insights into the complex interplay between different black hole parameters during evaporation and highlight the importance of considering additional particle species in the process.",
      "pdf_url": "https://arxiv.org/pdf/2505.04812.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2505.07544",
      "title": "Identifying Proca-star mergers via consistent ultralight-boson mass estimates across gravitational-wave events",
      "authors": [
        "Ana Lorenzo-Medina",
        "Juan Calderón Bustillo",
        "Samson H.W. Leong"
      ],
      "abstract": "Identifying Proca-star mergers via consistent ultralight-boson mass estimates across gravitational-wave events Ana Lorenzo-Medina, Juan Calderón Bustillo, Samson H.W. Leong General Relativity and Quantum Cosmology (gr-qc) While black-hole and neutron-star mergers are the most plausible sources of current gravitational-wave observations, mergers of exotic compact objects may mimic these signals. Proca stars -- Bose-Einstein condensates of complex vector ultralight bosons -- have gained significant attention for their potential to replicate certain gravitational-wave events while yielding consistent estimates of the boson mass $\\mu_{B}$ forming the stars. Using a mixture model within a Bayesian framework, we demonstrate that consistent boson-mass estimates across events can be exploited to obtain conclusive evidence for the existence \\cor{of} a number $n$ of Proca-star families characterized by respective boson masses $\\mu_{B}^{i}$, even if no individual event can be conclusively identified as such. Our method provides posterior distributions for $n$ and $\\mu_{B}^{i}$. Applying this framework to the high-mass events GW190521, GW190426\\_190642 \\cor{and} GW200220\\_061928, we obtain a Bayes Factor ${\\cal{B}}^{n=0}_{n=1}=2$ against the Proca-star hypothesis, primarily rooted in the limitation of current Proca-star merger \\cor{signal models} to intrinsically weak head-on cases. We show that conclusive evidence $\\log{\\cal{B}}^{n=1}_{n=0} \\geq 5$ could be achieved after 5 to 9 observations of similar event sets, at the $90\\%$ credible level. Our framework provides a new way to detect exotic compact objects, somewhat using gravitational-wave detectors as particle detectors.",
      "pdf_url": "https://arxiv.org/pdf/2505.07544.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": true
    },
    {
      "id": "https://arxiv.org/abs/2506.13126",
      "title": "Logarithmic and Strong Coupling Models in Weyl-Type $f(Q,T)$ Gravity",
      "authors": [
        "Rahul Bhagat",
        "S. K. Tripathy",
        "B. Mishra"
      ],
      "abstract": "Logarithmic and Strong Coupling Models in Weyl-Type $f(Q,T)$ Gravity Rahul Bhagat, S. K. Tripathy, B. Mishra ANNALEN DER PHYSIK (2025): e00429 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) In this paper, we have explored the cosmological implications of Weyl-type $f(Q,T)$ gravity, a modified gravitational theory formulated from Weyl geometry. The nonmetricity scalar $Q$ is coupled to the trace $T$ of the energy-momentum tensor. We analyze two models based on the logarithmic and strong coupling form of the function $f(Q,T)$. The corresponding field equations are then solved numerically after reformulating the system in terms of redshift. We used combined dataset from Cosmic Chronometers (CC), Pantheon$^+$ supernovae, and Baryon Acoustic Oscillations (BAO) and performed the Markov Chain Monte Carlo (MCMC) analysis to constrain the model parameters. Using the constrained parameters, the geometrical and dynamical aspects of the models are analyzed. The results successfully describe a transition from decelerated to accelerated expansion for both the models. The models mostly exhibit quintessence-like behavior and asymptotically approach the $\\Lambda$CDM scenario at late times. The calculated age of the Universe from each model aligns with constraints from Planck and stellar age data. The violation of the strong energy condition and the satisfaction of null energy condition and dominant energy conditions are shown.",
      "pdf_url": "https://arxiv.org/pdf/2506.13126.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2506.16707",
      "title": "Theories of the gravity+gauge type in de Sitter space",
      "authors": [
        "Julian Lang",
        "Yasha Neiman"
      ],
      "abstract": "Theories of the gravity+gauge type in de Sitter space Julian Lang, Yasha Neiman This is a significantly expanded version of a previous submission arXiv:2410.18377, with a larger scope and an additional author; v2: PRD version, improved references Phys.Rev.D 112 (2025) 10, 104013 General Relativity and Quantum Cosmology (gr-qc); High Energy Physics - Theory (hep-th) We study theories of the \"General Relativity + Yang-Mills\" type in 4d spacetime with cosmological constant, focusing on formulations where the basic variables are connections and curvatures (but no metric). We present a new Lagrangian for GR coupled to Yang-Mills, which uses the same kind of variables for both sectors, and is suggestive of the double-copy structure. This Lagrangian comes in both non-chiral (real) and chiral (complex) versions. The chiral version makes it easy to isolate the self-dual sector. The latter lends itself to a higher-spin (HS) generalization, which combines the HS Self-Dual GR and HS Self-Dual Yang-Mills of Krasnov, Skvortsov and Tran. We then descend from the covariant formulation to lightcone gauge, and construct a cubic-exact lightcone action. For HS Self-Dual Yang-Mills, we solve the lightcone field equations to all orders in perturbation theory. Finally, we discuss the relation between lightcone foliations that share a lightray - a setup relevant for the scattering problem in the de Sitter static patch. We derive this relation at the linearized level, and argue from causality+symmetry that it cannot receive non-linear corrections. We explore the associated gauge transformations in the non-linear covariant theory.",
      "pdf_url": "https://arxiv.org/pdf/2506.16707.pdf",
      "categories": [
        "gr-qc",
        "hep-th"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2508.18881",
      "title": "The periastron regression of 2M1510 AB, the jet precession of M87* and Telisto/Planet Nine: three different scenarios for a possible common cause",
      "authors": [
        "Lorenzo Iorio"
      ],
      "abstract": "The periastron regression of 2M1510 AB, the jet precession of M87* and Telisto/Planet Nine: three different scenarios for a possible common cause Lorenzo Iorio LaTex2e, 22 pages, 4 tables, 5 figures. Abstract and Introduction rewritten General Relativity and Quantum Cosmology (gr-qc); Earth and Planetary Astrophysics (astro-ph.EP); Solar and Stellar Astrophysics (astro-ph.SR); Space Physics (physics.space-ph) The long-term rates of change of all the Keplerian orbital elements of a two-body system acted upon by a remote massive pointlike object are analytically worked out, to the Newtonian quadrupolar level, without any restriction either on the orbital eccentricity and inclination of the disturbed pair or the position of the distant perturber. The latter is considered fixed during the average over one orbital revolution of the inner binary by means of which its orbital perturbations are calculated. The results are presented in a compact form that facilitates a straightforward application, for example, to the cases of the eclipsing binary 2M1510 AB made of two brown dwarfs, the supermassive black hole-or megapyknon-M87$^\\ast$ and our solar system, although they are not limited to such interesting astronomical scenarios alone. The aforementioned systems may all have in common the presence of a distant point mass perturbing in some ways their inner dynamics. That is, respectively, a circumbinary exoplanet whose orbital plane should be perpendicular to that of its host inner binary, an intermediate mass black hole potentially causing the observed jet precession, and a still unseen planet, known as Telisto or Planet Nine, which may, perhaps, have been recently spotted in archival images although in a quite different orbit with respect to that originally expected. For each of the considered cases, exclusion plots in their parameter spaces are provided.",
      "pdf_url": "https://arxiv.org/pdf/2508.18881.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2510.05246",
      "title": "Thermodynamic invariance of the energy-momentum tensor under matter-Lagrangian choices and its astrophysical implications in $f(R,T)$ gravity",
      "authors": [
        "Debadri Bhattacharjee",
        "Pradip Kumar Chattopadhyay"
      ],
      "abstract": "Thermodynamic invariance of the energy-momentum tensor under matter-Lagrangian choices and its astrophysical implications in $f(R,T)$ gravity Debadri Bhattacharjee, Pradip Kumar Chattopadhyay General Relativity and Quantum Cosmology (gr-qc) The correct choice for the matter Lagrangian $(\\mathcal{L_{M}})$ in the framework of $f(R,T)$ theory of gravity, has been a fundamental yet often overlooked ambiguity. It has been a long-standing issue, whether to choose $\\mathcal{L_{M}}=p$ or $-\\rho$ as the proper definition of matter sector. In this work, we show that both choices lead to the same energy-momentum tensor, from thermodynamic point of view. However, for these two choices, the structure of the TOV equations are different. We construct and solve TOV equations using MIT bag model equation of state for $\\mathcal{L_{M}}=p$ and $-\\rho$, and study the impact of the choices for matter Lagrangian on the maximum mass limit as well as M-R plot of compact stars. It is interesting to note that allowed range of gravity-matter coupling coefficient $(\\alpha_{c})$ is also different for $\\mathcal{L_{M}}=p$ and $\\mathcal{L_{M}}=-\\rho$, i.e., $\\alpha_{c}$ can not be taken arbitrarily. Notably, through $\\mathcal{L_{M}}=p$, we achieve a maximum mass of $2.78~M_{\\odot}$, whereas for $\\mathcal{L_{M}}=-\\rho$, we obtain a maximum mass of $2.41~M_{\\odot}$. So, despite the same energy-momentum tensor for different choices of $\\mathcal{L_{M}}$, the upper limit of maximum mass is significantly modified.",
      "pdf_url": "https://arxiv.org/pdf/2510.05246.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.03066",
      "title": "Dark matter halo as a source of regular black-hole geometries",
      "authors": [
        "R. A. Konoplya",
        "A. Zhidenko"
      ],
      "abstract": "Dark matter halo as a source of regular black-hole geometries R. A. Konoplya, A. Zhidenko 10 pages, 4 figures, references updated General Relativity and Quantum Cosmology (gr-qc) We construct exact black-hole solutions free of curvature singularities, sourced by dark matter halos described by galactic density profiles. Regularity of the geometry is ensured by adopting the relation $P_{r}=-\\rho$ between radial pressure and density, which is consistent with the phenomenological freedom of halo models. In particular, the sufficiently dense Einasto and Dehnen-type profiles for the dark matter halo can produce asymptotically flat solutions of singularity-free black holes embedded in the galactic environment. The resulting regular black holes surrounded by dark matter are shown to be stable under axial perturbations. We further compute the shadow radii and Lyapunov exponents associated with the photon circular orbits around these black holes.",
      "pdf_url": "https://arxiv.org/pdf/2511.03066.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.04649",
      "title": "Twist and higher modes of a complex scalar field at the threshold of collapse",
      "authors": [
        "Krinio Marouda",
        "Daniela Cors",
        "Hannes R. Rüter",
        "Alex Vaño-Viñuales",
        "David Hilditch"
      ],
      "abstract": "Twist and higher modes of a complex scalar field at the threshold of collapse Krinio Marouda, Daniela Cors, Hannes R. Rüter, Alex Vaño-Viñuales, David Hilditch General Relativity and Quantum Cosmology (gr-qc); Computational Physics (physics.comp-ph) We investigate the threshold of collapse of a massless complex scalar field in axisymmetric spacetimes under the ansatz of Choptuik et al. 2004, in which a symmetry depending on the azimuthal parameter $m$ is imposed on the scalar field. This allows for both non-vanishing twist and angular momentum. We extend earlier work to include higher angular modes. Using the pseudospectral code bamps with a new adapted symmetry reduction method, which we call $m$-cartoon, and a generalized twist-compatible apparent horizon finder, we evolve near-critical initial data to the verge of black hole formation for the lowest nontrivial modes, $m=1$ and $m=2$. For $m=1$ we recover discrete self-similarity with echoing period $\\Delta\\simeq0.42$ and power-law scaling with exponent $\\gamma\\simeq0.11$, consistent with earlier work. For $m=2$ we find that universality is maintained within this nonzero fixed-$m$ symmetry class but with smaller period and critical exponents, $\\Delta\\simeq0.09$ and $\\gamma\\simeq0.035$, establishing an explicit dependence of the critical solution on the angular mode. Analysis of the relation between the angular momentum and the mass of apparent horizons at the instant of formation, $J_{\\mathrm{AH}}{-}M_{\\mathrm{AH}}$, shows that the effect of angular momentum is minimal at the threshold, with $\\chi_{\\mathrm{AH}}=J_{\\mathrm{AH}}/M_{\\mathrm{AH}}^2\\to0$, and, therefore, excludes extremal black holes for the families under consideration. Our results demonstrate that while universality and DSS hold within each $m$-sector, the critical universal values vary with $m$, and neither extremality nor bifurcation occur in the complex scalar field model within the families considered here.",
      "pdf_url": "https://arxiv.org/pdf/2511.04649.pdf",
      "categories": [
        "gr-qc"
      ],
      "is_gw_related": false
    },
    {
      "id": "https://arxiv.org/abs/2511.06548",
      "title": "Stochastic Limit of Growing Gravitational Wave Memory from Sources in the Early Universe and Astrophysical Sources",
      "authors": [
        "Lydia Bieri"
      ],
      "abstract": "Stochastic Limit of Growing Gravitational Wave Memory from Sources in the Early Universe and Astrophysical Sources Lydia Bieri General Relativity and Quantum Cosmology (gr-qc); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Differential Geometry (math.DG) We show that the stochastic background of gravitational wave memory of growing type leads to a fractional Brownian motion increasing at the order of $t^{H}$ for large $t$ where $\\frac{1}{2} < H <1$. This beats the scaling law of Brownian motion. In this article we investigate sources of gravitational waves in the early universe as well as in astrophysical settings. Cosmological sources may include primordial black holes or other sources immediately after the Big Bang when there were pockets of hot material, and large density fluctuations. Gravitational waves from mergers of primordial black holes produce memory. We show that due to the conditions in which these are taking place the gravitational wave memory will be increasing in time following a certain power law. Corresponding results hold for any gravitational wave memory from a cosmological source where the surrounding conditions are similar. The stochastic limit of these memories is a stochastic process growing in time faster than the $\\sqrt{t}$ scaling law of Brownian motion. The latter is also typical for noise and for the limit of memory events as they have been mostly considered in the literature. In an expanding universe, the memory is enhanced by the expansion itself. Our results provide a tool to extract gravitational wave sources of this type from data using this memory signature. This would be particularly useful for the PTA data that has been already observed, answering the long-standing question on how to extract memory signals from the data. Further, the new results open up a new door to explore the conditions right after the Big Bang using the long-range dependence and further probability analysis.",
      "pdf_url": "https://arxiv.org/pdf/2511.06548.pdf",
      "categories": [
        "gr-qc",
        "astro-ph.CO",
        "math.DG"
      ],
      "is_gw_related": true
    }
  ]
}